{
    "id": "มาตรา 58",
    "title": "สิทธิของผู้ร้องสอด",
    "content": {
        "paragraphs": [
            {
                "id": 1,
                "content": "ผู้ร้องสอดที่ได้เข้าเป็นคู่ความตามอนุมาตรา (๑) และ (๓) แห่งมาตราก่อนนี้ มีสิทธิเสมือนหนึ่งว่าตนได้ฟ้องหรือถูกฟ้องเป็นคดีเรื่องใหม่ ซึ่งโดยเฉพาะผู้ร้องสอดอาจนำพยานหลักฐานใหม่มาแสดง คัดค้านเอกสารที่ได้ยื่นไว้ ถามค้านพยานที่ได้สืบมาแล้ว และคัดค้านพยานหลักฐานที่ได้สืบไปแล้วก่อนที่ตนได้ร้องสอดอาจอุทธรณ์ฎีกาคำพิพากษาหรือคำสั่งของศาลตามที่กฎหมายบัญญัติไว้ และอาจได้รับหรือถูกบังคับให้ใช้ค่าฤชาธรรมเนียม",
                "subsections": null
            },
            {
                "id": 2,
                "content": "ห้ามมิให้ผู้ร้องสอดที่ได้เป็นคู่ความตามอนุมาตรา (๒) แห่งมาตราก่อน ใช้สิทธิอย่างอื่นนอกจากสิทธิที่มีอยู่แก่คู่ความฝ่ายซึ่งตนเข้าเป็นโจทก์ร่วมหรือจำเลยร่วมในชั้นพิจารณาเมื่อตนร้องสอด และห้ามมิให้ใช้สิทธิเช่นว่านั้นในทางที่ขัดกับสิทธิของโจทก์หรือจำเลยเดิม และให้ผู้ร้องสอดเสียค่าฤชาธรรมเนียมอันเกิดแต่การที่ร้องสอด แต่ถ้าศาลได้อนุญาตให้เข้าแทนที่โจทก์ หรือจำเลยเดิม ผู้ร้องสอดจึงมีฐานะเสมอด้วยคู่ความที่ตนเข้าแทน",
                "subsections": null
            },
            {
                "id": 3,
                "content": "เมื่อได้มีคำพิพากษาหรือคำสั่งแล้ว ถ้ามีข้อเกี่ยวข้องกับคดี เป็นปัญหาจะต้องวินิจฉัยในระหว่างผู้ร้องสอดกับคู่ความฝ่ายที่ตนเข้ามาร่วม หรือที่ตนถูกหมายเรียกให้เข้ามาร่วม ผู้ร้องสอดย่อมต้องผูกพันตามคำพิพากษาหรือคำสั่งนั้น เว้นแต่ในกรณีต่อไปนี้",
                "subsections": [
                    {
                        "id": 1,
                        "content": "เนื่องจากความประมาทเลินเล่อของคู่ความนั้นทำให้ผู้ร้องสอดเข้ามาเป็นคู่ความในคดีช้าเกินสมควรที่จะแสดงข้อเถียงอันเป็นสาระสำคัญได้ หรือ"
                    },
                    {
                        "id": 2,
                        "content": "เมื่อคู่ความนั้นจงใจหรือประมาทเลินเล่ออย่างร้ายแรงมิได้ยกขึ้นใช้ซึ่งข้อเถียงในปัญหาข้อกฎหมายหรือข้อเท็จจริงอันเป็นสาระสำคัญซึ่งผู้ร้องสอดมิได้รู้ว่ามีอยู่เช่นนั้น"
                    }
                ]
            }
        ]
    }
}
