{
    "id": "มาตรา 198 ทวิ",
    "title": "ศาลมีคำพิพากษาให้โจทก์เป็นฝ่ายชนะคดีโดยจำเลยขาดนัดยื่นคำให้การ",
    "content": {
        "paragraphs": [
            {
                "id": 1,
                "content": " ศาลจะมีคำพิพากษาหรือคำสั่งชี้ขาดให้โจทก์เป็นฝ่ายชนะคดีโดยจำเลยขาดนัดยื่นคำให้การมิได้ เว้นแต่ศาลเห็นว่าคำฟ้องของโจทก์มีมูลและไม่ขัดต่อกฎหมาย  ในการนี้ ศาลจะยกขึ้นอ้างโดยลำพังซึ่งข้อกฎหมายอันเกี่ยวด้วยความสงบเรียบร้อยของประชาชนก็ได้",
                "subsections": null
            },
            {
                "id": 2,
                "content": "เพื่อประโยชน์ในการพิพากษาหรือมีคำสั่งชี้ขาดคดีตามวรรคหนึ่ง ศาลอาจสืบพยานเกี่ยวกับข้ออ้างของโจทก์หรือพยานหลักฐานอื่นไปฝ่ายเดียวตามที่เห็นว่าจำเป็นก็ได้ แต่ในคดีเกี่ยวด้วยสิทธิแห่งสภาพบุคคล สิทธิในครอบครัวหรือคดีพิพาทเกี่ยวด้วยกรรมสิทธิ์ในอสังหาริมทรัพย์ ให้ศาลสืบพยานหลักฐานโจทก์ไปฝ่ายเดียว และศาลอาจเรียกพยานหลักฐานอื่นมาสืบได้เองตามที่เห็นว่าจำเป็นเพื่อประโยชน์แห่งความยุติธรรม",
                "subsections": null
            },
            {
                "id": 3,
                "content": "ในการกำหนดจำนวนเงินตามคำขอบังคับของโจทก์ ให้ศาลปฏิบัติดังนี้",
                "subsections": [
                    {
                        "id": 1,
                        "content": "ในกรณีที่โจทก์มีคำขอบังคับให้จำเลยชำระหนี้เป็นเงินจำนวนแน่นอน ให้ศาลมีคำสั่งให้โจทก์ส่งพยานเอกสารตามที่ศาลเห็นว่าจำเป็นแทนการสืบพยาน",
                        "subsections": null
                    },
                    {
                        "id": 2,
                        "content": "ในกรณีที่โจทก์มีคำขอบังคับให้จำเลยชำระหนี้เป็นเงินอันไม่อาจกำหนดจำนวนได้โดยแน่นอน ให้ศาลสืบพยานหลักฐานโจทก์ไปฝ่ายเดียว และศาลอาจเรียกพยานหลักฐานอื่นมาสืบได้เองตามที่เห็นว่าจำเป็น",
                        "subsections": null
                    }
                ]
            },
            {
                "id": 4,
                "content": "ถ้าจำเลยที่ขาดนัดยื่นคำให้การไม่มาศาลในวันสืบพยานตามมาตรานี้ มิให้ถือว่าจำเลยนั้นขาดนัดพิจารณา"
            },
            {
                "id": 5,
                "content": "ถ้าโจทก์ไม่นำพยานหลักฐานมาสืบตามความในมาตรานี้ภายในระยะเวลาที่ศาลกำหนด ให้ถือว่าคดีของโจทก์ไม่มีมูล และให้ศาลยกฟ้องของโจทก์"
            }
        ]
    }
}
