{
    "administrative_procedure_act": [
      {
            "id": "มาตรา 5",
            "title": "ความหมาย ในพระราชบัญญัตินี้",
            "content": {
                "paragraphs": [
                    {
                        "id": 1,
                        "content": "“วิธีปฏิบัติราชการทางปกครอง” หมายความว่า การเตรียมการและการดำเนินการของเจ้าหน้าที่เพื่อจัดให้มีคำสั่งทางปกครองหรือกฎ และรวมถึงการดำเนินการใด ๆ ในทางปกครองตามพระราชบัญญัตินี้"
                    },
                    {
                        "id": 2,
                        "content": "“การพิจารณาทางปกครอง” หมายความว่า การเตรียมการและการดำเนินการของเจ้าหน้าที่เพื่อจัดให้มีคำสั่งทางปกครอง"
                    },
                    {
                        "id": 3,
                        "content": "“คำสั่งทางปกครอง” หมายความว่า",
                        "subsections": [
                            {
                                "id": "1",
                                "content": "การใช้อำนาจตามกฎหมายของเจ้าหน้าที่ที่มีผลเป็นการสร้างนิติสัมพันธ์ขึ้นระหว่างบุคคลในอันที่จะก่อ เปลี่ยนแปลง โอน สงวน ระงับ หรือมีผลกระทบต่อสถานภาพของสิทธิหรือหน้าที่ของบุคคล ไม่ว่าจะเป็นการถาวรหรือชั่วคราว เช่น การสั่งการ การอนุญาต การอนุมัติ การวินิจฉัยอุทธรณ์ การรับรอง และการรับจดทะเบียน แต่ไม่หมายความรวมถึงการออกกฎ"
                            },
                            {
                                "id": "2",
                                "content": "การอื่นที่กำหนดในกฎกระทรวง"
                            }
                        ]
                    },
                    {
                        "id": 4,
                        "content": "“กฎ” หมายความว่า พระราชกฤษฎีกา กฎกระทรวง ประกาศกระทรวง ข้อบัญญัติท้องถิ่นระเบียบ ข้อบังคับ หรือบทบัญญัติอื่นที่มีผลบังคับเป็นการทั่วไป โดยไม่มุ่งหมายให้ใช้บังคับแก่กรณีใดหรือบุคคลใดเป็นการเฉพาะ"
                    },
                    {
                        "id": 5,
                        "content": "“คณะกรรมการวินิจฉัยข้อพิพาท” หมายความว่า คณะกรรมการที่จัดตั้งขึ้นตามกฎหมายที่มีการจัดองค์กรและวิธีพิจารณาสำหรับการวินิจฉัยชี้ขาดสิทธิและหน้าที่ตามกฎหมาย"
                    },
                    {
                        "id": 6,
                        "content": "“เจ้าหน้าที่” หมายความว่า บุคคล คณะบุคคล หรือนิติบุคคล ซึ่งใช้อำนาจหรือได้รับมอบให้ใช้อำนาจทางปกครองของรัฐในการดำเนินการอย่างหนึ่งอย่างใดตามกฎหมาย ไม่ว่าจะเป็นการจัดตั้งขึ้นในระบบราชการ รัฐวิสาหกิจหรือกิจการอื่นของรัฐหรือไม่ก็ตาม"
                    },
                    {
                        "id": 7,
                        "content": "“คู่กรณี” หมายความว่า ผู้ยื่นคำขอหรือผู้คัดค้านคำขอ ผู้อยู่ในบังคับหรือจะอยู่ในบังคับของคำสั่งทางปกครอง และผู้ซึ่งได้เข้ามาในกระบวนการพิจารณาทางปกครองเนื่องจากสิทธิของผู้นั้นจะถูกกระทบกระเทือนจากผลของคำสั่งทางปกครอง"
                    }
                ]
            }
        }
    ]
}
