{
    "budgetetary_procudures_act": [
        {
            "id": "มาตรา 4",
            "title": "ความหมาย",
            "content": {
                "paragraphs": [
                    {
                        "id": 1,
                        "content": "“งบประมาณรายจ่าย” หมายความว่า จํานวนเงินอย่างสูงที่อนุญาตให้จ่ายหรือให้ก่อหนี้ผูกพันได้ตามวัตถุประสงค์และภายในระยะเวลาที่กําหนดไว้ในกฎหมายว่าด้วยงบประมาณรายจ่าย"
                    },
                    {
                        "id": 2,
                        "content": "“งบประมาณรายจ่ายข้ามปี” หมายความว่า งบประมาณรายจ่ายที่มีระยะเวลาการใช้ได้เกินปีงบประมาณตามวัตถุประสงค์และระยะเวลาที่กําหนดไว้ในกฎหมายว่าด้วยงบประมาณรายจ่าย"
                    },
                    {
                        "id": 3,
                        "content": "“กฎหมายว่าด้วยงบประมาณรายจ่าย” หมายความว่า พระราชบัญญัติงบประมาณรายจ่ายประจําปี พระราชบัญญัติงบประมาณรายจ่ายเพิ่มเติม หรือพระราชบัญญัติโอนงบประมาณรายจ่าย แล้วแต่กรณี"
                    },
                    {
                        "id": 4,
                        "content": "“ปีงบประมาณ” หมายความว่า ระยะเวลาตั้งแต่วันที่ ๑ ตุลาคมของปีหนึ่ง ถึงวันที่ ๓๐ กันยายนของปีถัดไป และให้ใช้ปี พ.ศ. ที่ถัดไปนั้นเป็นชื่อสําหรับปีงบประมาณนั้น"
                    },
                    {
                        "id": 5,
                        "content": "เงินนอกงบประมาณ” หมายความว่า บรรดาเงินทั้งปวงที่หน่วยงานของรัฐจัดเก็บหรือได้รับไว้เเป็นกรรมสิทธิ์ตามกฎหมาย ระเบียบ ข้อบังคับ หรือจากนิติกรรมหรือนิติเหตุ หรือกรณีอื่นใด ที่ต้องนําส่งคลัง แต่มีกฎหมายอนุญาตให้สามารถเก็บไว้ใช้จ่ายได้โดยไม่ต้องนําส่งคลัง"
                    },
                    {
                        "id": 6,
                        "content": "“หนี้” หมายความว่า ข้อผูกพันที่จะต้องจ่ายหรืออาจจะต้องจ่ายเป็นเงิน สิ่งของหรือบริการ ไม่ว่าจะเป็นข้อผูกพันอันเกิดจากการกู้ยืม การค้ําประกัน การซื้อหรือการจ้างโดยใช้เครดิตหรือจากการอื่นใด"
                    },
                    {
                        "id": 7,
                        "content": "“เงินจัดสรร” หมายความว่า ส่วนหนึ่งของงบประมาณรายจ่ายที่แบ่งสรรให้จ่าย หรือให้ก่อหนี้ผูกพันในระยะเวลาหนึ่ง"
                    },
                    {
                        "id": 8,
                        "content": "“หน่วยรับงบประมาณ” หมายความว่า หน่วยงานของรัฐที่ขอรับหรือได้รับจัดสรรงบประมาณรายจ่าย และให้หมายความรวมถึงสภากาชาดไทยด้วย"
                    },
                    {
                        "id": 11,
                        "content": "“รัฐวิสาหกิจ”  หมายความว่า",
                        "subsections": [
                            {
                                "id": "1",
                                "content": "องค์การของรัฐบาลตามกฎหมายว่าด้วยการจัดตั้งองค์การของรัฐบาลกิจการของรัฐซึ่งมีกฎหมายจัดตั้งขึ้นหรือหน่วยงานธุรกิจที่รัฐบาลเป็นเจ้าของ"
                            },
                            {
                                "id": "2",
                                "content": "บริษัทจํากัดหรือบริษัทมหาชนจํากัดที่ส่วนราชการและรัฐวิสาหกิจตาม  (๑)  หรือ  (๒)  หรือที่รัฐวิสาหกิจตาม  (๑)  และ  (๒)  หรือที่รัฐวิสาหกิจตาม  (๒)  มีทุนรวมอยู่ด้วยเกินร้อยละห้าสิบ"
                            }
                        ]
                    }
                ]
            }
        },
        {
            "id": "มาตรา 15",
            "title": "งบประมาณรายจ่ายงบกลาง ได้แก่",
            "content": {
                "paragraphs": [
                    {
                        "id": 1,
                        "content": "งบประมาณรายจ่ายงบกลาง ได้แก่ งบประมาณรายจ่ายที่ตั้งไว้เพื่อจัดสรรให้แก่หน่วยรับงบประมาณใช้จ่าย โดยแยกต่างหากจากงบประมาณรายจ่ายของหน่วยรับงบประมาณ และให้มีรายการเงินสํารองจ่ายเพื่อกรณีฉุกเฉินหรือจําเป็นด้วย"
                    }
                ]
            }
        },
        {
            "id": "มาตรา 18",
            "title": "ข้อจำกัดของงบประมาณรายจ่ายข้ามปี",
            "content": {
                "paragraphs": [
                    {
                        "id": 1,
                        "content": "งบประมาณรายจ่ายข้ามปีจะมีได้ในกรณีที่คาดว่าจะใช้งบประมาณรายจ่ายให้เสร็จทันภายในปีงบประมาณไม่ได้ โดยต้องกําหนดเวลาสิ้นสุดไว้ด้วย"
                    },
                    {
                        "id": 2,
                        "content": "การจัดทํางบประมาณรายจ่ายข้ามปีให้เป็นไปตามหลักเกณฑ์และวิธีการที่ผู้อํานวยการกําหนดโดยความเห็นชอบของคณะรัฐมนตรี"
                    }
                ]
            }
        },
        {
            "id": "มาตรา 35",
            "title": "ห้ามโอนงบประมาณรายจ่าย",
            "content": {
                "paragraphs": [
                    {
                        "id": 1,
                        "content": "งบประมาณรายจ่ายของหน่วยรับงบประมาณที่กําหนดไว้ตามกฎหมายว่าด้วยงบประมาณรายจ่าย จะโอนหรือนําไปใช้สําหรับหน่วยรับงบประมาณอื่นมิได้ เว้นแต่",
                        "subsections": [
                            {
                                "id": "1",
                                "content": "มีพระราชบัญญัติให้โอนหรือนําไปใช้ได้"
                            },
                            {
                                "id": "2",
                                "content": "ในกรณีที่มีพระราชกฤษฎีการวมหรือโอนส่วนราชการเข้าด้วยกันไม่ว่าจะมีผลเป็นการจัดตั้งส่วนราชการขึ้นใหม่หรือไม่ก็ตาม ให้โอนงบประมาณรายจ่ายของส่วนราชการที่ถูกโอนหรือรวมเข้าด้วยกันนั้นไปเป็นของส่วนราชการที่รับโอนหรือที่รวมเข้าด้วยกัน หรือส่วนราชการที่จัดตั้งขึ้นใหม่ แล้วแต่กรณี ทั้งนี้ ตามที่กําหนดในพระราชกฤษฎีกาดังกล่าว"
                            },
                            {
                                "id": "3",
                                "content": "การโอนงบประมาณรายจ่ายบูรณาการภายใต้แผนงานบูรณาการเดียวกัน"
                            },
                            {
                                "id": "4",
                                "content": "การโอนงบประมาณรายจ่ายบุคลากรภายใต้แผนงานบุคลากรภาครัฐ"
                            }
                        ]
                    },
                    {
                        "id": 2,
                        "content": "การโอนงบประมาณรายจ่ายตาม (๓) และ (๔) ให้กระทําได้เท่าที่จําเป็นและไม่เกิดผลเสียหายต่อการดําเนินการตามแผนงานบูรณาการและแผนงานบุคลากรภาครัฐ ทั้งนี้ ตามระเบียบที่ผู้อํานวยการกําหนดโดยความเห็นชอบของคณะรัฐมนตรี"
                    }
                ]
            }
        },
        {
            "id": "มาตรา 36",
            "title": "โอนงบประมาณรายจ่าย ต้องได้รับอนุมัติจากผู้อำนวยการ",
            "content": {
                "paragraphs": [
                    {
                        "id": 1,
                        "content": "งบประมาณรายจ่ายของหน่วยรับงบประมาณที่กําหนดไว้ในแผนงานหรือรายการใดตามกฎหมายว่าด้วยงบประมาณรายจ่าย หรือพระราชกฤษฎีกาตามมาตรา ๓๕ (๒) จะโอนหรือนําไปใช้ในแผนงานหรือรายการอื่นมิได้ เว้นแต่จะได้รับอนุมัติจากผู้อํานวยการ แต่ผู้อํานวยการจะอนุมัติมิได้ในกรณีที่เป็นผลให้เพิ่มรายจ่ายประเภทเงินราชการลับ หรือเป็นแผนงานหรือโครงการใหม่ เว้นแต่จะได้รับอนุมัติจากคณะรัฐมนตรี"
                    },
                    {
                        "id": 2,
                        "content": "รายจ่ายรายการต่างๆ ที่กําหนดไว้ในงบประมาณรายจ่ายงบกลาง ให้ผู้อํานวยการมีอํานาจจัดสรรให้หน่วยรับงบประมาณเบิกจ่ายโดยตรง หรือเบิกจ่ายในรายการต่าง ๆ ของหน่วยรับงบประมาณนั้น ๆ ได้ตามความจําเป็น"
                    },
                    {
                        "id": 3,
                        "content": "ในกรณีที่มีความจําเป็นผู้อํานวยการโดยอนุมัตินายกรัฐมนตรีจะโอนงบประมาณรายจ่ายงบกลางรายการใดรายการหนึ่งไปเพิ่มรายการอื่น ๆ ในงบกลางด้วยกันก็ได้"
                    }
                ]
            }
        },
        {
            "id": "มาตรา 41",
            "title": "การเบิกจ่ายงบประมาณรายจ่ายข้ามปี",
            "content": {
                "paragraphs": [
                    {
                        "id": 1,
                        "content": "รายการงบประมาณรายจ่ายตามกฎหมายว่าด้วยงบประมาณรายจ่ายที่จะต้องก่อหนี้ผูกพันข้ามปีงบประมาณ ให้ผู้อํานวยการรวบรวมรายการงบประมาณรายจ่ายที่จะต้องก่อหนี้ผูกพันและวงเงินที่คาดว่าจะต้องก่อหนี้ผูกพันงบประมาณรายจ่ายในปีต่อๆ ไป รวมทั้งจํานวนเงินเผื่อเหลือเผื่อขาดเสนอให้คณะรัฐมนตรีพิจารณาอนุมัติการก่อหนี้ผูกพันภายในหกสิบวันนับแต่วันที่กฎหมายว่าด้วยงบประมาณรายจ่ายมีผลใช้บังคับ และเมื่อคณะรัฐมนตรีอนุมัติแล้ว ให้หน่วยรับงบประมาณดําเนินการตามระเบียบที่ผู้อํานวยการกําหนดโดยความเห็นชอบของคณะรัฐมนตรี"
                    }
                ]
            }
        },
        {
            "id": "มาตรา 52",
            "title": "ฝ่าฝืนพระราชบัญญัตินี้",
            "content": {
                "paragraphs": [
                    {
                        "id": 1,
                        "content": "ข้าราชการ พนักงานราชการ ลูกจ้าง หรือเจ้าหน้าที่ของรัฐในหน่วยรับงบประมาณผู้ใดจ่ายเงินหรือก่อหนี้ผูกพัน หรือโดยรู้อยู่แล้วยินยอมให้กระทําการดังกล่าวนั้นโดยฝ่าฝืนพระราชบัญญัตินี้หรือระเบียบที่ออกตามพระราชบัญญัตินี้ นอกจากความรับผิดทางอาญาซึ่งอาจได้รับตามกฎหมายอื่นแล้วผู้กระทําหรือผู้ยินยอมให้กระทําการดังกล่าวจะต้องรับผิดชดใช้เงินงบประมาณที่หน่วยรับงบประมาณได้จ่ายไปหรือต้องผูกพันจะต้องจ่าย ตลอดจนค่าสินไหมทดแทนใด ๆ ให้แก่หน่วยรับงบประมาณนั้น"
                    },
                    {
                        "id": 2,
                        "content": "บุคคลภายนอกผู้ได้รับประโยชน์จากการกระทําตามวรรคหนึ่ง จะต้องร่วมรับผิดกับผู้กระทําการฝ่าฝืนด้วย เว้นแต่จะแสดงได้ว่าตนได้กระทําไปโดยสุจริตไม่รู้เท่าถึงการฝ่าฝืนพระราชบัญญัติหรือระเบียบดังกล่าว"
                    },
                    {
                        "id": 3,
                        "content": "ความในวรรคหนึ่งไม่ใช้บังคับแก่ข้าราชการ พนักงานราชการ ลูกจ้าง หรือเจ้าหน้าที่ของรัฐซึ่งได้ทักท้วงคําสั่งของผู้บังคับบัญชาหรือได้บันทึกข้อโต้แย้งไว้เป็นหนังสือแล้วว่า การที่จะปฏิบัติตามคําสั่งนั้นอาจไม่ชอบด้วยกฎหมายหรือระเบียบ"
                    }
                ]
            }
        }
    ]
}
