{
    "budgetetary_procudures_act": [
        {
            "id": "มาตรา 4",
            "title": "ความหมาย",
            "content": {
                "paragraphs": [
                    {
                        "id": 1,
                        "content": "“งบประมาณรายจ่าย” หมายความว่า จํานวนเงินอย่างสูงที่อนุญาตให้จ่ายหรือให้ก่อหนี้ผูกพันได้ตามวัตถุประสงค์และภายในระยะเวลาที่กําหนดไว้ในกฎหมายว่าด้วยงบประมาณรายจ่าย"
                    },
                    {
                        "id": 2,
                        "content": "“งบประมาณรายจ่ายข้ามปี” หมายความว่า งบประมาณรายจ่ายที่มีระยะเวลาการใช้ได้เกินปีงบประมาณตามวัตถุประสงค์และระยะเวลาที่กําหนดไว้ในกฎหมายว่าด้วยงบประมาณรายจ่าย"
                    },
                    {
                        "id": 3,
                        "content": "“กฎหมายว่าด้วยงบประมาณรายจ่าย” หมายความว่า พระราชบัญญัติงบประมาณรายจ่ายประจําปี พระราชบัญญัติงบประมาณรายจ่ายเพิ่มเติม หรือพระราชบัญญัติโอนงบประมาณรายจ่าย แล้วแต่กรณี"
                    },
                    {
                        "id": 4,
                        "content": "“ปีงบประมาณ” หมายความว่า ระยะเวลาตั้งแต่วันที่ ๑ ตุลาคมของปีหนึ่ง ถึงวันที่ ๓๐ กันยายนของปีถัดไป และให้ใช้ปี พ.ศ. ที่ถัดไปนั้นเป็นชื่อสําหรับปีงบประมาณนั้น"
                    },
                    {
                        "id": 5,
                        "content": "เงินนอกงบประมาณ” หมายความว่า บรรดาเงินทั้งปวงที่หน่วยงานของรัฐจัดเก็บหรือได้รับไว้เเป็นกรรมสิทธิ์ตามกฎหมาย ระเบียบ ข้อบังคับ หรือจากนิติกรรมหรือนิติเหตุ หรือกรณีอื่นใด ที่ต้องนําส่งคลัง แต่มีกฎหมายอนุญาตให้สามารถเก็บไว้ใช้จ่ายได้โดยไม่ต้องนําส่งคลัง"
                    },
                    {
                        "id": 6,
                        "content": "“หนี้” หมายความว่า ข้อผูกพันที่จะต้องจ่ายหรืออาจจะต้องจ่ายเป็นเงิน สิ่งของหรือบริการ ไม่ว่าจะเป็นข้อผูกพันอันเกิดจากการกู้ยืม การค้ําประกัน การซื้อหรือการจ้างโดยใช้เครดิตหรือจากการอื่นใด"
                    },
                    {
                        "id": 7,
                        "content": "“เงินจัดสรร” หมายความว่า ส่วนหนึ่งของงบประมาณรายจ่ายที่แบ่งสรรให้จ่าย หรือให้ก่อหนี้ผูกพันในระยะเวลาหนึ่ง"
                    },
                    {
                        "id": 8,
                        "content": "“หน่วยรับงบประมาณ” หมายความว่า หน่วยงานของรัฐที่ขอรับหรือได้รับจัดสรรงบประมาณรายจ่าย และให้หมายความรวมถึงสภากาชาดไทยด้วย"
                    },
                    {
                        "id": 11,
                        "content": "“รัฐวิสาหกิจ”  หมายความว่า",
                        "subsections": [
                            {
                                "id": 1,
                                "content": "องค์การของรัฐบาลตามกฎหมายว่าด้วยการจัดตั้งองค์การของรัฐบาลกิจการของรัฐซึ่งมีกฎหมายจัดตั้งขึ้นหรือหน่วยงานธุรกิจที่รัฐบาลเป็นเจ้าของ"
                            },
                            {
                                "id": 2,
                                "content": "บริษัทจํากัดหรือบริษัทมหาชนจํากัดที่ส่วนราชการและรัฐวิสาหกิจตาม  (๑)  หรือ  (๒)  หรือที่รัฐวิสาหกิจตาม  (๑)  และ  (๒)  หรือที่รัฐวิสาหกิจตาม  (๒)  มีทุนรวมอยู่ด้วยเกินร้อยละห้าสิบ"
                            }
                        ]
                    }
                ]
            }
        }
    ]
}
