{
    "civil_and_commercial_code": [
        {
            "id": "มาตรา 7",
            "title": "อัตราดอกเบี้ย",
            "content": {
                "paragraphs": [
                    {
                        "id": 1,
                        "content": "ถ้าจะต้องเสียดอกเบี้ยแก่กันและมิได้กำหนดอัตราดอกเบี้ยไว้โดยนิติกรรมหรือโดยบทกฎหมายอันชัดแจ้ง ให้ใช้อัตราร้อยละสามต่อปี",
                        "subsections": null
                    },
                    {
                        "id": 2,
                        "content": "อัตราตามวรรคหนึ่งอาจปรับเปลี่ยนให้ลดลงหรือเพิ่มขึ้นเพื่อให้สอดคล้องกับสภาพเศรษฐกิจของประเทศได้โดยตราเป็นพระราชกฤษฎีกา โดยปกติให้กระทรวงการคลังพิจารณาทบทวนทุกสามปีให้ใกล้เคียงกับอัตราเฉลี่ยระหว่างอัตราดอกเบี้ยเงินฝากกับอัตราดอกเบี้ยเงินให้กู้ยืมของธนาคารพาณิชย์",
                        "subsections": null
                    }
                ]
            }
        },
        {
            "id": "มาตรา 9",
            "title": "หนังสือต้องลงลายมือชื่อ",
            "content": {
                "paragraphs": [
                    {
                        "id": 1,
                        "content": "เมื่อมีกิจการอันใดซึ่งกฎหมายบังคับให้ทำเป็นหนังสือ บุคคลผู้จะต้องทำหนังสือไม่จำเป็นต้องเขียนเอง แต่หนังสือนั้นต้องลงลายมือชื่อของบุคคลนั้น",
                        "subsections": null
                    },
                    {
                        "id": 2,
                        "content": "ลายพิมพ์นิ้วมือ แกงได ตราประทับ หรือเครื่องหมายอื่นทำนองเช่นว่านั้นที่ทำลงในเอกสารแทนการลงลายมือชื่อ หากมีพยานลงลายมือชื่อรับรองไว้ด้วยสองคนแล้วให้ถือเสมอกับลงลายมือชื่อ",
                        "subsections": null
                    },
                    {
                        "id": 3,
                        "content": "ความในวรรคสองไม่ใช้บังคับแก่การลงลายพิมพ์นิ้วมือ แกงได ตราประทับ หรือเครื่องหมายอื่นทำนองเช่นว่านั้น ซึ่งทำลงในเอกสารที่ทำต่อหน้าพนักงานเจ้าหน้าที่",
                        "subsections": null
                    }
                ]
            }
        },
        {
            "id": "มาตรา 640",
            "title": "สัญญายืมใช้คงรูป",
            "content": {
                "paragraphs": [
                    {
                        "id": 1,
                        "content": "อันว่ายืมใช้คงรูปนั้น คือสัญญาซึ่งบุคคลคนหนึ่ง เรียกว่าผู้ให้ยืม ให้บุคคลอีกคนหนึ่ง เรียกว่าผู้ยืม ใช้สอยทรัพย์สินสิ่งใดสิ่งหนึ่งได้เปล่า และผู้ยืมตกลงว่าจะคืนทรัพย์สินนั้น เมื่อได้ใช้สอยเสร็จแล้ว",
                        "subsections": null
                    }
                ]
            }
        },
        {
            "id": "มาตรา 641",
            "title": "สัญญายืมใช้คงรูปบริบูรณ์",
            "content": {
                "paragraphs": [
                    {
                        "id": 1,
                        "content": "การให้ยืมใช้คงรูปนั้น ท่านว่าย่อมบริบูรณ์ต่อเมื่อส่งมอบทรัพย์สินซึ่งให้ยืม",
                        "subsections": null
                    }
                ]
            }
        },
        {
            "id": "มาตรา 642",
            "title": "ค่าฤชาธรรมเนียมในการทำสัญญายืมใช้คงรูป",
            "content": {
                "paragraphs": [
                    {
                        "id": 1,
                        "content": "ค่าฤชาธรรมเนียมในการทำสัญญาก็ดี ค่าส่งมอบและค่าส่งคืนทรัพย์สินซึ่งยืมก็ดี ย่อมตกแก่ผู้ยืมเป็นผู้เสีย",
                        "subsections": null
                    }
                ]
            }
        },
        {
            "id": "มาตรา 643",
            "title": "ความรับผิดของผู้ยืม",
            "content": {
                "paragraphs": [
                    {
                        "id": 1,
                        "content": "ทรัพย์สินซึ่งยืมนั้น ถ้าผู้ยืมเอาไปใช้การอย่างอื่นนอกจากการอันเป็นปกติแก่ทรัพย์สินนั้น หรือนอกจากการอันปรากฏในสัญญาก็ดี เอาไปให้บุคคลภายนอกใช้สอยก็ดี เอาไปไว้นานกว่าที่ควรจะเอาไว้ก็ดี ท่านว่าผู้ยืมจะต้องรับผิดในเหตุทรัพย์สินนั้นสูญหายหรือบุบสลายไปอย่างหนึ่งอย่างใด แม้ถึงจะเป็นเพราะเหตุสุดวิสัย เว้นแต่จะพิสูจน์ได้ว่าถึงอย่างไร ๆ ทรัพย์สินนั้นก็คงจะต้องสูญหายหรือบุบสลายอยู่นั่นเอง",
                        "subsections": null
                    }
                ]
            }
        },
        {
            "id": "มาตรา 644",
            "title": "ผู้ยืมจำต้องสงวน",
            "content": {
                "paragraphs": [
                    {
                        "id": 1,
                        "content": "ผู้ยืมจำต้องสงวนทรัพย์สินซึ่งยืมไปเหมือนเช่นวิญญูชนจะพึงสงวนทรัพย์สินของตนเอง",
                        "subsections": null
                    }
                ]
            }
        },
        {
            "id": "มาตรา 645",
            "title": "สิทธิการบอกเลิกสัญญาของผู้ให้ยืม",
            "content": {
                "paragraphs": [
                    {
                        "id": 1,
                        "content": "ในกรณีทั้งหลายดังกล่าวไว้ในมาตรา ๖๔๓ นั้นก็ดี หรือถ้าผู้ยืมประพฤติฝ่าฝืนต่อความในมาตรา ๖๔๔ ก็ดี ผู้ให้ยืมจะบอกเลิกสัญญาเสียก็ได้",
                        "subsections": null
                    }
                ]
            }
        },
        {
            "id": "มาตรา 646",
            "title": "สิทธิการเรียกคืนทรัพย์สินของผู้ให้ยืม",
            "content": {
                "paragraphs": [
                    {
                        "id": 1,
                        "content": "ถ้ามิได้กำหนดเวลากันไว้ ท่านให้คืนทรัพย์สินที่ยืมเมื่อผู้ยืมได้ใช้สอยทรัพย์สินนั้นเสร็จแล้วตามการอันปรากฏในสัญญา แต่ผู้ให้ยืมจะเรียกคืนก่อนนั้นก็ได้ เมื่อเวลาได้ล่วงไปพอแก่การที่ผู้ยืมจะได้ใช้สอยทรัพย์สินนั้นเสร็จแล้ว",
                        "subsections": null
                    },
                    {
                        "id": 2,
                        "content": "ถ้าเวลาก็มิได้กำหนดกันไว้ ทั้งในสัญญาก็ไม่ปรากฏว่ายืมไปใช้เพื่อการใดไซร้ ท่านว่าผู้ให้ยืมจะเรียกของคืนเมื่อไรก็ได้",
                        "subsections": null
                    }
                ]
            }
        },
        {
            "id": "มาตรา 1025",
            "title": "ห้างหุ้นส่วนสามัญ",
            "content": {
                "paragraphs": [
                    {
                        "id": 1,
                        "content": "อันว่าห้างหุ้นส่วนสามัญนั้น คือห้างหุ้นส่วนประเภทซึ่งผู้เป็นหุ้นส่วนหมดทุกคนต้องรับผิดร่วมกันเพื่อหนี้ทั้งปวงของหุ้นส่วนโดยไม่มีจำกัด",
                        "subsections": null
                    }

                ]
            }
        },
        {
            "id": "มาตรา 1033",
            "title": "หุ้นส่วนมิได้ตกลง",
            "content": {
                "paragraphs": [
                    {
                        "id": 1,
                        "content": "ถ้าผู้เป็นหุ้นส่วนมิได้ตกลงกันไว้ในกระบวนจัดการห้างหุ้นส่วนไซร้ ท่านว่าผู้เป็นหุ้นส่วนย่อมจัดการห้างหุ้นส่วนนั้นได้ทุกคน แต่ผู้เป็นหุ้นส่วนคนหนึ่งคนใดจะเข้าทำสัญญาอันใดซึ่งผู้เป็นหุ้นส่วนอีกคนหนึ่งทักท้วงนั้นไม่ได้",
                        "subsections": null
                    },
                    {
                        "id": 2,
                        "content": "ในกรณีเช่นนี้ ท่านให้ถือว่าผู้เป็นหุ้นส่วนย่อมเป็นหุ้นส่วนผู้จัดการทุกคน",
                        "subsections": null
                    }
                ]
            }
        },
        {
            "id": "มาตรา 1035",
            "title": "ถ้าได้ตกลงกันไว้ว่าจะให้ผู้เป็นหุ้นส่วนหลายคนจัดการห้างหุ้นส่วน",
            "content": {
                "paragraphs": [
                    {
                        "id": 1,
                        "content": "ถ้าได้ตกลงกันไว้ว่าจะให้ผู้เป็นหุ้นส่วนหลายคนจัดการห้างหุ้นส่วนไซร้ หุ้นส่วนผู้จัดการแต่ละคนจะจัดการห้างหุ้นส่วนนั้นก็ได้ แต่หุ้นส่วนผู้จัดการคนหนึ่งคนใดจะทำการอันใดซึ่งหุ้นส่วนผู้จัดการอีกคนหนึ่งทักท้วงนั้นไม่ได้",
                        "subsections": null
                    }
                ]
            }
        },
        {
            "id": "มาตรา 1038",
            "title": "การแข่งขันกับกิจการของห้างหุ้นส่วนสามัญ",
            "content": {
                "paragraphs": [
                    {
                        "id": 1,
                        "content": "ห้ามมิให้ผู้เป็นหุ้นส่วนประกอบกิจการอย่างหนึ่งอย่างใดซึ่งมีสภาพดุจเดียวกัน และเป็นการแข่งขันกับกิจการของห้างหุ้นส่วนนั้น ไม่ว่าทำเพื่อประโยชน์ตนหรือประโยชน์ผู้อื่น โดยมิได้รับความยินยอมของผู้เป็นหุ้นส่วนคนอื่น ๆ",
                        "subsections": null
                    },
                    {
                        "id": 2,
                        "content": "ถ้าผู้เป็นหุ้นส่วนคนใดทำการฝ่าฝืนต่อบทบัญญัติมาตรานี้ไซร้ ผู้เป็นหุ้นส่วนคนอื่น ๆ ชอบที่จะเรียกเอาผลกำไรซึ่งผู้นั้นหาได้ทั้งหมด หรือเรียกเอาค่าสินไหมทดแทนเพื่อการที่ห้างหุ้นส่วนได้รับความเสียหายเพราะเหตุนั้น แต่ท่านห้ามมิให้ฟ้องเรียกเมื่อพ้นเวลาปีหนึ่งนับแต่วันทำการฝ่าฝืน"
                    }
                ]
            }
        },
        {
             "id": "มาตรา 1049",
            "title": "กิจการค้าขายซึ่งไม่ปรากฏชื่อ",
            "content": {
                "paragraphs": [
                    {
                        "id": 1,
                        "content": " ผู้เป็นหุ้นส่วนจะถือเอาสิทธิใด ๆ แก่บุคคลภายนอกในกิจการค้าขายซึ่งไม่ปรากฏชื่อของตนนั้นหาได้ไม่",
                        "subsections": null
                    }
                ]
            }
        },
        {
            "id": "มาตรา 1050",
            "title": "การใด ๆ อันผู้เป็นหุ้นส่วนคนใดคนหนึ่งได้จัดทำไปในทางที่เป็นธรรมดาการค้าขาย",
            "content": {
                "paragraphs": [
                    {
                        "id": 1,
                        "content": "การใด ๆ อันผู้เป็นหุ้นส่วนคนใดคนหนึ่งได้จัดทำไปในทางที่เป็นธรรมดาการค้าขายของห้างหุ้นส่วนนั้น ท่านว่าผู้เป็นหุ้นส่วนหมดทุกคนย่อมมีความผูกพันในการนั้น ๆ ด้วย และจะต้องรับผิดร่วมกันโดยไม่จำกัดจำนวนในการชำระหนี้ อันได้ก่อให้เกิดขึ้นเพราะจัดการไปเช่นนั้น",
                        "subsections": null
                    }
                ]
            }
        },
        {
            "id": "มาตรา 1051",
            "title": "ผู้เป็นหุ้นส่วนซึ่งออกจากหุ้นส่วน",
            "content": {
                "paragraphs": [
                    {
                        "id": 1,
                        "content": "ผู้เป็นหุ้นส่วนซึ่งออกจากหุ้นส่วนไปแล้วยังคงต้องรับผิดในหนี้ซึ่งห้างหุ้นส่วนได้ก่อให้เกิดขึ้นก่อนที่ตนได้ออกจากหุ้นส่วนไป",
                        "subsections": null
                    }
                ]
            }
        },
        {
            "id": "มาตรา 1052",
            "title": "บุคคลผู้เข้าเป็นหุ้นส่วน",
            "content": {
                "paragraphs": [
                    {
                        "id": 1,
                        "content": "บุคคลผู้เข้าเป็นหุ้นส่วนในห้างหุ้นส่วนย่อมต้องรับผิดในหนี้ใด ๆ ซึ่งห้างหุ้นส่วนได้ก่อให้เกิดขึ้นก่อนที่ตนเข้ามาเป็นหุ้นส่วนด้วย",
                        "subsections": null
                    }
                ]
            }
        },
        {
            "id": "มาตรา 1054",
            "title": "เข้าและออกห้างหุ้นส่วน โดยไม่เจตนา",
            "content": {
                "paragraphs": [
                    {
                        "id": 1,
                        "content": "บุคคลใดแสดงตนว่าเป็นหุ้นส่วนด้วยวาจาก็ดี ด้วยลายลักษณ์อักษรก็ดี ด้วยกิริยาก็ดี ด้วยยินยอมให้เขาใช้ชื่อตนเป็นชื่อห้างหุ้นส่วนก็ดี หรือรู้แล้วไม่คัดค้านปล่อยให้เขาแสดงว่าตนเป็นหุ้นส่วนก็ดี ท่านว่าบุคคลนั้นย่อมต้องรับผิดต่อบุคคลภายนอกในบรรดาหนี้ของห้างหุ้นส่วนเสมือนเป็นหุ้นส่วน",
                        "subsections": null
                    },
                    {
                        "id": 2,
                        "content": "ถ้าผู้เป็นหุ้นส่วนคนหนึ่งคนใดตายไปแล้ว และห้างหุ้นส่วนนั้นยังคงค้าต่อไปในชื่อเดิมของห้าง ท่านว่าเหตุเพียงที่คงใช้ชื่อเดิมนั้นก็ดี หรือใช้ชื่อของหุ้นส่วนผู้ตายควบอยู่ด้วยก็ดี หาทำให้ความรับผิดมีแก่กองทรัพย์มรดกของผู้ตายเพื่อหนี้ใด ๆ อันห้างหุ้นส่วนได้ก่อให้เกิดขึ้นภายหลังมรณะนั้นไม่",
                        "subsections": null
                    }
                ]
            }
        },
        {
            "id": "มาตรา 1065",
            "title": "ถือสิทธิ์จากบุคคลภายนอก กรณีห้างหุ้นส่วนจดทะเบียน",
            "content": {
                "paragraphs": [
                    {
                        "id": 1,
                        "content": "ผู้เป็นหุ้นส่วนอาจถือประโยชน์แก่บุคคลภายนอกในบรรดาสิทธิอันห้างหุ้นส่วนจดทะเบียนนั้นได้มา แม้ในกิจการซึ่งไม่ปรากฏชื่อของตน",
                        "subsections": null
                    }
                ]
            }
        },
        {
            "id": "มาตรา 1066",
            "title": "ค้าแข่งขันกับกิจการของห้างหุ้นส่วนจดทะเบียน",
            "content": {
                "paragraphs": [
                    {
                        "id": 1,
                        "content": "ห้ามมิให้ผู้เป็นหุ้นส่วนคนหนึ่งคนใดในห้างหุ้นส่วนจดทะเบียนประกอบกิจการอย่างหนึ่งอย่างใดอันมีสภาพเป็นอย่างเดียวกัน และเป็นการแข่งขันกับกิจการของห้างหุ้นส่วนนั้น ไม่ว่าทำเพื่อประโยชน์ตนหรือเพื่อประโยชน์ผู้อื่น หรือไปเข้าเป็นหุ้นส่วนไม่จำกัดความรับผิดในห้างหุ้นส่วนอื่น ซึ่งประกอบกิจการอันมีสภาพเป็นอย่างเดียวกัน และแข่งขันกับกิจการของห้างหุ้นส่วนจดทะเบียนนั้น เว้นไว้แต่จะได้รับคำยินยอมของผู้เป็นหุ้นส่วนอื่นทั้งหมด",
                        "subsections": null
                    },
                    {
                        "id": 2,
                        "content": "แต่ข้อห้ามเช่นว่ามานี้ ท่านว่าจะไม่พึงใช้ได้ ถ้าหากผู้เป็นหุ้นส่วนทั้งหลายได้รู้อยู่แล้วในเวลาเมื่อลงทะเบียนห้างหุ้นส่วนนั้นว่า ผู้เป็นหุ้นส่วนคนหนึ่งได้ทำกิจการ หรือเข้าเป็นหุ้นส่วนอยู่ในห้างหุ้นส่วนอื่นอันมีวัตถุที่ประสงค์อย่างเดียวกัน และในสัญญาเข้าหุ้นส่วนที่ทำไว้ต่อกันนั้นก็ไม่ได้บังคับให้ถอนตัวออก",
                        "subsections": null
                    }
                ]
            }
        },
        {
            "id": "มาตรา 1067",
            "title": "ผลของค้าแข่งขันกับกิจการของห้างหุ้นส่วนจดทะเบียน",
            "content": {
                "paragraphs": [
                    {
                        "id": 1,
                        "content": "ถ้าผู้เป็นหุ้นส่วนคนใดกระทำการฝ่าฝืนต่อบทบัญญัติในมาตราก่อนนี้ไซร้ ท่านว่าห้างหุ้นส่วนซึ่งจดทะเบียนนั้นชอบที่จะเรียกเอาผลกำไรอันผู้นั้นหาได้ทั้งหมด หรือเรียกเอาค่าสินไหมทดแทนเพื่อความเสียหายซึ่งห้างหุ้นส่วนได้รับเพราะเหตุนั้น",
                        "subsections": null
                    },
                    {
                        "id": 2,
                        "content": "แต่ท่านห้ามมิให้ฟ้องเรียกเมื่อพ้นเวลาปีหนึ่งนับแต่วันทำการฝ่าฝืน",
                        "subsections": null
                    },
                    {
                        "id": 3,
                        "content": "อนึ่ง บทบัญญัติมาตรานี้ไม่ลบล้างสิทธิของผู้เป็นหุ้นส่วนทั้งหลายนอกนั้น ในอันจะเรียกให้เลิกห้างหุ้นส่วน",
                        "subsections": null
                    }
                ]
            }
        },
        {
            "id": "มาตรา 1070",
            "title": "ห้างหุ้นส่วนซึ่งจดทะเบียนผิดนัดชำระหนี้",
            "content": {
                "paragraphs": [
                    {
                        "id": 1,
                        "content": " เมื่อใดห้างหุ้นส่วนซึ่งจดทะเบียนผิดนัดชำระหนี้ เมื่อนั้นเจ้าหนี้ของห้างหุ้นส่วนนั้นชอบที่จะเรียกให้ชำระหนี้เอาแต่ผู้เป็นหุ้นส่วนคนใดคนหนึ่งก็ได้",
                        "subsections": null
                    }
                ]
            }
        },
        {
            "id": "มาตรา 1071",
            "title": "พิสูจน์ หนี้ซึ่งเกิดขึ้นหลังจากห้างหุ้นส่วนซึ่งจดทะเบียนผิดนัดชำระหนี้",
            "content": {
                "paragraphs": [
                    {
                        "id": 1,
                        "content": "ในกรณีที่กล่าวไว้ในมาตรา ๑๐๗๐ นั้น ถ้าผู้เป็นหุ้นส่วนนำพิสูจน์ได้ว่า",
                        "subsections": [
                            {
                                "id": 1,
                                "content": "สินทรัพย์ของห้างหุ้นส่วนยังมีพอที่จะชำระหนี้ได้ทั้งหมดหรือบางส่วน และ",
                                "subsections": null
                            },
                            {
                                "id": 2,
                                "content": "การที่จะบังคับเอาแก่ห้างหุ้นส่วนนั้นไม่เป็นการยากฉะนี้ไซร้",
                                "subsections": null
                            }
                        ]
                    },
                    {
                        "id": 2,
                        "content": "ศาลจะบังคับให้เอาสินทรัพย์ของห้างหุ้นส่วนนั้นชำระหนี้ก่อนก็ได้ สุดแต่ศาลจะเห็นสมควร",
                        "subsections": null
                    }
                ]
            }
        },
        {
            "id": "มาตรา 1072",
            "title": "เจ้าหนี้ของผู้เป็นหุ้นส่วนเฉพาะตัว",
            "content": {
                "paragraphs": [
                    {
                        "id": 1,
                        "content": "ถ้าห้างหุ้นส่วนซึ่งจดทะเบียนยังมิได้เลิกกันตราบใด เจ้าหนี้ของผู้เป็นหุ้นส่วนเฉพาะตัวย่อมใช้สิทธิได้แต่เพียงในผลกำไรหรือเงินซึ่งห้างหุ้นส่วนค้างชำระแก่ผู้เป็นหุ้นส่วนคนนั้นเท่านั้น ถ้าห้างหุ้นส่วนนั้นเลิกกันแล้ว เจ้าหนี้ย่อมใช้สิทธิได้ตลอดจนถึงหุ้นของผู้เป็นหุ้นส่วนคนนั้นอันมีในสินทรัพย์ของห้างหุ้นส่วน",
                        "subsections": null
                    }
                ]
            }
        },
        {
            "id": "มาตรา 1077",
            "title": "ห้างหุ้นส่วนจำกัด",
            "content": {
                "paragraphs": [
                    {
                        "id": 1,
                        "content": "อันห้างหุ้นส่วนจำกัดนั้น คือห้างหุ้นส่วนประเภทหนึ่งซึ่งมีผู้เป็นหุ้นส่วนสองจำพวกดังจะกล่าวต่อไปนี้ คือ",
                        "subsections": [
                            {
                                "id": 1,
                                "content": "ผู้เป็นหุ้นส่วนคนเดียวหรือหลายคนซึ่งมีจำกัดความรับผิดเพียงไม่เกินจำนวนเงินที่ตนรับจะลงหุ้นในห้างหุ้นส่วนนั้นจำพวกหนึ่ง และ",
                                "subsections": null
                            },
                            {
                                "id": 2,
                                "content": "ผู้เป็นหุ้นส่วนคนเดียวหรือหลายคนซึ่งต้องรับผิดร่วมกันในบรรดาหนี้ของห้างหุ้นส่วนไม่มีจำกัดจำนวนอีกจำพวกหนึ่ง",
                                "subsections": null
                            }
                        ]
                    }
                ]
            }
        },
        {
            "id": "มาตรา 1079",
            "title": "หุ้นส่วนจำกัดไม่จดทะเบียน",
            "content": {
                "paragraphs": [
                    {
                        "id": 1,
                        "content": " อันห้างหุ้นส่วนจำกัดนั้น ถ้ายังมิได้จดทะเบียนอยู่ตราบใดท่านให้ถือว่าเป็นห้างหุ้นส่วนสามัญซึ่งผู้เป็นหุ้นส่วนทั้งหมดย่อมต้องรับผิดร่วมกันในบรรดาหนี้ของห้างหุ้นส่วนโดยไม่มีจำกัดจำนวน จนกว่าจะได้จดทะเบียน",
                        "subsections": null
                    }
                ]
            }
        },
        {
            "id": "มาตรา 1081",
            "title": "ห้ามมิให้เอาชื่อของผู้เป็นหุ้นส่วนจำพวกจำกัด",
            "content": {
                "paragraphs": [
                    {
                        "id": 1,
                        "content": "ห้ามมิให้เอาชื่อของผู้เป็นหุ้นส่วนจำพวกจำกัดความรับผิดมาเรียกขานระคนเป็นชื่อห้าง",
                        "subsections": null
                    }
                ]
            }
        },
        {
            "id": "มาตรา 1082",
            "title": "เอาชื่อของผู้เป็นหุ้นส่วนจำพวกจำกัดความรับผิดมาเรียกขานระคนเป็นชื่อห้าง",
            "content": {
                "paragraphs": [
                    {
                        "id": 1,
                        "content": "ถ้าผู้เป็นหุ้นส่วนจำพวกจำกัดความรับผิดคนใดยินยอมโดยแสดงออกชัดหรือโดยปริยายให้ใช้ชื่อของตนระคนเป็นชื่อห้างไซร้ ท่านว่าผู้เป็นหุ้นส่วนคนนั้นจะต้องรับผิดต่อบุคคลภายนอกเสมือนดังว่าเป็นหุ้นส่วนจำพวกไม่จำกัดความรับผิดฉะนั้น",
                        "subsections": null
                    },
                    {
                        "id": 2,
                        "content": "แต่ในระหว่างผู้เป็นหุ้นส่วนกันเองนั้น ความรับผิดของผู้เป็นหุ้นส่วนเช่นนี้ ท่านให้คงบังคับตามสัญญาหุ้นส่วน",
                        "subsections": null
                    }
                ]
            }
        },
        {
            "id": "มาตรา 1084",
            "title": "ห้ามมิให้แบ่งเงินปันผลหรือดอกเบี้ยให้แก่ผู้เป็นหุ้นส่วนจำพวกจำกัดความรับผิด",
            "content": {
                "paragraphs": [
                    {
                        "id": 1,
                        "content": "ห้ามมิให้แบ่งเงินปันผลหรือดอกเบี้ยให้แก่ผู้เป็นหุ้นส่วนจำพวกจำกัดความรับผิด นอกจากผลกำไรซึ่งห้างหุ้นส่วนทำมาค้าได้",
                        "subsections": null
                    },
                    {
                        "id": 2,
                        "content": "ถ้าทุนของห้างหุ้นส่วนลดน้อยลงไปเพราะค้าขายขาดทุน ท่านห้ามมิให้แบ่งเงินปันผลหรือดอกเบี้ยให้แก่ผู้เป็นหุ้นส่วนจำพวกจำกัดความรับผิด จนกว่าทุนซึ่งขาดไปนั้นจะได้คืนมาเต็มจำนวนเดิม",
                        "subsections": null
                    },
                    {
                        "id": 3,
                        "content": "แต่ถ้าผู้เป็นหุ้นส่วนจำพวกจำกัดความรับผิดคนใดได้รับเงินปันผลหรือดอกเบี้ยไปแล้วโดยสุจริต ท่านว่าหาอาจจะบังคับให้เขาคืนเงินนั้นได้ไม่",
                        "subsections": null
                    }
                ]
            }
        },
        {
            "id": "มาตรา 1085",
            "title": "แสดงให้บุคคลภายนอกทราบ",
            "content": {
                "paragraphs": [
                    {
                        "id": 1,
                        "content": "ถ้าผู้เป็นหุ้นส่วนจำพวกจำกัดความรับผิดได้แสดงด้วยจดหมายหรือใบแจ้งความหรือด้วยวิธีอย่างอื่นให้บุคคลภายนอกทราบว่าตนได้ลงหุ้นไว้มากกว่าจำนวนซึ่งได้จดทะเบียนเพียงใด ท่านว่าผู้นั้นจะต้องรับผิดเท่าถึงจำนวนเพียงนั้น",
                        "subsections": null
                    }
                ]
            }
        },
        {
            "id": "มาตรา 1087",
            "title": "ผู้เป็นหุ้นส่วนจำพวกไม่จำกัดความรับผิดเท่านั้นเป็นผู้จัดการ",
            "content": {
                "paragraphs": [
                    {
                        "id": 1,
                        "content": "อันห้างหุ้นส่วนจำกัดนั้น ท่านว่าต้องให้แต่เฉพาะผู้เป็นหุ้นส่วนจำพวกไม่จำกัดความรับผิดเท่านั้นเป็นผู้จัดการ",
                        "subsections": null
                    }
                ]
            }
        },
        {
            "id": "มาตรา 1088",
            "title": "ถ้าผู้เป็นหุ้นส่วนจำพวกจำกัดความรับผิดผู้ใดสอดเข้าไปเกี่ยวข้อง",
            "content": {
                "paragraphs": [
                    {
                        "id": 1,
                        "content": "ถ้าผู้เป็นหุ้นส่วนจำพวกจำกัดความรับผิดผู้ใดสอดเข้าไปเกี่ยวข้องจัดการงานของห้างหุ้นส่วน ท่านว่าผู้นั้นจะต้องรับผิดร่วมกันในบรรดาหนี้ทั้งหลายของห้างหุ้นส่วนนั้นโดยไม่จำกัดจำนวน",
                        "subsections": null
                    },
                    {
                        "id": 2,
                        "content": "แต่การออกความเห็นและแนะนำก็ดี ออกเสียงเป็นคะแนนนับในการตั้งและถอดถอนผู้จัดการตามกรณีที่มีบังคับไว้ในสัญญาหุ้นส่วนนั้นก็ดี ท่านหานับว่าเป็นการสอดเข้าไปเกี่ยวข้องจัดการงานของห้างหุ้นส่วนนั้นไม่",
                        "subsections": null
                    }
                ]
            }
        },
        {
            "id": "มาตรา 1090",
            "title": "ค้าแข่ง ห้างหุ้นส่วนจำกัด",
            "content": {
                "paragraphs": [
                    {
                        "id": 1,
                        "content": "ผู้เป็นหุ้นส่วนจำพวกจำกัดความรับผิดจะประกอบการค้าขายอย่างใด ๆ เพื่อประโยชน์ตนหรือเพื่อประโยชน์บุคคลภายนอกก็ได้ แม้ว่าการงานเช่นนั้นจะมีสภาพเป็นอย่างเดียวกันกับการค้าขายของห้างหุ้นส่วนก็ไม่ห้าม",
                        "subsections": null
                    }
                ]
            }
        },
        {
            "id": "มาตรา 1095",
            "title": "ฟ้องร้องผู้เป็นหุ้นส่วนจำพวกจำกัดความรับผิด",
            "content": {
                "paragraphs": [
                    {
                        "id": 1,
                        "content": "ตราบใดห้างหุ้นส่วนจำกัดยังมิได้เลิกกัน ตราบนั้นเจ้าหนี้ของห้างย่อมไม่มีสิทธิจะฟ้องร้องผู้เป็นหุ้นส่วนจำพวกจำกัดความรับผิดได้",
                        "subsections": null
                    },
                    {
                        "id": 2,
                        "content": "แต่เมื่อห้างหุ้นส่วนนั้นได้เลิกกันแล้ว เจ้าหนี้ของห้างมีสิทธิฟ้องร้องผู้เป็นหุ้นส่วนจำพวกจำกัดความรับผิดได้เพียงจำนวนดังนี้ คือ",
                        "subsections": [
                            {
                                "id": 1,
                                "content": "จำนวนลงหุ้นของผู้เป็นหุ้นส่วนเท่าที่ยังค้างส่งแก่ห้างหุ้นส่วน",
                                "subsections": null
                            },
                            {
                                "id": 2,
                                "content": "จำนวนลงหุ้นเท่าที่ผู้เป็นหุ้นส่วนได้ถอนไปจากสินทรัพย์ของห้างหุ้นส่วน",
                                "subsections": null
                            },
                            {
                                "id": 3,
                                "content": "จำนวนเงินปันผลและดอกเบี้ยซึ่งผู้เป็นหุ้นส่วนได้รับไปแล้วโดยทุจริตและฝ่าฝืนต่อบทมาตรา ๑๐๘๔",
                                "subsections": null
                            }
                        ]
                    }
                ]
            }
        },
        {
            "id": "มาตรา 1113",
            "title": "ผู้เริ่มก่อการบริษัทต้องรับผิดร่วมกันและโดยไม่จำกัด",
            "content": {
                "paragraphs": [
                    {
                        "id": 1,
                        "content": "ผู้เริ่มก่อการบริษัทต้องรับผิดร่วมกันและโดยไม่จำกัด ในบรรดาหนี้และการจ่ายเงินซึ่งที่ประชุมตั้งบริษัทมิได้อนุมัติ และแม้จะได้มีอนุมัติก็ยังคงต้องรับผิดอยู่เช่นนั้นไปจนกว่าจะได้จดทะเบียนบริษัท",
                        "subsections": null
                    }
                ]
            }
        },
        {
            "id": "มาตรา 1129",
            "title": "การโอนหุ้นชนิดระบุชื่อ",
            "content": {
                "paragraphs": [
                    {
                        "id": 1,
                        "content": "อันว่าหุ้นนั้นย่อมโอนกันได้โดยมิต้องได้รับความยินยอมของบริษัท เว้นแต่เมื่อเป็นหุ้นชนิดระบุชื่อลงในใบหุ้น ซึ่งมีข้อบังคับของบริษัทกำหนดไว้เป็นอย่างอื่น",
                        "subsections": null
                    },
                    {
                        "id": 2,
                        "content": "การโอนหุ้นชนิดระบุชื่อลงในใบหุ้นนั้น ถ้ามิได้ทำเป็นหนังสือและลงลายมือชื่อของผู้โอนกับผู้รับโอน มีพยานคนหนึ่งเป็นอย่างน้อยลงชื่อรับรองลายมือนั้น ๆ ด้วยแล้ว ท่านว่าเป็นโมฆะ อนึ่ง ตราสารอันนั้นต้องแถลงเลขหมายของหุ้นซึ่งโอนกันนั้นด้วย",
                        "subsections": null
                    },
                    {
                        "id": 3,
                        "content": "การโอนเช่นนี้จะนำมาใช้แก่บริษัทหรือบุคคลภายนอกไม่ได้ จนกว่าจะได้จดแจ้งการโอนทั้งชื่อและสำนักของผู้รับโอนนั้นลงในทะเบียนผู้ถือหุ้น",
                        "subsections": null
                    }
                ]
            }
        },
        {
            "id": "มาตรา 1175",
            "title": " คำบอกกล่าวเรียกประชุมใหญ่",
            "content": {
                "paragraphs": [
                    {
                        "id": 1,
                        "content": "คำบอกกล่าวเรียกประชุมใหญ่ให้ส่งทางไปรษณีย์ตอบรับไปยังผู้ถือหุ้นทุกคนที่มีชื่อในทะเบียนของบริษัทก่อนวันนัดประชุมไม่น้อยกว่าเจ็ดวัน แต่ในกรณีที่บริษัทมีหุ้นชนิดที่มีใบหุ้นออกให้แก่ผู้ถือ ให้โฆษณาในหนังสือพิมพ์แห่งท้องที่อย่างน้อยหนึ่งครั้งหรือในสื่ออิเล็กทรอนิกส์ตามหลักเกณฑ์ วิธีการที่กำหนดในกฎกระทรวง ก่อนวันนัดประชุมไม่น้อยกว่าเจ็ดวันด้วย หากเป็นคำบอกกล่าวเรียกประชุมใหญ่เพื่อลงมติพิเศษให้กระทำการดังกล่าว ก่อนวันนัดประชุมไม่น้อยกว่าสิบสี่วัน",
                        "subsections": null
                    },
                    {
                        "id": 2,
                        "content": "คำบอกกล่าวเรียกประชุมใหญ่นั้น ให้ระบุสถานที่ วัน เวลา และสภาพแห่งกิจการที่จะได้ประชุมปรึกษากัน และในกรณีที่เป็นคำบอกกล่าวเรียกประชุมใหญ่เพื่อลงมติพิเศษให้ระบุข้อความที่จะนำเสนอให้ลงมติด้วย",
                        "subsections": null
                    }
                ]
            }
        }
    ]
}
