{
  "civil_procedure_code": [
    {
      "id": "มาตรา 1",
      "title": "การฟ้องคดี",
      "content": {
        "paragraphs": [
          {
            "id": 1,
            "content": "ในประมวลกฎหมายนี้ ถ้าข้อความมิได้แสดงให้เห็นเป็นอย่างอื่น",
            "subsections": null
          }
        ]
      }
    },
    {
      "id": "มาตรา 2",
      "title": "การพิจารณาคดี",
      "content": {
        "paragraphs": [
          {
            "id": 1,
            "content": "ห้ามมิให้เสนอคำฟ้องต่อศาลใด เว้นแต่",
            "subsections": [
              {
                "id": 1,
                "content": "เมื่อได้พิจารณาถึงสภาพแห่งคำฟ้องและชั้นของศาลแล้ว ปรากฏว่า ศาลนั้นมีอำนาจที่จะพิจารณาพิพากษาคดีนั้นได้ตามบทบัญญัติแห่งกฎหมายว่าด้วยพระธรรมนูญศาลยุติธรรม และ"
              },
              {
                "id": 2,
                "content": "เมื่อได้พิจารณาถึงคำฟ้องแล้ว ปรากฏว่าคดีนั้นอยู่ในเขตศาลนั้นตามบทบัญญัติแห่งประมวลกฎหมายนี้ว่าด้วยศาลที่จะรับคำฟ้อง และตามบทบัญญัติแห่งกฎหมายที่กำหนดเขตศาลด้วย"
              }
            ]
          }
        ]
      }
    },
    {
      "id": "มาตรา 3",
      "title": "การเสนอคำฟ้อง กรณีมูลคดีเกิดขึ้นในเรือ หรือจำเลยไม่มีภูมิลำเนาอยู่ในราชอาณาจักร",
      "content": {
        "paragraphs": [
          {
            "id": 1,
            "content": "เพื่อประโยชน์ในการเสนอคำฟ้อง",
            "subsections": [
              {
                "id": 1,
                "content": "ในกรณีที่มูลคดีเกิดขึ้นในเรือไทยหรืออากาศยานไทยที่อยู่นอกราชอาณาจักร ให้ศาลแพ่งเป็นศาลที่มีเขตอำนาจ"
              },
              {
                "id": 2,
                "content": "ในกรณีที่จำเลยไม่มีภูมิลำเนาอยู่ในราชอาณาจักร\n\n\t (ก) ถ้าจำเลยเคยมีภูมิลำเนาอยู่ ณ ที่ใดในราชอาณาจักรภายในกำหนดสองปีก่อนวันที่มีการเสนอคำฟ้อง ให้ถือว่าที่นั้นเป็นภูมิลำเนาของจำเลย\n\n\t (ข) ถ้าจำเลยประกอบหรือเคยประกอบกิจการทั้งหมดหรือแต่บางส่วนในราชอาณาจักรไม่ว่าโดยตนเองหรือตัวแทน หรือโดยมีบุคคลหนึ่งบุคคลใดเป็นผู้ติดต่อในการประกอบกิจการนั้นในราชอาณาจักร ให้ถือว่าสถานที่ที่ใช้หรือเคยใช้ประกอบกิจการหรือติดต่อดังกล่าว
                หรือสถานที่อันเป็นถิ่นที่อยู่ของตัวแทนหรือของผู้ติดต่อในวันที่มีการเสนอคำฟ้องหรือภายในกำหนดสองปีก่อนนั้น
                เป็นภูมิลำเนาของจำเลย"
              }
            ]
          }
        ]
      }
    },
    {
        "id": "มาตรา 4",
        "title": "หลักในการเสนอคำฟ้อง",
        "content": {
            "paragraphs": [
                {
                    "id": 1,
                    "content": "เว้นแต่จะมีบทบัญญัติเป็นอย่างอื่น",
                    "subsections": [
                        {
                            "id": 1,
                            "content": "คำฟ้องให้เสนอต่อศาลที่จำเลยมีภูมิลำเนาอยู่ในเขตศาล
                            หรือต่อศาลที่มูลคดีเกิดขึ้นในเขตศาลไม่ว่าจำเลยจะมีภูมิลำเนาอยู่ในราชอาณาจักรหรือไม่"
                        },
                        {
                            "id": 2,
                            "content": "คำร้องขอ ให้เสนอต่อศาลที่มูลคดีเกิดขึ้นในเขตศาล 
                            หรือต่อศาลที่ผู้ร้องมีภูมิลำเนาอยู่ในเขตศาล"
                        }
                    ]
                },
            ],
        }
    },
    {
        "id": "มาตรา 4 ทวิ",
        "title": "หลักในการเสนอคำฟ้อง",
        "content": {
            "paragraphs": [
                {
                    "id": 1,
                    "content": "คำฟ้องเกี่ยวด้วยอสังหาริมทรัพย์ หรือสิทธิหรือประโยชน์อันเกี่ยวด้วยอสังหาริมทรัพย์ ให้เสนอต่อศาลที่อสังหาริมทรัพย์นั้นตั้งอยู่ในเขตศาล ไม่ว่าจำเลยจะมีภูมิลำเนาอยู่ในราชอาณาจักรหรือไม่
                    หรือต่อศาลที่จำเลยมีภูมิลำเนาอยู่ในเขตศาล",
                    "subsections": null
                },
            ],
        }
    },
    {
        "id": "มาตรา 4 ตรี",
        "title": "การยื่นคำฟ้อง กรณีจำเลยมีภูมิลำเนาอยู่นอกราชอาณาจักร"ม
        "content": {
            "paragraphs": [
                {
                    "id": 1,
                    "content": "คำฟ้องอื่นนอกจากที่บัญญัติไว้ในมาตรา ๔ ทวิ ซึ่งจำเลยมิได้มีภูมิลำเนาอยู่ในราชอาณาจักรและมูลคดีมิได้เกิดขึ้นในราชอาณาจักร ถ้าโจทก์เป็นผู้มีสัญชาติไทยหรือมีภูมิลำเนาอยู่ในราชอาณาจักร ให้เสนอต่อศาลแพ่งหรือต่อศาลที่โจทก์มีภูมิลำเนาอยู่ในเขตศาล",
                    "subsections": null
                },
                {
                    "id": 2,
                    "content": คำฟ้องตามวรรคหนึ่ง ถ้าจำเลยมีทรัพย์สินที่อาจถูกบังคับคดีได้อยู่ในราชอาณาจักร ไม่ว่าจะเป็นการชั่วคราวหรือถาวร โจทก์จะเสนอคำฟ้องต่อศาลที่ทรัพย์สินนั้นอยู่ในเขตศาลก็ได้",
                    "subsections": null
                }
            ],
        }
    },
    {
        "id": "มาตรา 4 จัตวา",
        "title": "การร้องขอแต่งตั้งเจ้ามรดก",
        "content": {
            "paragraphs": [
                {
                    "id": 1,
                    "content": "คำร้องขอแต่งตั้งผู้จัดการมรดก ให้เสนอต่อศาลที่เจ้ามรดกมีภูมิลำเนาอยู่ในเขตศาลในขณะถึงแก่ความตาย",
                    "subsections": null
                    
                },
                {
                    "id": 2,
                    "content": "ในกรณีที่เจ้ามรดกไม่มีภูมิลำเนาอยู่ในราชอาณาจักร ให้เสนอต่อศาลที่ทรัพย์มรดกอยู่ในเขตศาล",
                    "subsections": null
                },
            ],
        }
    },
    {
        "id": "มาตรา 4 เบญจ",
        "title": "การร้องขอเกี่ยวกับนิติบุคคล",
        "content": {
            "paragraphs": [
                {
                    "id": 1,
                    "content": "คำร้องขอเพิกถอนมติของที่ประชุมหรือที่ประชุมใหญ่ของนิติบุคคล คำร้องขอเลิกนิติบุคคล คำร้องขอตั้งหรือถอนผู้ชำระบัญชีของนิติบุคคล หรือคำร้องขออื่นใดเกี่ยวกับนิติบุคคล
                    ให้เสนอต่อศาลที่นิติบุคคลนั้นมีสำนักงานแห่งใหญ่อยู่ในเขตศาล",
                    "subsections": null
                    
                },
                
            ],
        }
    },
    {
        "id": "มาตรา 4 ฉ",
        "title": "การร้องขอเกี่ยวกับทรัพย์สินที่อยู่ในราชอาณาจักร",
        "content": {
            "paragraphs": [
                {
                    "id": 1,
                    "content": "คำร้องขอเกี่ยวกับทรัพย์สินที่อยู่ในราชอาณาจักรก็ดี คำร้องขอที่หากศาลมีคำสั่งตามคำร้องขอนั้นจะเป็นผลให้ต้องจัดการหรือเลิกจัดการทรัพย์สินที่อยู่ในราชอาณาจักรก็ดี
                    ซึ่งมูลคดีมิได้เกิดขึ้นในราชอาณาจักรและผู้ร้องไม่มีภูมิลำเนาอยู่ในราชอาณาจักร ให้เสนอต่อศาลที่ทรัพย์สินดังกล่าวอยู่ในเขตศาล",
                    "subsections": null
                    
                },
                
            ],
        }
    },
    {
        "id": "มาตรา 5",
        "title": "คำฟ้องหรือคำร้องขอซึ่งอาจเสนอต่อศาลได้สองศาลหรือกว่านั้น",
        "content": {
            "paragraphs": [
                {
                    "id": 1,
                    "content": " คำฟ้องหรือคำร้องขอซึ่งอาจเสนอต่อศาลได้สองศาลหรือกว่านั้น ไม่ว่าจะเป็นเพราะภูมิลำเนาของบุคคลก็ดี เพราะที่ตั้งของทรัพย์สินก็ดี เพราะสถานที่ที่เกิดมูลคดีก็ดี หรือเพราะมีข้อหาหลายข้อก็ดี ถ้ามูลความแห่งคดีเกี่ยวข้องกัน โจทก์หรือผู้ร้องจะเสนอคำฟ้องหรือคำร้องขอต่อศาลใดศาลหนึ่งเช่นว่านั้นก็ได้",
                    "subsections": null
                },
            ],
        }
    },
    
  ]
}
