{
    "civil_procedure_code": [
        {
            "id": "มาตรา 1",
            "title": "การฟ้องคดี",
            "content": {
                "paragraphs": [
                    {
                        "id": 1,
                        "content": "ในประมวลกฎหมายนี้ ถ้าข้อความมิได้แสดงให้เห็นเป็นอย่างอื่น",
                        "subsections": null
                    }
                ]
            }
        },
        {
            "id": "มาตรา 2",
            "title": "การพิจารณาคดี",
            "content": {
                "paragraphs": [
                    {
                        "id": 1,
                        "content": "ห้ามมิให้เสนอคำฟ้องต่อศาลใด เว้นแต่",
                        "subsections": [
                            {
                                "id": 1,
                                "content": "เมื่อได้พิจารณาถึงสภาพแห่งคำฟ้องและชั้นของศาลแล้ว ปรากฏว่า ศาลนั้นมีอำนาจที่จะพิจารณาพิพากษาคดีนั้นได้ตามบทบัญญัติแห่งกฎหมายว่าด้วยพระธรรมนูญศาลยุติธรรม และ"
                            },
                            {
                                "id": 2,
                                "content": "เมื่อได้พิจารณาถึงคำฟ้องแล้ว ปรากฏว่าคดีนั้นอยู่ในเขตศาลนั้นตามบทบัญญัติแห่งประมวลกฎหมายนี้ว่าด้วยศาลที่จะรับคำฟ้อง และตามบทบัญญัติแห่งกฎหมายที่กำหนดเขตศาลด้วย"
                            }
                        ]
                    }
                ]
            }
        },
        {
            "id": "มาตรา 3",
            "title": "การเสนอคำฟ้อง กรณีมูลคดีเกิดขึ้นในเรือ หรือจำเลยไม่มีภูมิลำเนาอยู่ในราชอาณาจักร",
            "content": {
                "paragraphs": [
                    {
                        "id": 1,
                        "content": "เพื่อประโยชน์ในการเสนอคำฟ้อง",
                        "subsections": [
                            {
                                "id": 1,
                                "content": "ในกรณีที่มูลคดีเกิดขึ้นในเรือไทยหรืออากาศยานไทยที่อยู่นอกราชอาณาจักร ให้ศาลแพ่งเป็นศาลที่มีเขตอำนาจ"
                            },
                            {
                                "id": 2,
                                "content": "ในกรณีที่จำเลยไม่มีภูมิลำเนาอยู่ในราชอาณาจักร\n\n\t (ก) ถ้าจำเลยเคยมีภูมิลำเนาอยู่ ณ ที่ใดในราชอาณาจักรภายในกำหนดสองปีก่อนวันที่มีการเสนอคำฟ้อง ให้ถือว่าที่นั้นเป็นภูมิลำเนาของจำเลย\n\n\t (ข) ถ้าจำเลยประกอบหรือเคยประกอบกิจการทั้งหมดหรือแต่บางส่วนในราชอาณาจักรไม่ว่าโดยตนเองหรือตัวแทน หรือโดยมีบุคคลหนึ่งบุคคลใดเป็นผู้ติดต่อในการประกอบกิจการนั้นในราชอาณาจักร ให้ถือว่าสถานที่ที่ใช้หรือเคยใช้ประกอบกิจการหรือติดต่อดังกล่าว\n                หรือสถานที่อันเป็นถิ่นที่อยู่ของตัวแทนหรือของผู้ติดต่อในวันที่มีการเสนอคำฟ้องหรือภายในกำหนดสองปีก่อนนั้น\n                เป็นภูมิลำเนาของจำเลย"
                            }
                        ]
                    }
                ]
            }
        },
        {
            "id": "มาตรา 4",
            "title": "หลักในการเสนอคำฟ้อง",
            "content": {
                "paragraphs": [
                    {
                        "id": 1,
                        "content": "เว้นแต่จะมีบทบัญญัติเป็นอย่างอื่น",
                        "subsections": [
                            {
                                "id": 1,
                                "content": "คำฟ้องให้เสนอต่อศาลที่จำเลยมีภูมิลำเนาอยู่ในเขตศาล\n                            หรือต่อศาลที่มูลคดีเกิดขึ้นในเขตศาลไม่ว่าจำเลยจะมีภูมิลำเนาอยู่ในราชอาณาจักรหรือไม่"
                            },
                            {
                                "id": 2,
                                "content": "คำร้องขอ ให้เสนอต่อศาลที่มูลคดีเกิดขึ้นในเขตศาล \n                            หรือต่อศาลที่ผู้ร้องมีภูมิลำเนาอยู่ในเขตศาล"
                            }
                        ]
                    }
                ]
            }
        },
        {
            "id": "มาตรา 4 ทวิ",
            "title": "หลักในการเสนอคำฟ้องเกี่ยวด้วยอสังหาริมทรัพย์",
            "content": {
                "paragraphs": [
                    {
                        "id": 1,
                        "content": "คำฟ้องเกี่ยวด้วยอสังหาริมทรัพย์ หรือสิทธิหรือประโยชน์อันเกี่ยวด้วยอสังหาริมทรัพย์ ให้เสนอต่อศาลที่อสังหาริมทรัพย์นั้นตั้งอยู่ในเขตศาล ไม่ว่าจำเลยจะมีภูมิลำเนาอยู่ในราชอาณาจักรหรือไม่\n                    หรือต่อศาลที่จำเลยมีภูมิลำเนาอยู่ในเขตศาล",
                        "subsections": null
                    }
                ]
            }
        },
        {
            "id": "มาตรา 4 ตรี",
            "title": "การยื่นคำฟ้อง กรณีจำเลยมีภูมิลำเนาอยู่นอกราชอาณาจักร",
            "content": {
                "paragraphs": [
                    {
                        "id": 1,
                        "content": "คำฟ้องอื่นนอกจากที่บัญญัติไว้ในมาตรา ๔ ทวิ ซึ่งจำเลยมิได้มีภูมิลำเนาอยู่ในราชอาณาจักรและมูลคดีมิได้เกิดขึ้นในราชอาณาจักร ถ้าโจทก์เป็นผู้มีสัญชาติไทยหรือมีภูมิลำเนาอยู่ในราชอาณาจักร ให้เสนอต่อศาลแพ่งหรือต่อศาลที่โจทก์มีภูมิลำเนาอยู่ในเขตศาล",
                        "subsections": null
                    },
                    {
                        "id": 2,
                        "content": "คำฟ้องตามวรรคหนึ่ง ถ้าจำเลยมีทรัพย์สินที่อาจถูกบังคับคดีได้อยู่ในราชอาณาจักร ไม่ว่าจะเป็นการชั่วคราวหรือถาวร โจทก์จะเสนอคำฟ้องต่อศาลที่ทรัพย์สินนั้นอยู่ในเขตศาลก็ได้",
                        "subsections": null
                    }
                ]
            }
        },
        {
            "id": "มาตรา 4 จัตวา",
            "title": "การร้องขอแต่งตั้งเจ้ามรดก",
            "content": {
                "paragraphs": [
                    {
                        "id": 1,
                        "content": "คำร้องขอแต่งตั้งผู้จัดการมรดก ให้เสนอต่อศาลที่เจ้ามรดกมีภูมิลำเนาอยู่ในเขตศาลในขณะถึงแก่ความตาย",
                        "subsections": null
                    },
                    {
                        "id": 2,
                        "content": "ในกรณีที่เจ้ามรดกไม่มีภูมิลำเนาอยู่ในราชอาณาจักร ให้เสนอต่อศาลที่ทรัพย์มรดกอยู่ในเขตศาล",
                        "subsections": null
                    }
                ]
            }
        },
        {
            "id": "มาตรา 4 เบญจ",
            "title": "การร้องขอเกี่ยวกับนิติบุคคล",
            "content": {
                "paragraphs": [
                    {
                        "id": 1,
                        "content": "คำร้องขอเพิกถอนมติของที่ประชุมหรือที่ประชุมใหญ่ของนิติบุคคล คำร้องขอเลิกนิติบุคคล คำร้องขอตั้งหรือถอนผู้ชำระบัญชีของนิติบุคคล หรือคำร้องขออื่นใดเกี่ยวกับนิติบุคคล\n                    ให้เสนอต่อศาลที่นิติบุคคลนั้นมีสำนักงานแห่งใหญ่อยู่ในเขตศาล",
                        "subsections": null
                    }
                ]
            }
        },
        {
            "id": "มาตรา 4 ฉ",
            "title": "การร้องขอเกี่ยวกับทรัพย์สินที่อยู่ในราชอาณาจักร",
            "content": {
                "paragraphs": [
                    {
                        "id": 1,
                        "content": "คำร้องขอเกี่ยวกับทรัพย์สินที่อยู่ในราชอาณาจักรก็ดี คำร้องขอที่หากศาลมีคำสั่งตามคำร้องขอนั้นจะเป็นผลให้ต้องจัดการหรือเลิกจัดการทรัพย์สินที่อยู่ในราชอาณาจักรก็ดี\n                    ซึ่งมูลคดีมิได้เกิดขึ้นในราชอาณาจักรและผู้ร้องไม่มีภูมิลำเนาอยู่ในราชอาณาจักร ให้เสนอต่อศาลที่ทรัพย์สินดังกล่าวอยู่ในเขตศาล",
                        "subsections": null
                    }
                ]
            }
        },
        {
            "id": "มาตรา 5",
            "title": "คำฟ้องหรือคำร้องขอซึ่งอาจเสนอต่อศาลได้สองศาลหรือกว่านั้น",
            "content": {
                "paragraphs": [
                    {
                        "id": 1,
                        "content": "คำฟ้องหรือคำร้องขอซึ่งอาจเสนอต่อศาลได้สองศาลหรือกว่านั้น ไม่ว่าจะเป็นเพราะภูมิลำเนาของบุคคลก็ดี เพราะที่ตั้งของทรัพย์สินก็ดี เพราะสถานที่ที่เกิดมูลคดีก็ดี หรือเพราะมีข้อหาหลายข้อก็ดี ถ้ามูลความแห่งคดีเกี่ยวข้องกัน โจทก์หรือผู้ร้องจะเสนอคำฟ้องหรือคำร้องขอต่อศาลใดศาลหนึ่งเช่นว่านั้นก็ได้",
                        "subsections": null
                    }
                ]
            }
        },
        {
            "id": "มาตรา 6",
            "title": "คำฟ้องหรือคำร้องขอซึ่งอาจเสนอต่อศาลได้สองศาลหรือกว่านั้น",
            "content": {
                "paragraphs": [
                    {
                        "id": 1,
                        "content": "ก่อนยื่นคำให้การ จำเลยชอบที่จะยื่นคำร้องต่อศาลที่โจทก์ได้ยื่นคำฟ้องไว้ขอให้โอนคดีไปยังศาลอื่นที่มีเขตอำนาจได้ คำร้องนั้นจำเลยต้องแสดงเหตุที่ยกขึ้นอ้างอิงว่าการพิจารณาคดีต่อไปในศาลนั้นจะไม่สะดวก หรือจำเลยอาจไม่ได้รับความยุติธรรม เมื่อศาลเห็นสมควร ศาลจะมีคำสั่งอนุญาตตามคำร้องนั้นก็ได้",
                        "subsections": null
                    },
                    {
                        "id": 2,
                        "content": "ห้ามมิให้ศาลออกคำสั่งอนุญาตตามวรรคหนึ่ง เว้นแต่ศาลที่จะรับโอนคดีไปนั้นได้ยินยอมเสียก่อน ถ้าศาลที่จะรับโอนคดีไม่ยินยอม ก็ให้ศาลที่จะโอนคดีนั้นส่งเรื่องให้อธิบดีผู้พิพากษาศาลอุทธรณ์ชี้ขาด คำสั่งของอธิบดีผู้พิพากษาศาลอุทธรณ์ให้เป็นที่สุด",
                        "subsections": null
                    }
                ]
            }
        },
        {
            "id": "มาตรา 6/1",
            "title": "กระทบต่อการอนุรักษ์หรือการบำรุงรักษาทรัพยากรธรรมชาติหรือสิ่งแวดล้อม",
            "content": {
                "paragraphs": [
                    {
                        "id": 1,
                        "content": "คดีที่ยื่นฟ้องไว้ต่อศาลชั้นต้นซึ่งไม่ใช่ศาลแพ่ง ก่อนวันชี้สองสถาน หรือก่อนวันสืบพยานไม่น้อยกว่าเจ็ดวันในกรณีที่ไม่มีการชี้สองสถาน หากศาลที่คดีนั้นอยู่ระหว่างพิจารณาเห็นว่าผลของคดีดังกล่าวอาจกระทบต่อการอนุรักษ์หรือการบำรุงรักษาทรัพยากรธรรมชาติหรือสิ่งแวดล้อม การคุ้มครองผู้บริโภคเป็นส่วนรวม หรือประโยชน์สาธารณะอย่างอื่นที่สำคัญ และการโอนคดีไปยังศาลแพ่งจะทำให้การพิจารณาพิพากษาคดีเป็นไปอย่างมีประสิทธิภาพยิ่งขึ้น ก็ให้ศาลแจ้งคู่ความทราบและทำความเห็นเสนอประธานศาลอุทธรณ์เพื่อมีคำสั่งให้โอนคดีนั้นไปยังศาลแพ่งได้ คำสั่งของประธานศาลอุทธรณ์ให้เป็นที่สุด",
                        "subsections": null
                    },
                    {
                        "id": 2,
                        "content": "การโอนคดีตามวรรคหนึ่ง ไม่กระทบกระเทือนถึงกระบวนพิจารณาที่ได้ดำเนินการไปก่อนที่จะมีคำสั่งให้โอนคดี และให้ถือว่าบรรดากระบวนพิจารณาที่ได้ดำเนินการไปแล้วนั้นเป็นกระบวนพิจารณาของศาลแพ่งด้วย เว้นแต่ศาลแพ่งจะมีคำสั่งเป็นอย่างอื่นเพื่อประโยชน์แห่งความยุติธรรม",
                        "subsections": null
                    }
                ]
            }
        },
        {
            "id": "มาตรา 7",
            "title": "บังคับแห่งบทบัญญัติยื่นคำฟ้องหรือคำร้องขอ",
            "content": {
                "paragraphs": [
                    {
                        "id": 1,
                        "content": "บังคับแห่งบทบัญญัติ",
                        "subsections": [
                            {
                                "id": 1,
                                "content": "คำฟ้องหรือคำร้องขอที่เสนอภายหลังเกี่ยวเนื่องกับคดีที่ค้างพิจารณาอยู่ในศาลใด ให้เสนอต่อศาลนั้น"
                            },
                            {
                                "id": 2,
                                "content": "คำฟ้องหรือคำร้องขอที่เสนอเกี่ยวเนื่องกับการบังคับคดีตามคำพิพากษาหรือคำสั่งของศาล ซึ่งคำฟ้องหรือคำร้องขอนั้นจำต้องมีคำวินิจฉัยของศาลก่อนที่การบังคับคดีจะได้ดำเนินไปได้โดยครบถ้วนและถูกต้องนั้น ให้เสนอต่อศาลที่กำหนดไว้ในมาตรา ๒๗๑"
                            },
                            {
                                "id": 3,
                                "content": "คำร้องตามมาตรา ๑๐๑ ถ้าได้เสนอคำฟ้องหรือคำร้องขอต่อศาลใดแล้ว ให้เสนอต่อศาลนั้น ในกรณีที่ยังไม่ได้เสนอคำฟ้องหรือคำร้องขอต่อศาลใด ถ้าพยานหลักฐานซึ่งจะเรียกมาสืบหรือบุคคลหรือทรัพย์หรือสถานที่ที่จะต้องตรวจอยู่ในเขตศาลใด ให้เสนอต่อศาลนั้น"
                            },
                            {
                                "id": 4,
                                "content": "คำร้องที่เสนอให้ศาลถอนคืนหรือเปลี่ยนแปลงคำสั่งหรือการอนุญาตที่ศาลได้ให้ไว้ก็ดี คำร้องที่เสนอให้ศาลถอดถอนบุคคลใดจากฐานะที่ศาลได้แต่งตั้งไว้ก็ดี คำร้องที่เสนอให้ศาลมีคำสั่งใดที่เกี่ยวกับการถอนคืนหรือเปลี่ยนแปลงคำสั่งหรือการอนุญาตหรือที่เกี่ยวกับการแต่งตั้งเช่นว่านั้นก็ดี คำร้องขอหรือคำร้องอื่นใดที่เสนอเกี่ยวเนื่องกับคดีที่ศาลได้มีคำพิพากษาหรือคำสั่งไปแล้วก็ดี ให้เสนอต่อศาลในคดีที่ได้มีคำสั่ง การอนุญาต การแต่งตั้ง หรือคำพิพากษานั้น"
                            }
                        ]
                    }
                ]
            }
        },
        {
            "id": "มาตรา 55",
            "title": "สิทธิในการฟ้องคดี",
            "content": {
                "paragraphs": [
                    {
                        "id": 1,
                        "content": "เมื่อมีข้อโต้แย้งเกิดขึ้น เกี่ยวกับสิทธิหรือหน้าที่ของบุคคลใดตามกฎหมายแพ่ง หรือบุคคลใดจะต้องใช้สิทธิทางศาล บุคคลนั้นชอบที่จะเสนอคดีของตนต่อศาลส่วนแพ่งที่มีเขตอำนาจได้ ตามบทบัญญัติแห่งกฎหมายแพ่งและประมวลกฎหมายนี้",
                        "subsections": null
                    }
                ]
            }
        },
        {
            "id": "มาตรา 56",
            "title": "ความสามารถผู้ฟ้องคดี",
            "content": {
                "paragraphs": [
                    {
                        "id": 1,
                        "content": "ผู้ไร้ความสามารถหรือผู้ทำการแทนจะเสนอข้อหาต่อศาลหรือดำเนินกระบวนพิจารณาใด ๆ ได้ต่อเมื่อได้ปฏิบัติตามบทบัญญัติแห่งประมวลกฎหมายแพ่งและพาณิชย์ว่าด้วยความสามารถและตามบทบัญญัติแห่งประมวลกฎหมายนี้ การให้อนุญาตหรือยินยอมตามบทบัญญัติเช่นว่านั้น ให้ทำเป็นหนังสือยื่นต่อศาลเพื่อรวมไว้ในสำนวนความ",
                        "subsections": null
                    },
                    {
                        "id": 2,
                        "content": "ไม่ว่าเวลาใด ๆ ก่อนมีคำพิพากษาเมื่อศาลเห็นสมควรหรือเมื่อคู่ความฝ่ายหนึ่งฝ่ายใดยื่นคำขอโดยทำเป็นคำร้อง ให้ศาลมีอำนาจทำการสอบสวนในเรื่องความสามารถของผู้ขอหรือของคู่ความอีกฝ่ายหนึ่ง และถ้าเป็นที่พอใจว่ามีการบกพร่องในเรื่องความสามารถ ศาลอาจมีคำสั่งกำหนดให้แก้ไขข้อบกพร่องนั้นเสียให้บริบูรณ์ภายในกำหนดเวลาอันสมควรที่ศาลจะสั่ง",
                        "subsections": null
                    },
                    {
                        "id": 3,
                        "content": "ถ้าศาลเห็นว่าเพื่อความยุติธรรมไม่ควรให้กระบวนพิจารณาดำเนินเนิ่นช้าไป ศาลจะสั่งให้คู่ความฝ่ายที่บกพร่องในเรื่องความสามารถนั้นดำเนินคดีไปก่อนชั่วคราวก็ได้ แต่ห้ามมิให้ศาลพิพากษาในประเด็นแห่งคดีจนกว่าข้อบกพร่องนั้นได้แก้ไขโดยบริบูรณ์แล้ว",
                        "subsections": null
                    },
                    {
                        "id": 4,
                        "content": "ถ้าผู้ไร้ความสามารถไม่มีผู้แทนโดยชอบธรรมหรือผู้แทนโดยชอบธรรมทำหน้าที่ไม่ได้ ศาลมีอำนาจออกคำสั่งให้อนุญาตหรือให้ความยินยอมตามที่ต้องการ หรือตั้งผู้แทนเฉพาะคดีนั้นให้แก่ผู้ไร้ความสามารถ ถ้าไม่มีบุคคลอื่นใดให้ศาลมีอำนาจตั้งพนักงานอัยการหรือเจ้าพนักงานฝ่ายปกครองอื่นให้เป็นผู้แทนได้",
                        "subsections": null
                    }
                ]
            }
        },
        {
            "id": "มาตรา 57",
            "title": "การร้องสอดเข้าเป็นคู่ความ",
            "content": {
                "paragraphs": [
                    {
                        "id": 1,
                        "content": "บุคคลภายนอกซึ่งมิใช่คู่ความอาจเข้ามาเป็นคู่ความได้ด้วยการร้องสอด",
                        "subsections": [
                            {
                                "id": 1,
                                "content": "ด้วยความสมัครใจเองเพราะเห็นว่าเป็นการจำเป็นเพื่อยังให้ได้รับความรับรอง คุ้มครอง หรือบังคับตามสิทธิของตนที่มีอยู่ โดยยื่นคำร้องขอต่อศาลที่คดีนั้นอยู่ในระหว่างพิจารณา หรือเมื่อตนมีสิทธิเรียกร้องเกี่ยวเนื่องด้วยการบังคับตามคำพิพากษาหรือคำสั่ง โดยยื่นคำร้องขอต่อศาลที่ออกหมายบังคับคดีนั้น"
                            },
                            {
                                "id": 2,
                                "content": "ด้วยความสมัครใจเองเพราะตนมีส่วนได้เสียตามกฎหมายในผลแห่งคดีนั้น โดยยื่นคำร้องขอต่อศาลไม่ว่าเวลาใด ๆ ก่อนมีคำพิพากษา ขออนุญาตเข้าเป็นโจทก์ร่วมหรือจำเลยร่วม หรือเข้าแทนที่คู่ความฝ่ายใดฝ่ายหนึ่งเสียทีเดียวโดยได้รับความยินยอมของคู่ความฝ่ายนั้น แต่ว่าแม้ศาลจะได้อนุญาตให้เข้าแทนที่กันได้ก็ตาม คู่ความฝ่ายนั้นจำต้องผูกพันตนโดยคำพิพากษาของศาลทุกประการเสมือนหนึ่งว่ามิได้มีการเข้าแทนที่กันเลย"
                            },
                            {
                                "id": 3,
                                "content": "ด้วยถูกหมายเรียกให้เข้ามาในคดี\n\n\t  (ก) ตามคำขอของคู่ความฝ่ายใดฝ่ายหนึ่งทำเป็นคำร้องแสดงเหตุว่าตนอาจฟ้องหรือถูกคู่ความเช่นว่านั้นฟ้องตนได้ เพื่อการใช้สิทธิไล่เบี้ย หรือเพื่อใช้ค่าทดแทน ถ้าหากศาลพิจารณาให้คู่ความเช่นว่านั้นแพ้คดี หรือ\n\n\t  (ข) โดยคำสั่งของศาลเมื่อศาลนั้นเห็นสมควร หรือเมื่อคู่ความฝ่ายใดฝ่ายหนึ่งมีคำขอ ในกรณีที่กฎหมายบังคับให้บุคคลภายนอกเข้ามาในคดี หรือศาลเห็นจำเป็นที่จะเรียกบุคคลภายนอกเข้ามาในคดีเพื่อประโยชน์แห่งความยุติธรรม แต่ถ้าคู่ความฝ่ายใดฝ่ายหนึ่ง จะเรียกบุคคลภายนอกเข้ามาในคดีดังกล่าวแล้ว ให้เรียกด้วยวิธียื่นคำร้องเพื่อให้หมายเรียกพร้อมกับคำฟ้องหรือคำให้การ หรือในเวลาใด ๆ ต่อมาก่อนมีคำพิพากษาโดยได้รับอนุญาตจากศาล เมื่อศาลเป็นที่พอใจว่าคำร้องนั้นไม่อาจยื่นก่อนนั้นได้"
                            }
                        ]
                    },
                    {
                        "id": 2,
                        "content": "การส่งหมายเรียกบุคคลภายนอกตามอนุมาตรานี้ต้องมีสำเนาคำขอ หรือคำสั่งของศาล แล้วแต่กรณี และคำฟ้องตั้งต้นคดีนั้นแนบไปด้วย",
                        "subsections": null
                    },
                    {
                        "id": 3,
                        "content": "บทบัญญัติในประมวลกฎหมายนี้ไม่ตัดสิทธิของเจ้าหนี้ในอันที่จะใช้สิทธิเรียกร้องของลูกหนี้และที่จะเรียกลูกหนี้ให้เข้ามาในคดีดังที่บัญญัติไว้ในประมวลกฎหมายแพ่งและพาณิชย์",
                        "subsections": null
                    }
                ]
            }
        },
        {
            "id": "มาตรา 58",
            "title": "สิทธิของผู้ร้องสอด",
            "content": {
                "paragraphs": [
                    {
                        "id": 1,
                        "content": "ผู้ร้องสอดที่ได้เข้าเป็นคู่ความตามอนุมาตรา (๑) และ (๓) แห่งมาตราก่อนนี้ มีสิทธิเสมือนหนึ่งว่าตนได้ฟ้องหรือถูกฟ้องเป็นคดีเรื่องใหม่ ซึ่งโดยเฉพาะผู้ร้องสอดอาจนำพยานหลักฐานใหม่มาแสดง คัดค้านเอกสารที่ได้ยื่นไว้ ถามค้านพยานที่ได้สืบมาแล้ว และคัดค้านพยานหลักฐานที่ได้สืบไปแล้วก่อนที่ตนได้ร้องสอดอาจอุทธรณ์ฎีกาคำพิพากษาหรือคำสั่งของศาลตามที่กฎหมายบัญญัติไว้ และอาจได้รับหรือถูกบังคับให้ใช้ค่าฤชาธรรมเนียม",
                        "subsections": null
                    },
                    {
                        "id": 2,
                        "content": "ห้ามมิให้ผู้ร้องสอดที่ได้เป็นคู่ความตามอนุมาตรา (๒) แห่งมาตราก่อน ใช้สิทธิอย่างอื่นนอกจากสิทธิที่มีอยู่แก่คู่ความฝ่ายซึ่งตนเข้าเป็นโจทก์ร่วมหรือจำเลยร่วมในชั้นพิจารณาเมื่อตนร้องสอด และห้ามมิให้ใช้สิทธิเช่นว่านั้นในทางที่ขัดกับสิทธิของโจทก์หรือจำเลยเดิม และให้ผู้ร้องสอดเสียค่าฤชาธรรมเนียมอันเกิดแต่การที่ร้องสอด แต่ถ้าศาลได้อนุญาตให้เข้าแทนที่โจทก์ หรือจำเลยเดิม ผู้ร้องสอดจึงมีฐานะเสมอด้วยคู่ความที่ตนเข้าแทน",
                        "subsections": null
                    },
                    {
                        "id": 3,
                        "content": "เมื่อได้มีคำพิพากษาหรือคำสั่งแล้ว ถ้ามีข้อเกี่ยวข้องกับคดี เป็นปัญหาจะต้องวินิจฉัยในระหว่างผู้ร้องสอดกับคู่ความฝ่ายที่ตนเข้ามาร่วม หรือที่ตนถูกหมายเรียกให้เข้ามาร่วม ผู้ร้องสอดย่อมต้องผูกพันตามคำพิพากษาหรือคำสั่งนั้น เว้นแต่ในกรณีต่อไปนี้",
                        "subsections": [
                            {
                                "id": 1,
                                "content": "เนื่องจากความประมาทเลินเล่อของคู่ความนั้นทำให้ผู้ร้องสอดเข้ามาเป็นคู่ความในคดีช้าเกินสมควรที่จะแสดงข้อเถียงอันเป็นสาระสำคัญได้ หรือ"
                            },
                            {
                                "id": 2,
                                "content": "เมื่อคู่ความนั้นจงใจหรือประมาทเลินเล่ออย่างร้ายแรงมิได้ยกขึ้นใช้ซึ่งข้อเถียงในปัญหาข้อกฎหมายหรือข้อเท็จจริงอันเป็นสาระสำคัญซึ่งผู้ร้องสอดมิได้รู้ว่ามีอยู่เช่นนั้น"
                            }
                        ]
                    }
                ]
            }
        },
        {
            "id": "มาตรา 59",
            "title": "คู่ความร่วม",
            "content": {
                "paragraphs": [
                    {
                        "id": 1,
                        "content": "บุคคลตั้งแต่สองคนขึ้นไป อาจเป็นคู่ความในคดีเดียวกันได้ โดยเป็นโจทก์ร่วมหรือจำเลยร่วม ถ้าหากปรากฏว่าบุคคลเหล่านั้นมีผลประโยชน์ร่วมกันในมูลความแห่งคดี แต่ห้ามมิให้ถือว่าบุคคลเหล่านั้นแทนซึ่งกันและกัน เว้นแต่มูลความแห่งคดีเป็นการชำระหนี้ ซึ่งแบ่งแยกจากกันมิได้ หรือได้มีกฎหมายบัญญัติไว้ดังนั้นโดยชัดแจ้ง ในกรณีเช่นนี้ ให้ถือว่าบุคคลเหล่านั้นแทนซึ่งกันและกันเพียงเท่าที่จะกล่าวต่อไปนี้",
                        "subsections": [
                            {
                                "id": 1,
                                "content": "บรรดากระบวนพิจารณาซึ่งได้ทำโดย หรือทำต่อคู่ความร่วมคนหนึ่งนั้นให้ถือว่าได้ทำโดย หรือทำต่อ คู่ความร่วมคนอื่น ๆ ด้วย เว้นแต่กระบวนพิจารณาที่คู่ความร่วมคนหนึ่งกระทำไปเป็นที่เสื่อมเสียแก่คู่ความร่วมคนอื่น ๆ"
                            },
                            {
                                "id": 2,
                                "content": "การเลื่อนคดีหรือการงดพิจารณาคดีซึ่งเกี่ยวกับคู่ความร่วมคนหนึ่งนั้น ให้ใช้ถึงคู่ความร่วมคนอื่น ๆ ด้วย"
                            }
                        ]
                    }
                ]
            }
        },
        {
            "id": "มาตรา 144",
            "title": "กระบวนพิจารณาซ้ำ",
            "content": {
                "paragraphs": [
                    {
                        "id": 1,
                        "content": "เมื่อศาลใดมีคำพิพากษา หรือคำสั่งวินิจฉัยชี้ขาดคดีหรือในประเด็นข้อใดแห่งคดีแล้ว ห้ามมิให้ดำเนินกระบวนพิจารณาในศาลนั้นอันเกี่ยวกับคดีหรือประเด็นที่ได้วินิจฉัยชี้ขาดแล้วนั้น เว้นแต่กรณีจะอยู่ภายใต้บังคับบทบัญญัติแห่งประมวลกฎหมายนี้ว่าด้วย",
                        "subsections": [
                            {
                                "id": 1,
                                "content": "การแก้ไขข้อผิดพลาดเล็กน้อยหรือข้อผิดหลงเล็กน้อยอื่น ๆ ตามมาตรา ๑๔๓"
                            },
                            {
                                "id": 2,
                                "content": "การพิจารณาใหม่แห่งคดีซึ่งได้พิจารณาและชี้ขาดตัดสินไปฝ่ายเดียว ตามมาตรา ๒๐๙ และคดีที่เอกสารได้สูญหายหรือบุบสลายตามมาตรา ๕๓"
                            },
                            {
                                "id": 3,
                                "content": "การยื่น การยอมรับ หรือไม่ยอมรับ ซึ่งอุทธรณ์หรือฎีกาตามมาตรา ๒๒๙ และ ๒๔๗ และการดำเนินวิธีบังคับชั่วคราวในระหว่างการยื่นอุทธรณ์ หรือฎีกาตามมาตรา ๒๕๔ วรรคสุดท้าย"
                            },
                            {
                                "id": 4,
                                "content": "การที่ศาลฎีกาหรือศาลอุทธรณ์ส่งคดีคืนไปยังศาลล่างที่ได้พิจารณาและชี้ขาดตัดสินคดีนั้น เพื่อให้พิพากษาใหม่หรือพิจารณาและพิพากษาใหม่ตามมาตรา ๒๔๓"
                            },
                            {
                                "id": 5,
                                "content": "การบังคับคดีตามคำพิพากษาหรือคำสั่งตามมาตรา ๒๗๑"
                            }
                        ]
                    },
                    {
                        "id": 2,
                        "content": "ทั้งนี้ ไม่เป็นการตัดสิทธิในอันที่จะบังคับตามบทบัญญัติแห่งมาตรา ๑๖ และ ๒๔๐ ว่าด้วยการดำเนินกระบวนพิจารณาโดยศาลอื่นแต่งตั้ง",
                        "subsections": null
                    }
                ]
            }
        },
        {
            "id": "มาตรา 148",
            "title": "การฟ้องซ้ำ",
            "content": {
                "paragraphs": [
                    {
                        "id": 1,
                        "content": "คดีที่ได้มีคำพิพากษาหรือคำสั่งถึงที่สุดแล้ว ห้ามมิให้คู่ความเดียวกันรื้อร้องฟ้องกันอีก ในประเด็นที่ได้วินิจฉัยโดยอาศัยเหตุอย่างเดียวกัน เว้นแต่ในกรณีต่อไปนี้",
                        "subsections": [
                            {
                                "id": 1,
                                "content": "เมื่อเป็นกระบวนพิจารณาชั้นบังคับคดีตามคำพิพากษาหรือคำสั่งของศาล"
                            },
                            {
                                "id": 2,
                                "content": "เมื่อคำพิพากษาหรือคำสั่งได้กำหนดวิธีการชั่วคราวให้อยู่ภายในบังคับที่จะแก้ไขเปลี่ยนแปลงหรือยกเลิกเสียได้ตามพฤติการณ์"
                            },
                            {
                                "id": 3,
                                "content": "เมื่อคำพิพากษาหรือคำสั่งนั้นให้ยกคำฟ้องเสียโดยไม่ตัดสิทธิโจทก์ที่จะนำคำฟ้องมายื่นใหม่ ในศาลเดียวกันหรือในศาลอื่น ภายใต้บังคับแห่งบทบัญญัติของกฎหมายว่าด้วยอายุความ"
                            }
                        ]
                    }
                ]
            }
        },
        {
            "id": "มาตรา 172",
            "title": "การยื่นคำฟ้อง",
            "content": {
                "paragraphs": [
                    {
                        "id": 1,
                        "content": "ภายใต้บังคับบทบัญญัติมาตรา ๕๗ ให้โจทก์เสนอข้อหาของตนโดยทำคำฟ้องเป็นหนังสือยื่นต่อศาลชั้นต้น",
                        "subsections": null
                    },
                    {
                        "id": 2,
                        "content": "คำฟ้องต้องแสดงโดยแจ้งชัดซึ่งสภาพแห่งข้อหาของโจทก์และคำขอบังคับ ทั้งข้ออ้างที่อาศัยเป็นหลักแห่งข้อหาเช่นว่านั้น",
                        "subsections": null
                    },
                    {
                        "id": 3,
                        "content": "ให้ศาลตรวจคำฟ้องนั้นแล้วสั่งให้รับไว้ หรือให้ยกเสียหรือให้คืนไป ตามที่บัญญัติไว้ในมาตรา ๑๘",
                        "subsections": null
                    }
                ]
            }
        },
        {
            "id": "มาตรา 173",
            "title": "การส่งสำเนาให้จำเลยแก้คดี / ฟ้องซ้อน",
            "content": {
                "paragraphs": [
                    {
                        "id": 1,
                        "content": "เมื่อศาลได้รับคำฟ้องแล้ว ให้ศาลออกหมายส่งสำเนาคำฟ้องให้แก่จำเลยเพื่อแก้คดี และภายในกำหนดเจ็ดวันนับแต่วันยื่นคำฟ้อง ให้โจทก์ร้องขอต่อพนักงานเจ้าหน้าที่เพื่อให้ส่งหมายนั้น",
                        "subsections": null
                    },
                    {
                        "id": 2,
                        "content": "นับแต่เวลาที่ได้ยื่นคำฟ้องแล้ว คดีนั้นอยู่ในระหว่างพิจารณา และผลแห่งการนี้",
                        "subsections": [
                            {
                                "id": 1,
                                "content": "ห้ามไม่ให้โจทก์ยื่นคำฟ้องเรื่องเดียวกันนั้นต่อศาลเดียวกัน หรือต่อศาลอื่นและ"
                            },
                            {
                                "id": 2,
                                "content": "ถ้ามีเหตุเปลี่ยนแปลงเกิดขึ้นในพฤติการณ์อันเกี่ยวด้วยการยื่นฟ้องคดีต่อศาลที่มีเขตศาลเหนือคดีนั้น เช่นการเปลี่ยนแปลงภูมิลำเนาของจำเลย การเปลี่ยนแปลงเช่นว่านี้หาตัดอำนาจศาลที่รับฟ้องคดีไว้ในอันที่จะพิจารณาและชี้ขาดตัดสินคดีนั้นไม่"
                            }
                        ]
                    }
                ]
            }
        },
        {
            "id": "มาตรา 174",
            "title": "โจทก์ทิ้งฟ้อง",
            "content": {
                "paragraphs": [
                    {
                        "id": 1,
                        "content": "ในกรณีต่อไปนี้ให้ถือว่าโจทก์ได้ทิ้งฟ้อง คือ",
                        "subsections": [
                            {
                                "id": 1,
                                "content": "ภายหลังที่ได้เสนอคำฟ้องแล้ว โจทก์เพิกเฉยไม่ร้องขอต่อพนักงานเจ้าหน้าที่เพื่อให้ส่งหมายเรียกให้แก้คดีแก่จำเลย และไม่แจ้งให้ศาลทราบเหตุแห่งการเพิกเฉยเช่นว่านั้นภายในกำหนดเจ็ดวันนับแต่วันยื่นคำฟ้อง"
                            },
                            {
                                "id": 2,
                                "content": "โจทก์เพิกเฉยไม่ดำเนินคดีภายในเวลาตามที่ศาลเห็นสมควรกำหนดไว้เพื่อการนั้นโดยได้ส่งคำสั่งให้แก่โจทก์โดยชอบแล้ว"
                            }
                        ]
                    }
                ]
            }
        },
        {
            "id": "มาตรา 175",
            "title": "การแก้ไขคำฟ้อง / คำให้การ",
            "content": {
                "paragraphs": [
                    {
                        "id": 1,
                        "content": "ก่อนจำเลยยื่นคำให้การ โจทก์อาจถอนคำฟ้องได้โดยยื่นคำบอกกล่าวเป็นหนังสือต่อศาล",
                        "subsections": null
                    },
                    {
                        "id": 2,
                        "content": "ภายหลังจำเลยยื่นคำให้การแล้ว โจทก์อาจยื่นคำขอโดยทำเป็นคำร้องต่อศาลชั้นต้น เพื่ออนุญาตให้โจทก์ถอนคำฟ้องได้ ศาลจะอนุญาตหรือไม่อนุญาตหรืออนุญาตภายในเงื่อนไขตามที่เห็นสมควรก็ได้ แต่",
                        "subsections": [
                            {
                                "id": 1,
                                "content": "ห้ามไม่ให้ศาลให้อนุญาต โดยมิได้ฟังจำเลยหรือผู้ร้องสอด ถ้าหากมี"
                            },
                            {
                                "id": 2,
                                "content": "ในกรณีที่โจทก์ถอนคำฟ้อง เนื่องจากมีข้อตกลงหรือประนีประนอมยอมความกับจำเลย ให้ศาลอนุญาตไปตามคำขอนั้น"
                            }
                        ]
                    }
                ]
            }
        },
        {
            "id": "มาตรา 176",
            "title": "ผลการทิ้งฟ้อง",
            "content": {
                "paragraphs": [
                    {
                        "id": 1,
                        "content": "การทิ้งคำฟ้องหรือถอนคำฟ้องย่อมลบล้างผลแห่งการยื่นคำฟ้องนั้น รวมทั้งกระบวนพิจารณาอื่น ๆ อันมีมาต่อภายหลังยื่นคำฟ้อง และกระทำให้คู่ความกลับคืนเข้าสู่ฐานะเดิมเสมือนหนึ่งมิได้มีการยื่นฟ้องเลย แต่ว่าคำฟ้องใด ๆ ที่ได้ทิ้งหรือถอนแล้ว อาจยื่นใหม่ได้ ภายใต้บังคับแห่งบทบัญญัติของกฎหมายว่าด้วยอายุความ",
                        "subsections": null
                    }
                ]
            }
        },
        {
            "id": "มาตรา 177",
            "title": "คำให้การ",
            "content": {
                "paragraphs": [
                    {
                        "id": 1,
                        "content": "เมื่อได้ส่งหมายเรียกและคำฟ้องให้จำเลยแล้ว ให้จำเลยทำคำให้การเป็นหนังสือยื่นต่อศาลภายในสิบห้าวัน",
                        "subsections": null
                    },
                    {
                        "id": 2,
                        "content": "ให้จำเลยแสดงโดยชัดแจงในคำให้การว่า จำเลยยอมรับหรือปฏิเสธข้ออ้างของโจทก์ทั้งสิ้นหรือแต่บางส่วน รวมทั้งเหตุแห่งการนั้น",
                        "subsections": null
                    },
                    {
                        "id": 3,
                        "content": "จำเลยจะฟ้องแย้งมาในคำให้การก็ได้ แต่ถ้าฟ้องแย้งนั้นเป็นเรื่องอื่นไม่เกี่ยวกับคำฟ้องเดิมแล้ว ให้ศาลสั่งให้จำเลยฟ้องเป็นคดีต่างหาก",
                        "subsections": null
                    },
                    {
                        "id": 4,
                        "content": "ให้ศาลตรวจดูคำให้การนั้นแล้วสั่งให้รับไว้ หรือให้คืนไปหรือสั่งไม่รับตามที่บัญญัติไว้ในมาตรา ๑๘",
                        "subsections": null
                    },
                    {
                        "id": 5,
                        "content": "บทบัญญัติแห่งมาตรานี้ ให้ใช้บังคับแก่บุคคลภายนอกที่ถูกเรียกเข้ามาเป็นผู้ร้องสอดตามมาตรา ๕๗ (๓) โดยอนุโลม",
                        "subsections": null
                    }
                ]
            }
        },
        {
            "id": "มาตรา 178",
            "title": "คำให้การแก้ฟ้องแย้ง",
            "content": {
                "paragraphs": [
                    {
                        "id": 1,
                        "content": "ถ้าจำเลยฟ้องแย้งรวมในคำให้การ ให้โจทก์ทำคำให้การแก้ฟ้องแย้งยื่นต่อศาลภายในสิบห้าวันนับแต่วันที่ได้ส่งคำให้การถึงโจทก์",
                        "subsections": null
                    },
                    {
                        "id": 2,
                        "content": "บทบัญญัติแห่งมาตราก่อน ให้ใช้บังคับแก่คำให้การแก้ฟ้องแย้งนี้โดยอนุโลม",
                        "subsections": null
                    }
                ]
            }
        },
        {
            "id": "มาตรา 179",
            "title": "การแก้ไขคำให้การ",
            "content": {
                "paragraphs": [
                    {
                        "id": 1,
                        "content": " โจทก์หรือจำเลยจะแก้ไขข้อหา ข้อต่อสู้ข้ออ้าง หรือข้อเถียง อันกล่าวไว้ในคำฟ้องหรือคำให้การที่เสนอต่อศาลแต่แรกก็ได้",
                        "subsections": null
                    },
                    {
                        "id": 2,
                        "content": "การแก้ไขนั้น โดยเฉพาะอาจเป็นการแก้ไขในข้อต่อไปนี้",
                        "subsections": [
                            {
                                "id": 1,
                                "content": "เพิ่ม หรือลด จำนวนทุนทรัพย์ หรือราคาทรัพย์สินที่พิพาทในฟ้องเดิม หรือ"
                            },
                            {
                                "id": 2,
                                "content": "สละข้อหาในฟ้องเดิมเสียบางข้อ หรือเพิ่มเติมฟ้องเดิมให้บริบูรณ์โดยวิธีเสนอคำฟ้องเพิ่มเติม หรือเสนอคำฟ้องเพื่อคุ้มครองสิทธิของตนในระหว่างการพิจารณาหรือเพื่อบังคับตามคำพิพากษาหรือคำสั่ง หรือ"
                            },
                            {
                                "id": 3,
                                "content": "ยกข้อต่อสู้ขึ้นใหม่ เป็นข้อแก้ข้อหาเดิม หรือที่ยื่นภายหลัง หรือเปลี่ยนแปลงแก้ไขข้ออ้าง หรือข้อเถียงเพื่อสนับสนุนข้อหา หรือเพื่อหักล้างข้อหาของคู่ความอีกฝ่ายหนึ่ง"
                            }
                        ]
                    },
                    {
                        "id": 3,
                        "content": "แต่ห้ามมิให้คู่ความฝ่ายใดเสนอคำฟ้องใดต่อศาล ไม่ว่าโดยวิธีฟ้องเพิ่มเติมหรือฟ้องแย้ง ภายหลังที่ได้ยื่นคำฟ้องเดิมต่อศาลแล้ว เว้นแต่คำฟ้องเดิมและคำฟ้องภายหลังนี้จะเกี่ยวข้องกันพอที่จะรวมการพิจารณาและชี้ขาดตัดสินเข้าด้วยกันได้",
                        "subsections": null
                    }
                ]
            }
        },
        {
            "id": "มาตรา 180",
            "title": "เวลาการการแก้ไขคำให้การ",
            "content": {
                "paragraphs": [
                    {
                        "id": 1,
                        "content": "การแก้ไขคำฟ้องหรือคำให้การที่คู่ความเสนอต่อศาลไว้แล้ว ให้ทำเป็นคำร้องยื่นต่อศาลก่อนวันชี้สองสถาน หรือก่อนวันสืบพยานไม่น้อยกว่าเจ็ดวัน ในกรณีที่ไม่มีการชี้สองสถาน เว้นแต่มีเหตุอันสมควรที่ไม่อาจยื่นคำร้องได้ก่อนนั้นหรือเป็นการขอแก้ไขในเรื่องที่เกี่ยวกับความสงบเรียบร้อยของประชาชน หรือเป็นการแก้ไขข้อผิดพลาดเล็กน้อยหรือข้อผิดหลงเล็กน้อย",
                        "subsections": null
                    }
                ]
            }
        },
        {
            "id": "มาตรา 197",
            "title": "ถือว่าจำเลยขาดนัดยื่นคำให้การ",
            "content": {
                "paragraphs": [
                    {
                        "id": 1,
                        "content": "เมื่อจำเลยได้รับหมายเรียกให้ยื่นคำให้การแล้ว จำเลยมิได้ยื่นคำให้การภายในระยะเวลาที่กำหนดไว้ตามกฎหมายหรือตามคำสั่งศาล ให้ถือว่าจำเลยขาดนัดยื่นคำให้การ",
                        "subsections": null
                    }
                ]
            }
        },
        {
            "id": "มาตรา 198",
            "title": "โจทก์ชนะคดีโดยขาดนัด",
            "content": {
                "paragraphs": [
                    {
                        "id": 1,
                        "content": "ถ้าจำเลยขาดนัดยื่นคำให้การ ให้โจทก์มีคำขอต่อศาลภายในสิบห้าวันนับแต่ระยะเวลาที่กำหนดให้จำเลยยื่นคำให้การได้สิ้นสุดลง เพื่อให้ศาลมีคำพิพากษาหรือคำสั่งชี้ขาดให้ตนเป็นฝ่ายชนะคดีโดยขาดนัด",
                        "subsections": null
                    },
                    {
                        "id": 2,
                        "content": "ถ้าโจทก์ไม่ยื่นคำขอต่อศาลภายในกำหนดระยะเวลาดังกล่าวแล้ว ให้ศาลมีคำสั่งจำหน่ายคดีนั้นเสียจากสารบบความ",
                        "subsections": null
                    },
                    {
                        "id": 3,
                        "content": "ถ้าโจทก์ยื่นคำขอต่อศาลภายในกำหนดระยะเวลาดังกล่าวแล้ว ให้ศาลมีคำพิพากษาหรือคำสั่งชี้ขาดคดีโดยขาดนัดไปตามมาตรา ๑๙๘ ทวิ แต่ถ้าศาลมีเหตุสงสัยว่าจำเลยจะไม่ทราบหมายเรียกให้ยื่นคำให้การ ก็ให้ศาลมีคำสั่งให้มีการส่งหมายเรียกใหม่ โดยวิธีส่งหมายธรรมดาหรือโดยวิธีอื่นแทน และจะกำหนดเงื่อนไขอย่างใดตามที่เห็นสมควรเพื่อให้จำเลยได้ทราบหมายเรียกนั้นก็ได้",
                        "subsections": null
                    }
                ]
            }
        },
        {
            "id": "มาตรา 198 ทวิ",
            "title": "ศาลมีคำพิพากษาให้โจทก์เป็นฝ่ายชนะคดีโดยจำเลยขาดนัดยื่นคำให้การ",
            "content": {
                "paragraphs": [
                    {
                        "id": 1,
                        "content": " ศาลจะมีคำพิพากษาหรือคำสั่งชี้ขาดให้โจทก์เป็นฝ่ายชนะคดีโดยจำเลยขาดนัดยื่นคำให้การมิได้ เว้นแต่ศาลเห็นว่าคำฟ้องของโจทก์มีมูลและไม่ขัดต่อกฎหมาย  ในการนี้ ศาลจะยกขึ้นอ้างโดยลำพังซึ่งข้อกฎหมายอันเกี่ยวด้วยความสงบเรียบร้อยของประชาชนก็ได้",
                        "subsections": null
                    },
                    {
                        "id": 2,
                        "content": "เพื่อประโยชน์ในการพิพากษาหรือมีคำสั่งชี้ขาดคดีตามวรรคหนึ่ง ศาลอาจสืบพยานเกี่ยวกับข้ออ้างของโจทก์หรือพยานหลักฐานอื่นไปฝ่ายเดียวตามที่เห็นว่าจำเป็นก็ได้ แต่ในคดีเกี่ยวด้วยสิทธิแห่งสภาพบุคคล สิทธิในครอบครัวหรือคดีพิพาทเกี่ยวด้วยกรรมสิทธิ์ในอสังหาริมทรัพย์ ให้ศาลสืบพยานหลักฐานโจทก์ไปฝ่ายเดียว และศาลอาจเรียกพยานหลักฐานอื่นมาสืบได้เองตามที่เห็นว่าจำเป็นเพื่อประโยชน์แห่งความยุติธรรม",
                        "subsections": null
                    },
                    {
                        "id": 3,
                        "content": "ในการกำหนดจำนวนเงินตามคำขอบังคับของโจทก์ ให้ศาลปฏิบัติดังนี้",
                        "subsections": [
                            {
                                "id": 1,
                                "content": "ในกรณีที่โจทก์มีคำขอบังคับให้จำเลยชำระหนี้เป็นเงินจำนวนแน่นอน ให้ศาลมีคำสั่งให้โจทก์ส่งพยานเอกสารตามที่ศาลเห็นว่าจำเป็นแทนการสืบพยาน",
                                "subsections": null
                            },
                            {
                                "id": 2,
                                "content": "ในกรณีที่โจทก์มีคำขอบังคับให้จำเลยชำระหนี้เป็นเงินอันไม่อาจกำหนดจำนวนได้โดยแน่นอน ให้ศาลสืบพยานหลักฐานโจทก์ไปฝ่ายเดียว และศาลอาจเรียกพยานหลักฐานอื่นมาสืบได้เองตามที่เห็นว่าจำเป็น",
                                "subsections": null
                            }
                        ]
                    },
                    {
                        "id": 4,
                        "content": "ถ้าจำเลยที่ขาดนัดยื่นคำให้การไม่มาศาลในวันสืบพยานตามมาตรานี้ มิให้ถือว่าจำเลยนั้นขาดนัดพิจารณา"
                    },
                    {
                        "id": 5,
                        "content": "ถ้าโจทก์ไม่นำพยานหลักฐานมาสืบตามความในมาตรานี้ภายในระยะเวลาที่ศาลกำหนด ให้ถือว่าคดีของโจทก์ไม่มีมูล และให้ศาลยกฟ้องของโจทก์"
                    }
                ]
            }
        },
        {
            "id": "มาตรา 198 ตรี",
            "title": "จำเลยบางคนขาดนัดยื่นคำให้การ",
            "content": {
                "paragraphs": [
                    {
                        "id": 1,
                        "content": "ในคดีที่จำเลยบางคนขาดนัดยื่นคำให้การ ให้ศาลมีคำพิพากษาหรือคำสั่งชี้ขาดคดีโดยขาดนัดยื่นคำให้การระหว่างโจทก์กับจำเลยที่ขาดนัดยื่นคำให้การนั้นไปก่อนและดำเนินการพิจารณาคดีระหว่างโจทก์กับจำเลยที่ยื่นคำให้การต่อไป แต่ถ้ามูลความแห่งคดีนั้นเป็นการชำระหนี้ซึ่งแบ่งแยกจากกันมิได้ ให้ศาลรอการพิพากษาหรือมีคำสั่งชี้ขาดคดีโดยขาดนัดยื่นคำให้การไว้ก่อน เมื่อศาลดำเนินการพิจารณาสำหรับจำเลยที่ยื่นคำให้การเสร็จสิ้นแล้ว ก็ให้ศาลมีคำพิพากษาหรือคำสั่งชี้ขาดคดีไปตามรูปคดีสำหรับจำเลยทุกคน",
                        "subsections": null
                    },
                    {
                        "id": 2,
                        "content": "ในกรณีที่จำเลยที่ขาดนัดยื่นคำให้การไม่มาศาลในวันสืบพยานของคู่ความอื่นมิให้ถือว่าจำเลยนั้นขาดนัดพิจารณา",
                        "subsections": null
                    }
                ]
            }
        },
        {
            "id": "มาตรา 199",
            "title": "ผลของการขาดนัดยื่นคำให้การ",
            "content": {
                "paragraphs": [
                    {
                        "id": 1,
                        "content": "ถ้าจำเลยที่ขาดนัดยื่นคำให้การมาศาลก่อนศาลวินิจฉัยชี้ขาดคดีและแจ้งต่อศาลในโอกาสแรกว่าตนประสงค์จะต่อสู้คดี เมื่อศาลเห็นว่าการขาดนัดยื่นคำให้การนั้นมิได้เป็นไปโดยจงใจหรือมีเหตุอันสมควร ให้ศาลมีคำสั่งอนุญาตให้จำเลยยื่นคำให้การภายในกำหนดเวลาตามที่ศาลเห็นสมควร และดำเนินกระบวนพิจารณาใหม่ตั้งแต่เวลาที่จำเลยขาดนัดยื่นคำให้การ",
                        "subsections": null
                    },
                    {
                        "id": 2,
                        "content": "ในกรณีตามวรรคหนึ่ง ถ้าจำเลยที่ขาดนัดยื่นคำให้การมิได้แจ้งต่อศาลก็ดี หรือศาลเห็นว่าการขาดนัดยื่นคำให้การนั้นเป็นไปโดยจงใจหรือไม่มีเหตุอันสมควรก็ดี ให้ศาลดำเนินกระบวนพิจารณาต่อไป ในกรณีเช่นนี้ จำเลยอาจถามค้านพยานโจทก์ที่อยู่ระหว่างการสืบได้ แต่จะนำสืบพยานหลักฐานของตนไม่ได้",
                        "subsections": null
                    },
                    {
                        "id": 1,
                        "content": "ในกรณีที่จำเลยมิได้ยื่นคำให้การภายในกำหนดเวลาตามวรรคหนึ่ง หรือศาลไม่อนุญาตให้จำเลยยื่นคำให้การตามวรรคสอง หรือศาลเคยมีคำสั่งให้พิจารณาคดีใหม่ ตามคำขอของจำเลยที่ขาดนัดยื่นคำให้การตามมาตรา ๑๙๙ ตรี มาก่อน จำเลยนั้นจะขอยื่นคำให้การตามมาตรานี้อีกหรือจะร้องขอให้พิจารณาคดีใหม่ไม่ได้",
                        "subsections": null
                    }
                ]
            }
        },
        {
            "id": "มาตรา 199 ทวิ",
            "title": "เมื่อศาลพิพากษาให้จำเลยที่ขาดนัดยื่นคำให้การแพ้คดี",
            "content": {
                "paragraphs": [
                    {
                        "id": 1,
                        "content": "เมื่อศาลพิพากษาให้จำเลยที่ขาดนัดยื่นคำให้การแพ้คดี ศาลอาจกำหนดการอย่างใด ตามที่เห็นสมควรเพื่อส่งคำบังคับตามคำพิพากษาหรือคำสั่งให้แก่จำเลยที่ขาดนัดยื่นคำให้การ โดยวิธีส่งหมายธรรมดาหรือโดยวิธีอื่นแทน หรือศาลจะให้เลื่อนการบังคับตามคำพิพากษาหรือคำสั่งเช่นว่านั้นไปภายในระยะเวลาที่ศาลเห็นสมควรก็ได้",
                        "subsections": null
                    },
                    {
                        "id": 2,
                        "content": "การบังคับตามคำพิพากษาหรือคำสั่งแก่จำเลยที่ขาดนัดยื่นคำให้การนั้นให้บังคับตามมาตรา ๒๗๓ มาตรา ๒๘๙ และมาตรา ๓๓๘",
                        "subsections": null
                    }
                ]
            }
        },
        {
            "id": "มาตรา ๑๙๙ ตรี",
            "title": "จำเลยซึ่งแพ้คดีโดยขาดนัดยื่นคำให้การ ขอให้พิจารณาคดีใหม่ได้",
            "content": {
                "paragraphs": [
                    {
                        "id": 1,
                        "content": "จำเลยซึ่งศาลมีคำพิพากษาหรือคำสั่งชี้ขาดให้แพ้คดีโดยขาดนัดยื่นคำให้การ ถ้ามิได้ยื่นอุทธรณ์คำพิพากษาหรือคำสั่งนั้น จำเลยนั้นอาจมีคำขอให้พิจารณาคดีใหม่ได้ เว้นแต่",
                        "subsections": [
                            {
                                "id": 1,
                                "content": "ศาลเคยมีคำสั่งให้พิจารณาคดีนั้นใหม่มาครั้งหนึ่งแล้ว"
                            },
                            {
                                "id": 2,
                                "content": "คำขอให้พิจารณาคดีใหม่นั้นต้องห้ามตามกฎหมาย"
                            }
                        ]
                    }
                ]
            }
        }
    ]
}
