{
    "criminal_procedure_code": [
        {
            "id": "มาตรา 1",
            "title": "คำนิยาม 1",
            "content": {
                "paragraphs": [
                    {
                        "id": 1,
                        "content": "ในประมวลกฎหมายนี้",
                        "subsections": [
                            {
                                "id": 16,
                                "content": "“พนักงานฝ่ายปกครองหรือตำรวจ” หมายความถึงเจ้าพนักงานซึ่งกฎหมายให้มีอำนาจและหน้าที่รักษาความสงบเรียบร้อยของประชาชน ให้รวมทั้งพัศดี เจ้าพนักงานกรมสรรพสามิต กรมศุลกากร กรมเจ้าท่า พนักงานตรวจคนเข้าเมือง และเจ้าพนักงานอื่น ๆ ในเมื่อทำการอันเกี่ยวกับการจับกุมปราบปรามผู้กระทำผิดกฎหมายซึ่งตนมีหน้าที่ต้องจับกุมหรือปราบปราม"
                            },
                            {
                                "id": 18,
                                "content": "“กระทำชำเรา” หมายความว่า กระทำเพื่อสนองความใคร่ของผู้กระทำ โดยการใช้อวัยวะเพศของผู้กระทำล่วงล้ำอวัยวะเพศ ทวารหนัก หรือช่องปากของผู้อื่น "
                            }
                        ]
                    }
                ]
            }
        },
        {
            "id": "มาตรา 2",
            "title": "คำนิยาม 2",
            "content": {
                "paragraphs": [
                    {
                        "id": 1,
                        "content": "ในประมวลกฎหมายนี้",
                        "subsections": [
                            {
                                "id": 9,
                                "content": "“หมายอาญา” หมายความถึงหนังสือบงการที่ออกตามบทบัญญัติแห่งประมวลกฎหมายนี้สั่งให้เจ้าหน้าที่ทำการจับ ขัง จำคุก หรือปล่อยผู้ต้องหา จำเลย หรือนักโทษหรือให้ทำการค้น รวมทั้งสำเนาหมายจับหรือหมายค้นอันได้รับรองว่าถูกต้อง และคำบอกกล่าวทางโทรเลขว่าได้ออกหมายจับหรือหมายค้นแล้ว ตลอดจนสำเนาหมายจับหรือหมายค้นที่ได้ส่งทางโทรสาร สื่ออิเล็กทรอนิกส์ หรือสื่อเทคโนโลยีสารสนเทศประเภทอื่น  ทั้งนี้ ตามที่บัญญัติไว้ในมาตรา ๗๗"
                            }
                        ]
                    }
                ]
            }
        },
        {
            "id": "มาตรา 57",
            "title": "จะจับ ขัง จำคุก หรือค้นในที่รโหฐาน ต้องมีหมายศาล",
            "content": {
                "paragraphs": [
                    {
                        "id": 1,
                        "content": "ภายใต้บังคับแห่งบทบัญญัติในมาตรา ๗๘ มาตรา ๗๙ มาตรา ๘๐ มาตรา ๙๒ และมาตรา ๙๔ แห่งประมวลกฎหมายนี้ จะจับ ขัง จำคุก หรือค้นในที่รโหฐานหาตัวคนหรือสิ่งของต้องมีคำสั่งหรือหมายของศาลสำหรับการนั้น"
                    },
                    {
                        "id": 2,
                        "content": "บุคคลซึ่งต้องขังหรือจำคุกตามหมายศาล จะปล่อยไปได้ก็เมื่อมีหมายปล่อยของศาล"
                    }
                ]
            }
        }
    ]
}
