{
    "criminal_procedure_code": [
        {
            "id": "มาตรา 1",
            "title": "คำนิยาม 1",
            "content": {
                "paragraphs": [
                    {
                        "id": 1,
                        "content": "ในประมวลกฎหมายนี้",
                        "subsections": [
                            {
                                "id": "2",
                                "content": "“ผู้ต้องหา” หมายความถึงบุคคลผู้ถูกหาว่าได้กระทำความผิด แต่ยังมิได้ถูกฟ้องต่อศาล"
                            },
                            {
                                "id": "3",
                                "content": "“จำเลย” หมายความถึงบุคคลผู้ถูกฟ้องต่อศาลว่าได้กระทำความผิด"
                            },
                            {
                                "id": "4",
                                "content": "“ผู้เสียหาย” หมายความถึงบุคคลผู้ได้รับความเสียหายเนื่องจากการกระทำผิดฐานใดฐานหนึ่ง รวมทั้งบุคคลอื่นที่มีอำนาจจัดการแทนได้ ดังบัญญัติไว้ในมาตรา ๔, ๕ และ ๖"
                            },
                            {
                                "id": "9",
                                "content": "“หมายอาญา” หมายความถึงหนังสือบงการที่ออกตามบทบัญญัติแห่งประมวลกฎหมายนี้สั่งให้เจ้าหน้าที่ทำการจับ ขัง จำคุก หรือปล่อยผู้ต้องหา จำเลย หรือนักโทษหรือให้ทำการค้น รวมทั้งสำเนาหมายจับหรือหมายค้นอันได้รับรองว่าถูกต้อง และคำบอกกล่าวทางโทรเลขว่าได้ออกหมายจับหรือหมายค้นแล้ว ตลอดจนสำเนาหมายจับหรือหมายค้นที่ได้ส่งทางโทรสาร สื่ออิเล็กทรอนิกส์ หรือสื่อเทคโนโลยีสารสนเทศประเภทอื่น  ทั้งนี้ ตามที่บัญญัติไว้ในมาตรา ๗๗"
                            },
                            {
                                "id": "16",
                                "content": "“พนักงานฝ่ายปกครองหรือตำรวจ” หมายความถึงเจ้าพนักงานซึ่งกฎหมายให้มีอำนาจและหน้าที่รักษาความสงบเรียบร้อยของประชาชน ให้รวมทั้งพัศดี เจ้าพนักงานกรมสรรพสามิต กรมศุลกากร กรมเจ้าท่า พนักงานตรวจคนเข้าเมือง และเจ้าพนักงานอื่น ๆ ในเมื่อทำการอันเกี่ยวกับการจับกุมปราบปรามผู้กระทำผิดกฎหมายซึ่งตนมีหน้าที่ต้องจับกุมหรือปราบปราม"
                            }
                        ]
                    }
                ]
            }
        },
        {
            "id": "มาตรา 2",
            "title": "คำนิยาม 2",
            "content": {
                "paragraphs": [
                    {
                        "id": 1,
                        "content": "ในประมวลกฎหมายนี้",
                        "subsections": [
                            {
                                "id": "9",
                                "content": "“หมายอาญา” หมายความถึงหนังสือบงการที่ออกตามบทบัญญัติแห่งประมวลกฎหมายนี้สั่งให้เจ้าหน้าที่ทำการจับ ขัง จำคุก หรือปล่อยผู้ต้องหา จำเลย หรือนักโทษหรือให้ทำการค้น รวมทั้งสำเนาหมายจับหรือหมายค้นอันได้รับรองว่าถูกต้อง และคำบอกกล่าวทางโทรเลขว่าได้ออกหมายจับหรือหมายค้นแล้ว ตลอดจนสำเนาหมายจับหรือหมายค้นที่ได้ส่งทางโทรสาร สื่ออิเล็กทรอนิกส์ หรือสื่อเทคโนโลยีสารสนเทศประเภทอื่น  ทั้งนี้ ตามที่บัญญัติไว้ในมาตรา ๗๗"
                            }
                        ]
                    }
                ]
            }
        },
        {
            "id": "มาตรา 3",
            "title": "อำนาจจัดการแทนผู้เสียหาย",
            "content": {
                "paragraphs": [
                    {
                        "id": 1,
                        "content": "บุคคลดังระบุในมาตรา ๔, ๕ และ ๖ มีอำนาจจัดการต่อไปนี้แทนผู้เสียหายตามเงื่อนไขที่บัญญัติไว้ในมาตรานั้น ๆ",
                        "subsections": [
                            {
                                "id": "2",
                                "content": "บุคคลดังระบุในมาตรา ๔, ๕ และ ๖ มีอำนาจจัดการต่อไปนี้แทนผู้เสียหายตามเงื่อนไขที่บัญญัติไว้ในมาตรานั้น ๆ"
                            }
                        ]
                    }
                ]
            }
        },
        {
            "id": "มาตรา 5",
            "title": "บุคคลจัดการแทนผู้เสียหาย",
            "content": {
                "paragraphs": [
                    {
                        "id": 1,
                        "content": "บุคคลเหล่านี้จัดการแทนผู้เสียหายได้",
                        "subsections": [
                            {
                                "id": "1",
                                "content": "ผู้แทนโดยชอบธรรมหรือผู้อนุบาล เฉพาะแต่ในความผิดซึ่งได้กระทำต่อผู้เยาว์ หรือผู้ไร้ความสามารถซึ่งอยู่ในความดูแล"
                            },
                            {
                                "id": "2",
                                "content": "ผู้บุพการี ผู้สืบสันดาน สามีหรือภริยาเฉพาะแต่ในความผิดอาญา ซึ่งผู้เสียหายถูกทำร้ายถึงตายหรือบาดเจ็บจนไม่สามารถจะจัดการเองได้"
                            },
                            {
                                "id": "3",
                                "content": "ผู้จัดการหรือผู้แทนอื่น ๆ ของนิติบุคคล เฉพาะความผิดซึ่งกระทำลงแก่นิติบุคคลนั้น"
                            }
                        ]
                    }
                ]
            }
        },
        {
            "id": "มาตรา 15",
            "title": "ฟ้องซ้อน ให้ใช้ประมวลกฎหมายวิธีพิจารณาความแพ่ง",
            "content": {
                "paragraphs": [
                    {
                        "id": 1,
                        "content": "วิธีพิจารณาข้อใดซึ่งประมวลกฎหมายนี้มิได้บัญญัติไว้โดยเฉพาะ ให้นำบทบัญญัติแห่งประมวลกฎหมายวิธีพิจารณาความแพ่งมาใช้บังคับเท่าที่พอจะใช้บังคับได้",
                        "subsections": null
                    }
                ]
            }
        },
        {
            "id": "มาตรา 28",
            "title": "ผู้มีอำนาจฟ้องคดีอาญาต่อศาล",
            "content": {
                "paragraphs": [
                    {
                        "id": 1,
                        "content": "บุคคลเหล่านี้มีอำนาจฟ้องคดีอาญาต่อศาล",
                        "subsections": [
                            {
                                "id": "1",
                                "content": "พนักงานอัยการ"
                            },
                            {
                                "id": "2",
                                "content": "ผู้เสียหาย"
                            }
                        ]
                    }
                ]
            }
        },
        {
            "id": "มาตรา 30",
            "title": "ผู้เสียหายยื่นคำร้องขอเข้าร่วมเป็นโจทก์ได้",
            "content": {
                "paragraphs": [
                    {
                        "id": 1,
                        "content": "คดีอาญาใดซึ่งพนักงานอัยการยื่นฟ้องต่อศาลแล้ว ผู้เสียหายจะยื่นคำร้องขอเข้าร่วมเป็นโจทก์ในระยะใดระหว่างพิจารณาก่อนศาลชั้นต้นพิพากษาคดีนั้นก็ได้"
                    }
                ]
            }
        },
        {
            "id": "มาตรา 39",
            "title": "การระงับสิทธินำคดีอาญามาฟ้อง",
            "content": {
                "paragraphs": [
                    {
                        "id": 1,
                        "content": "สิทธินำคดีอาญามาฟ้องย่อมระงับไปดังต่อไปนี้",
                        "subsections": [
                            {
                                "id": "1",
                                "content": "โดยความตายของผู้กระทำผิด"
                            },
                            {
                                "id": "2",
                                "content": "ในคดีความผิดต่อส่วนตัว เมื่อได้ถอนคำร้องทุกข์ ถอนฟ้องหรือยอมความกันโดยถูกต้องตามกฎหมาย"
                            },
                            {
                                "id": "3",
                                "content": "เมื่อคดีเลิกกันตามมาตรา ๓๗"
                            },
                            {
                                "id": "4",
                                "content": "เมื่อมีคำพิพากษาเสร็จเด็ดขาดในความผิดซึ่งได้ฟ้อง"
                            },
                            {
                                "id": "5",
                                "content": "เมื่อมีกฎหมายออกใช้ภายหลังการกระทำผิดยกเลิกความผิดเช่นนั้น"
                            },
                            {
                                "id": "6",
                                "content": "เมื่อคดีขาดอายุความ"
                            },
                            {
                                "id": "7",
                                "content": "เมื่อมีกฎหมายยกเว้นโทษ"
                            }
                        ]
                    }
                ]
            }
        },
        {
            "id": "มาตรา 57",
            "title": "จะจับ ขัง จำคุก หรือค้นในที่รโหฐาน ต้องมีหมายศาล",
            "content": {
                "paragraphs": [
                    {
                        "id": 1,
                        "content": "ภายใต้บังคับแห่งบทบัญญัติในมาตรา ๗๘ มาตรา ๗๙ มาตรา ๘๐ มาตรา ๙๒ และมาตรา ๙๔ แห่งประมวลกฎหมายนี้ จะจับ ขัง จำคุก หรือค้นในที่รโหฐานหาตัวคนหรือสิ่งของต้องมีคำสั่งหรือหมายของศาลสำหรับการนั้น"
                    },
                    {
                        "id": 2,
                        "content": "บุคคลซึ่งต้องขังหรือจำคุกตามหมายศาล จะปล่อยไปได้ก็เมื่อมีหมายปล่อยของศาล"
                    }
                ]
            }
        },
        {
            "id": "มาตรา 58",
            "title": "ศาลมีอำนาจออกคำสั่งหรือหมายอาญา",
            "content": {
                "paragraphs": [
                    {
                        "id": 1,
                        "content": "ศาลมีอำนาจออกคำสั่งหรือหมายอาญาได้ภายในเขตอำนาจตามหลักเกณฑ์และวิธีการที่กำหนดในข้อบังคับของประธานศาลฎีกา"
                    }
                ]
            }
        },
        {
            "id": "มาตรา 59",
            "title": "ศาลออกหมายจับ หมายค้น หรือหมายขัง",
            "content": {
                "paragraphs": [
                    {
                        "id": 1,
                        "content": "ศาลจะออกคำสั่งหรือหมายจับ หมายค้น หรือหมายขัง ตามที่ศาลเห็นสมควรหรือโดยมีผู้ร้องขอก็ได้"
                    },
                    {
                        "id": 2,
                        "content": "ในกรณีที่ผู้ร้องขอเป็นพนักงานฝ่ายปกครองหรือตำรวจ ต้องเป็นพนักงานฝ่ายปกครองตั้งแต่ระดับสามหรือตำรวจซึ่งมียศตั้งแต่ชั้นร้อยตำรวจตรีหรือเทียบเท่าขึ้นไป"
                    },
                    {
                        "id": 3,
                        "content": "ในกรณีจำเป็นเร่งด่วนซึ่งมีเหตุอันควรโดยผู้ร้องขอไม่อาจไปพบศาลได้ ผู้ร้องขออาจร้องขอต่อศาลทางโทรศัพท์ โทรสาร สื่ออิเล็กทรอนิกส์ หรือสื่อเทคโนโลยีสารสนเทศประเภทอื่นที่เหมาะสมเพื่อขอให้ศาลออกหมายจับหรือหมายค้นก็ได้ ในกรณีเช่นว่านี้เมื่อศาลสอบถามจนปรากฏว่ามีเหตุที่จะออกหมายจับหรือหมายค้นได้ตามมาตรา ๕๙/๑ และมีคำสั่งให้ออกหมายนั้นแล้ว ให้จัดส่งสำเนาหมายเช่นว่านี้ไปยังผู้ร้องขอโดยทางโทรสาร สื่ออิเล็กทรอนิกส์ หรือสื่อเทคโนโลยีสารสนเทศประเภทอื่น ทั้งนี้ ตามหลักเกณฑ์และวิธีการที่กำหนดในข้อบังคับของประธานศาลฎีกา"
                    },
                    {
                        "id": 4,
                        "content": "เมื่อได้มีการออกหมายตามวรรคสามแล้ว ให้ศาลดำเนินการให้ผู้ที่เกี่ยวข้องกับการขอหมายมาพบศาลเพื่อสาบานตัวโดยไม่ชักช้า โดยจดบันทึกถ้อยคำของบุคคลดังกล่าวและลงลายมือชื่อของศาลผู้ออกหมายไว้ หรือจะใช้เครื่องบันทึกเสียงก็ได้โดยจัดให้มีการถอดเสียงเป็นหนังสือและลงลายมือชื่อของศาลผู้ออกหมาย บันทึกที่มีการลงลายมือชื่อรับรองดังกล่าวแล้ว ให้เก็บไว้ในสารบบของศาล หากความปรากฏต่อศาลในภายหลังว่าได้มีการออกหมายไปโดยฝ่าฝืนต่อบทบัญญัติแห่งกฎหมาย ศาลอาจมีคำสั่งให้เพิกถอนหรือแก้ไขเปลี่ยนแปลงหมายเช่นว่านั้นได้  ทั้งนี้ ศาลจะมีคำสั่งให้ผู้ร้องขอจัดการแก้ไขเพื่อเยียวยาความเสียหายที่เกิดขึ้นแก่บุคคลที่เกี่ยวข้องตามที่เห็นสมควรก็ได้"
                    }
                ]
            }
        },
        {
            "id": "มาตรา 66",
            "title": "เหตุออกหมายจับ เมื่อมีหลักฐานว่าน่าจะกระทำความผิดอาญา",
            "content": {
                "paragraphs": [
                    {
                        "id": 1,
                        "content": "เหตุที่จะออกหมายจับได้มีดังต่อไปนี้",
                        "subsections": [
                            {
                                "id": "1",
                                "content": "เมื่อมีหลักฐานตามสมควรว่าบุคคลใดน่าจะได้กระทำความผิดอาญาซึ่งมีอัตราโทษจำคุกอย่างสูงเกินสามปี หรือ"
                            },
                            {
                                "id": "2",
                                "content": "เมื่อมีหลักฐานตามสมควรว่าบุคคลใดน่าจะได้กระทำความผิดอาญาและมีเหตุอันควรเชื่อว่าจะหลบหนี หรือจะไปยุ่งเหยิงกับพยานหลักฐาน หรือก่อเหตุอันตรายประการอื่น"
                            }
                        ]
                    },
                    {
                        "id": 2,
                        "content": "ถ้าบุคคลนั้นไม่มีที่อยู่เป็นหลักแหล่ง หรือไม่มาตามหมายเรียกหรือตามนัดโดยไม่มีข้อแก้ตัวอันควร ให้สันนิษฐานว่าบุคคลนั้นจะหลบหนี"
                    }
                ]
            }
        },
        {
            "id": "มาตรา 68",
            "title": "หมายจับใช้ได้จนกว่าจะหมดอายุความหรือศาลถอนหมาย",
            "content": {
                "paragraphs": [
                    {
                        "id": 1,
                        "content": "หมายจับคงใช้ได้อยู่จนกว่าจะจับได้ เว้นแต่ความผิดอาญาตามหมายนั้นขาดอายุความหรือศาลซึ่งออกหมายนั้นได้ถอนหมายคืน"
                    }
                ]
            }
        }
    ]
}
