{
    "criminal_code": [
        {
            "id": "มาตรา 1",
            "title": "คำนิยาม",
            "content": {
                "paragraphs": [
                    {
                        "id": 1,
                        "content": "ในประมวลกฎหมายนี้",
                        "subsections": [
                            {
                                "id": 1,
                                "content": "“โดยทุจริต” หมายความว่า  เพื่อแสวงหาประโยชน์ที่มิควรได้โดยชอบด้วยกฎหมายสำหรับตนเองหรือผู้อื่น"
                            },
                            {
                                "id": 5,
                                "content": "“อาวุธ” หมายความรวมถึงสิ่งซึ่งไม่เป็นอาวุธโดยสภาพ แต่ซึ่งได้ใช้หรือเจตนาจะใช้ประทุษร้ายร่างกายถึงอันตรายสาหัสอย่างอาวุธ"
                            },
                            {
                                "id": 7,
                                "content": "“เอกสาร” หมายความว่า  กระดาษหรือวัตถุอื่นใดซึ่งได้ทำให้ปรากฏความหมายด้วยตัวอักษร ตัวเลข ผังหรือแผนแบบอย่างอื่น จะเป็นโดยวิธีพิมพ์ถ่ายภาพหรือวิธีอื่นอันเป็นหลักฐานแห่งความหมายนั้น"
                            },
                            {
                                "id": 8,
                                "content": "“เอกสารราชการ” หมายความว่า  เอกสารซึ่งเจ้าพนักงานได้ทำขึ้นหรือรับรองในหน้าที่ และให้หมายความรวมถึงสำเนาเอกสารนั้น ๆ ที่เจ้าพนักงานได้รับรองในหน้าที่ด้วย"
                            },
                            {
                                "id": 9,
                                "content": "“เอกสารสิทธิ” หมายความว่า  เอกสารที่เป็นหลักฐานแห่งการก่อ เปลี่ยนแปลง โอน สงวนหรือระงับซึ่งสิทธิ"
                            },
                            {
                                "id": 14,
                                "content": "“บัตรอิเล็กทรอนิกส์” หมายความว่า\n\n\t (ก) เอกสารหรือวัตถุอื่นใดไม่ว่าจะมีรูปลักษณะใดที่ผู้ออกได้ออกให้แก่ผู้มีสิทธิใช้ ซึ่งจะระบุชื่อหรือไม่ก็ตาม โดยบันทึกข้อมูลหรือรหัสไว้ด้วยการประยุกต์ใช้วิธีการทางอิเล็กตรอน ไฟฟ้า คลื่นแม่เหล็กไฟฟ้า หรือวิธีอื่นใดในลักษณะคล้ายกัน ซึ่งรวมถึงการประยุกต์ใช้วิธีการทางแสงหรือวิธีการทางแม่เหล็กให้ปรากฏความหมายด้วยตัวอักษร ตัวเลข รหัส หมายเลขบัตร หรือสัญลักษณ์อื่นใด ทั้งที่สามารถมองเห็นและมองไม่เห็นด้วยตาเปล่า\n\n\t (ข) ข้อมูล รหัส หมายเลขบัญชี หมายเลขชุดทางอิเล็กทรอนิกส์หรือเครื่องมือทางตัวเลขใด ๆ ที่ผู้ออกได้ออกให้แก่ผู้มีสิทธิใช้ โดยมิได้มีการออกเอกสารหรือวัตถุอื่นใดให้ แต่มีวิธีการใช้ในทำนองเดียวกับ (ก) หรือ\n\n\t (ค) สิ่งอื่นใดที่ใช้ประกอบกับข้อมูลอิเล็กทรอนิกส์เพื่อแสดงความสัมพันธ์ระหว่างบุคคลกับข้อมูลอิเล็กทรอนิกส์ โดยมีวัตถุประสงค์เพื่อระบุตัวบุคคลผู้เป็นเจ้าของ"
                            },
                            {
                                "id": 16,
                                "content": "“เจ้าพนักงาน” หมายความว่า บุคคลซึ่งกฎหมายบัญญัติว่าเป็นเจ้าพนักงานหรือได้รับแต่งตั้งตามกฎหมายให้ปฏิบัติหน้าที่ราชการ ไม่ว่าเป็นประจำหรือครั้งคราว และไม่ว่าจะได้รับค่าตอบแทนหรือไม่"
                            },
                            {
                                "id": 18,
                                "content": "“กระทำชำเรา” หมายความว่า กระทำเพื่อสนองความใคร่ของผู้กระทำ โดยการใช้อวัยวะเพศของผู้กระทำล่วงล้ำอวัยวะเพศ ทวารหนัก หรือช่องปากของผู้อื่น"
                            }
                        ]
                    }
                ]
            }
        },
        {
            "id": "มาตรา 136",
            "title": "ดูหมิ่นเจ้าพนักงาน",
            "content": {
                "paragraphs": [
                    {
                        "id": 1,
                        "content": "ผู้ใดดูหมิ่นเจ้าพนักงานซึ่งกระทำการตามหน้าที่ หรือเพราะได้กระทำการตามหน้าที่",
                        "subsections": null
                    }
                ]
            }
        },
        {
            "id": "มาตรา 137",
            "title": "แจ้งความเท็จ",
            "content": {
                "paragraphs": [
                    {
                        "id": 1,
                        "content": "ผู้ใดแจ้งข้อความอันเป็นเท็จแก่เจ้าพนักงาน ซึ่งอาจทำให้ผู้อื่นหรือประชาชนเสียหาย",
                        "subsections": null
                    }
                ]
            }
        },
        {
            "id": "มาตรา 138",
            "title": "ต่อสู้หรือขัดขวางเจ้าพนักงาน",
            "content": {
                "paragraphs": [
                    {
                        "id": 1,
                        "content": "ผู้ใดต่อสู้ หรือขัดขวางเจ้าพนักงานหรือผู้ซึ่งต้องช่วยเจ้าพนักงานตามกฎหมายในการปฏิบัติการตามหน้าที่",
                        "subsections": null
                    },
                    {
                        "id": 2,
                        "content": "ถ้าการต่อสู้หรือขัดขวางนั้น ได้กระทำโดยใช้กำลังประทุษร้ายหรือขู่เข็ญว่าจะใช้กำลังประทุษร้าย",
                        "subsections": null
                    }
                ]
            }
        },
        {
            "id": "มาตรา 143",
            "title": "คนกลางเรียกหรือรับสินบน",
            "content": {
                "paragraphs": [
                    {
                        "id": 1,
                        "content": "ผู้ใดเรียก รับหรือยอมจะรับทรัพย์สินหรือประโยชน์อื่นใดสำหรับตนเองหรือผู้อื่น เป็นการตอบแทนในการที่จะจูงใจหรือได้จูงใจเจ้าพนักงาน สมาชิกสภานิติบัญญัติแห่งรัฐ สมาชิกสภาจังหวัดหรือสมาชิกสภาเทศบาลโดยวิธีอันทุจริตหรือผิดกฎหมายหรือโดยอิทธิพลของตนให้กระทำการ หรือไม่กระทำการในหน้าที่อันเป็นคุณหรือเป็นโทษแก่บุคคลใด",
                        "subsections": null
                    }
                ]
            }
        },
        {
            "id": "มาตรา 144",
            "title": "ให้สินบนเจ้าพนักงาน",
            "content": {
                "paragraphs": [
                    {
                        "id": 1,
                        "content": "ผู้ใดให้ ขอให้หรือรับว่าจะให้ทรัพย์สินหรือประโยชน์อื่นใดแก่เจ้าพนักงาน สมาชิกสภานิติบัญญัติแห่งรัฐ สมาชิกสภาจังหวัดหรือสมาชิกสภาเทศบาล เพื่อจูงใจให้กระทำการ ไม่กระทำการหรือประวิงการกระทำอันมิชอบด้วยหน้าที่",
                        "subsections": null
                    }
                ]
            }
        },
        {
            "id": "มาตรา 147",
            "title": "เจ้าพนักงานยักยอกทรัพย์",
            "content": {
                "paragraphs": [
                    {
                        "id": 1,
                        "content": "ผู้ใดเป็นเจ้าพนักงาน มีหน้าที่ซื้อ ทำ จัดการหรือรักษาทรัพย์ใด เบียดบังทรัพย์นั้นเป็นของตน หรือเป็นของผู้อื่นโดยทุจริต หรือโดยทุจริตยอมให้ผู้อื่นเอาทรัพย์นั้นเสีย",
                        "subsections": null
                    }
                ]
            }
        },
        {
            "id": "มาตรา 148",
            "title": "เจ้าพนักงานข่มขืนใจเพื่อทรัพย์สิน",
            "content": {
                "paragraphs": [
                    {
                        "id": 1,
                        "content": "ผู้ใดเป็นเจ้าพนักงาน ใช้อำนาจในตำแหน่งโดยมิชอบ ข่มขืนใจหรือจูงใจเพื่อให้บุคคลใดมอบให้หรือหามาให้ซึ่งทรัพย์สินหรือประโยชน์อื่นใดแก่ตนเองหรือผู้อื่น",
                        "subsections": null
                    }
                ]
            }
        },
        {
            "id": "มาตรา 149",
            "title": "เจ้าพนักงานเรียกหรือรับสินบน",
            "content": {
                "paragraphs": [
                    {
                        "id": 1,
                        "content": "ผู้ใดเป็นเจ้าพนักงานสมาชิกสภานิติบัญญัติแห่งรัฐ สมาชิกสภาจังหวัด หรือสมาชิกสภาเทศบาล เรียก รับ หรือยอมจะรับทรัพย์สิน หรือประโยชน์อื่นใดสำหรับตนเองหรือผู้อื่นโดยมิชอบ เพื่อกระทำการหรือไม่กระทำการอย่างใดในตำแหน่งไม่ว่าการนั้นจะชอบหรือมิชอบด้วยหน้าที่",
                        "subsections": null
                    }
                ]
            }
        },
        {
            "id": "มาตรา 157",
            "title": "ปฏิบัติหน้าที่หรือละเว้นการปฏิบัติหน้าที่โดยมิชอบหรือโดยทุจริต",
            "content": {
                "paragraphs": [
                    {
                        "id": 1,
                        "content": "ผู้ใดเป็นเจ้าพนักงาน ปฏิบัติหรือละเว้นการปฏิบัติหน้าที่โดยมิชอบ เพื่อให้เกิดความเสียหายแก่ผู้หนึ่งผู้ใด หรือปฏิบัติหรือละเว้นการปฏิบัติหน้าที่โดยทุจริต",
                        "subsections": null
                    }
                ]
            }
        },
        {
            "id": "มาตรา 172",
            "title": "แจ้งความเท็จเกี่ยวกับความผิดอาญา",
            "content": {
                "paragraphs": [
                    {
                        "id": 1,
                        "content": "ผู้ใดแจ้งข้อความอันเป็นเท็จเกี่ยวกับความผิดอาญา แก่พนักงานอัยการ ผู้ว่าคดี พนักงานสอบสวน หรือเจ้าพนักงานผู้มีอำนาจสืบสวนคดีอาญา ซึ่งอาจทำให้ผู้อื่นหรือประชาชนเสียหาย",
                        "subsections": null
                    }
                ]
            }
        },
        {
            "id": "มาตรา 173",
            "title": "แจ้งความเท็จว่าได้มีการกระทำความผิด",
            "content": {
                "paragraphs": [
                    {
                        "id": 1,
                        "content": "ผู้ใดรู้ว่ามิได้มีการกระทำความผิดเกิดขึ้นแจ้งข้อความแก่พนักงานสอบสวนหรือเจ้าพนักงานผู้มีอำนาจสืบสวนคดีอาญาว่า ได้มีการกระทำความผิด",
                        "subsections": null
                    }
                ]
            }
        },
        {
            "id": "มาตรา 175",
            "title": "ฟ้องเท็จ",
            "content": {
                "paragraphs": [
                    {
                        "id": 1,
                        "content": "ผู้ใดเอาความอันเป็นเท็จฟ้องผู้อื่นต่อศาลว่ากระทำความผิดอาญา หรือว่ากระทำความผิดอาญาแรงกว่าที่เป็นความจริง",
                        "subsections": null
                    }
                ]
            }
        },
        {
            "id": "มาตรา 177",
            "title": "เบิกความเท็จ",
            "content": {
                "paragraphs": [
                    {
                        "id": 1,
                        "content": "ผู้ใดเบิกความอันเป็นเท็จในการพิจารณาคดีต่อศาล ถ้าความเท็จนั้นเป็นข้อสำคัญในคดี",
                        "subsections": null
                    },
                    {
                        "id": 2,
                        "content": "ถ้าความผิดดังกล่าวในวรรคแรก ได้กระทำในการพิจารณาคดีอาญา",
                        "subsections": null
                    }
                ]
            }
        },
        {
            "id": "มาตรา 184",
            "title": "ทำลายพยานหลักฐานในการกระทำความผิด",
            "content": {
                "paragraphs": [
                    {
                        "id": 1,
                        "content": "ผู้ใดเพื่อจะช่วยผู้อื่นมิให้ต้องรับโทษหรือให้รับโทษน้อยลง ทำให้เสียหาย ทำลาย ซ่อนเร้น เอาไปเสีย หรือทำให้สูญหายหรือไร้ประโยชน์ซึ่งพยานหลักฐานในการกระทำความผิด",
                        "subsections": null
                    }
                ]
            }
        },
        {
            "id": "มาตรา 188",
            "title": "ทำให้เสียหายหรือทำลายเอกสารของผู้อื่น",
            "content": {
                "paragraphs": [
                    {
                        "id": 1,
                        "content": "ผู้ใดทำให้เสียหาย ทำลาย ซ่อนเร้น เอาไปเสีย หรือทำให้สูญหายหรือไร้ประโยชน์ ซึ่งพินัยกรรมหรือเอกสารใดของผู้อื่น ในประการที่น่าจะเกิดความเสียหายแก่ผู้อื่นหรือประชาชน",
                        "subsections": null
                    }
                ]
            }
        },
        {
            "id": "มาตรา 189",
            "title": "ช่วยผู้กระทำความผิดหรือผู้ต้องหา",
            "content": {
                "paragraphs": [
                    {
                        "id": 1,
                        "content": "ผู้ใดช่วยผู้อื่นซึ่งเป็นผู้กระทำความผิดหรือเป็นผู้ต้องหาว่ากระทำความผิด อันมิใช่ความผิดลหุโทษเพื่อไม่ให้ต้องโทษ โดยให้พำนักแก่ผู้นั้น โดยซ่อนเร้นหรือโดยช่วยผู้นั้นด้วยประการใดเพื่อไม่ให้ถูกจับกุม",
                        "subsections": null
                    }
                ]
            }
        },
        {
            "id": "มาตรา 190",
            "title": "หลบหนีจากการคุมขัง",
            "content": {
                "paragraphs": [
                    {
                        "id": 1,
                        "content": "ผู้ใดหลบหนีไประหว่างที่ถูกคุมขังตามอำนาจของศาล ของพนักงานอัยการ ของพนักงานสอบสวน หรือของเจ้าพนักงานผู้มีอำนาจสืบสวนคดีอาญา",
                        "subsections": null
                    },
                    {
                        "id": 2,
                        "content": "ถ้าความผิดดังกล่าวมาในวรรคแรกได้กระทำโดยแหกที่คุมขัง โดยใช้กำลังประทุษร้ายหรือโดยขู่เข็ญว่าจะใช้กำลังประทุษร้าย หรือโดยร่วมกระทำความผิดด้วยกันตั้งแต่สามคนขึ้นไป",
                        "subsections": null
                    },
                    {
                        "id": 3,
                        "content": "ถ้าความผิดตามมาตรานี้ได้กระทำโดยมีหรือใช้อาวุธปืนหรือวัตถุระเบิด",
                        "subsections": null
                    }
                ]
            }
        },
        {
            "id": "มาตรา 191",
            "title": "ทำให้ผู้ที่ถูกคุมขังหลุดพ้นจากการคุมขัง",
            "content": {
                "paragraphs": [
                    {
                        "id": 1,
                        "content": "ผู้ใดกระทำด้วยประการใดให้ผู้ที่ถูกคุมขังตามอำนาจของศาล ของพนักงานอัยการ ของพนักงานสอบสวน หรือของเจ้าพนักงานผู้มีอำนาจสืบสวนคดีอาญา หลุดพ้นจากการคุมขังไป",
                        "subsections": null
                    },
                    {
                        "id": 2,
                        "content": "ถ้าผู้ที่หลุดพ้นจากการคุมขังไปนั้นเป็นบุคคลที่ต้องคำพิพากษาจากศาลหนึ่งศาลใดให้ลงโทษประหารชีวิต จำคุกตลอดชีวิต หรือจำคุกตั้งแต่สิบห้าปีขึ้นไป หรือมีจำนวนตั้งแต่สามคนขึ้นไป",
                        "subsections": null
                    },
                    {
                        "id": 3,
                        "content": "ถ้าความผิดตามมาตรานี้ได้กระทำโดยใช้กำลังประทุษร้าย หรือโดยขู่เข็ญว่าจะใช้กำลังประทุษร้าย หรือโดยมีหรือใช้อาวุธปืนหรือวัตถุระเบิด ผู้กระทำต้องระวางโทษหนักกว่าโทษที่กฎหมายบัญญัติไว้ในสองวรรคก่อนกึ่งหนึ่ง",
                        "subsections": null
                    }
                ]
            }
        },
        {
            "id": "มาตรา 209",
            "title": "อั้งยี่",
            "content": {
                "paragraphs": [
                    {
                        "id": 1,
                        "content": "ผู้ใดเป็นสมาชิกของคณะบุคคลซึ่งปกปิดวิธีดำเนินการและมีความมุ่งหมายเพื่อการอันมิชอบด้วยกฎหมาย ผู้นั้นกระทำความผิดฐานเป็นอั้งยี่",
                        "subsections": null
                    },
                    {
                        "id": 2,
                        "content": "ถ้าผู้กระทำความผิดเป็นหัวหน้า ผู้จัดการหรือผู้มีตำแหน่งหน้าที่ในคณะบุคคลนั้น",
                        "subsections": null
                    }
                ]
            }
        },
        {
            "id": "มาตรา 210",
            "title": "ซ่องโจร",
            "content": {
                "paragraphs": [
                    {
                        "id": 1,
                        "content": "ผู้ใดสมคบกันตั้งแต่ห้าคนขึ้นไปเพื่อกระทำความผิดอย่างหนึ่งอย่างใดตามที่บัญญัติไว้ในภาค ๒ นี้ และความผิดนั้นมีกำหนดโทษจำคุกอย่างสูงตั้งแต่หนึ่งปีขึ้นไป ผู้นั้นกระทำความผิดฐานเป็นซ่องโจร",
                        "subsections": null
                    }
                ]
            }
        },
        {
            "id": "มาตรา 211",
            "title": "ประชุมในที่ประชุมอั้งยี่หรือซ่องโจร",
            "content": {
                "paragraphs": [
                    {
                        "id": 1,
                        "content": "ผู้ใดประชุมในที่ประชุมอั้งยี่หรือซ่องโจร ผู้นั้นกระทำความผิดฐานเป็นอั้งยี่หรือซ่องโจร เว้นแต่ผู้นั้นจะแสดงได้ว่า ได้ประชุมโดยไม่รู้ว่าเป็นการประชุมของอั้งยี่หรือซ่องโจร",
                        "subsections": null
                    }
                ]
            }
        },
        {
            "id": "มาตรา 212",
            "title": "จัดหาที่ประชุมหรือที่พำนักให้แก่อั้งยี่หรือซ่องโจร",
            "content": {
                "paragraphs": [
                    {
                        "id": 1,
                        "content": "ผู้ใด ต้องระวางโทษเช่นเดียวกับผู้กระทำความผิดฐานเป็นอั้งยี่หรือซ่องโจร",
                        "subsections": [
                            {
                                "id": 1,
                                "content": "จัดหาที่ประชุมหรือที่พำนักให้แก่อั้งยี่หรือซ่องโจร"
                            },
                            {
                                "id": 2,
                                "content": "ชักชวนบุคคลให้เข้าเป็นสมาชิกอั้งยี่หรือพรรคพวกซ่องโจร"
                            },
                            {
                                "id": 3,
                                "content": "อุปการะอั้งยี่หรือซ่องโจรโดยให้ทรัพย์หรือโดยประการอื่น หรือ"
                            },
                            {
                                "id": 4,
                                "content": "ช่วยจำหน่ายทรัพย์ที่อั้งยี่หรือซ่องโจรได้มาโดยการกระทำความผิด"
                            }
                        ]
                    }
                ]
            }
        },
        {
            "id": "มาตรา 213",
            "title": "สมาชิกอั้งยี่หรือพรรคพวกซ่องโจรคนหนึ่งคนใดได้กระทำความผิด",
            "content": {
                "paragraphs": [
                    {
                        "id": 1,
                        "content": "ถ้าสมาชิกอั้งยี่หรือพรรคพวกซ่องโจรคนหนึ่งคนใดได้กระทำความผิดตามความมุ่งหมายของอั้งยี่หรือซ่องโจรนั้น สมาชิกอั้งยี่หรือพรรคพวกซ่องโจรที่อยู่ด้วยในขณะกระทำความผิด หรืออยู่ด้วยในที่ประชุมแต่ไม่ได้คัดค้านในการตกลงให้กระทำความผิดนั้น และบรรดาหัวหน้า ผู้จัดการหรือผู้มีตำแหน่งหน้าที่ในอั้งยี่หรือซ่องโจรนั้น ต้องระวางโทษตามที่บัญญัติไว้สำหรับความผิดนั้นทุกคน",
                        "subsections": null
                    }
                ]
            }
        },
        {
            "id": "มาตรา 214",
            "title": "เลิกอั้งยี่หรือซ่องโจร",
            "content": {
                "paragraphs": [
                    {
                        "id": 1,
                        "content": "ถ้าอั้งยี่หรือซ่องโจรได้เลิกกิจการไปแล้ว ผู้ใดเป็นหัวหน้า ผู้จัดการ หรือผู้มีตำแหน่งหน้าที่ในอั้งยี่หรือซ่องโจรนั้น ต้องระวางโทษจำคุกไม่เกินห้าปี",
                        "subsections": null
                    }
                ]
            }
        },
        {
            "id": "มาตรา 215",
            "title": "มั่วสุมกันเพื่อก่อความวุ่นวายขึ้นในบ้านเมือง",
            "content": {
                "paragraphs": [
                    {
                        "id": 1,
                        "content": "ผู้ใดมั่วสุมกันตั้งแต่สิบคนขึ้นไป ใช้กำลังประทุษร้ายขู่เข็ญว่าจะใช้กำลังประทุษร้าย หรือกระทำการอย่างหนึ่งอย่างใดให้เกิดการวุ่นวายขึ้นในบ้านเมือง",
                        "subsections": null
                    },
                    {
                        "id": 2,
                        "content": "ถ้าผู้กระทำความผิดคนหนึ่งคนใดมีอาวุธ",
                        "subsections": null
                    }
                ]
            }
        },
        {
            "id": "มาตรา 216",
            "title": "สั่งผู้ที่มั่วสุมให้เลิกไป แต่ไม่เลิก",
            "content": {
                "paragraphs": [
                    {
                        "id": 1,
                        "content": "เมื่อเจ้าพนักงานสั่งผู้ที่มั่วสุมเพื่อกระทำความผิดตามมาตรา ๒๑๕ ให้เลิกไป ผู้ใดไม่เลิก",
                        "subsections": null
                    }
                ]
            }
        },
        {
            "id": "มาตรา 217",
            "title": "วางเพลิงเผาทรัพย์",
            "content": {
                "paragraphs": [
                    {
                        "id": 1,
                        "content": "ผู้ใดวางเพลิงเผาทรัพย์ของผู้อื่น",
                        "subsections": null
                    }
                ]
            }
        },
        {
            "id": "มาตรา 218",
            "title": "วางเพลิงเผาทรัพย์ที่สำคัญ",
            "content": {
                "paragraphs": [
                    {
                        "id": 1,
                        "content": "ผู้ใดวางเพลิงเผาทรัพย์ดังต่อไปนี้",
                        "subsections": [
                            {
                                "id": 1,
                                "content": "โรงเรือน เรือ หรือแพที่คนอยู่อาศัย"
                            },
                            {
                                "id": 2,
                                "content": "โรงเรือน เรือหรือแพอันเป็นที่เก็บหรือที่ทำสินค้า"
                            },
                            {
                                "id": 3,
                                "content": "โรงมหรสพหรือสถานที่ประชุม"
                            },
                            {
                                "id": 4,
                                "content": "โรงเรือนอันเป็นสาธารณสมบัติของแผ่นดิน เป็นสาธารณสถาน หรือเป็นที่สำหรับประกอบพิธีกรรมตามศาสนา"
                            },
                            {
                                "id": 5,
                                "content": "สถานีรถไฟ ท่าอากาศยานหรือที่จอดรถหรือเรือสาธารณะ"
                            },
                            {
                                "id": 6,
                                "content": "เรือกลไฟ หรือเรือยนต์ อันมีระวางตั้งแต่ห้าตันขึ้นไป อากาศยาน หรือรถไฟที่ใช้ในการขนส่งสาธารณะ"
                            }
                        ]
                    }
                ]
            }
        },
        {
            "id": "มาตรา 219",
            "title": "การตระเตรียมวางเพลิงเผาทรัพย์ = พยายาม",
            "content": {
                "paragraphs": [
                    {
                        "id": 1,
                        "content": "ผู้ใดตระเตรียมเพื่อกระทำความผิดดังกล่าวในมาตรา ๒๑๗ หรือมาตรา ๒๑๘ ต้องระวางโทษเช่นเดียวกับพยายามกระทำความผิดนั้น ๆ",
                        "subsections": null
                    }
                ]
            }
        },
        {
            "id": "มาตรา 220",
            "title": "ทำให้เกิดเพลิงไหม้จนน่าจะเป็นอันตรายแก่บุคคลอื่น",
            "content": {
                "paragraphs": [
                    {
                        "id": 1,
                        "content": "ผู้ใดกระทำให้เกิดเพลิงไหม้แก่วัตถุใด ๆ แม้เป็นของตนเอง จนน่าจะเป็นอันตรายแก่บุคคลอื่นหรือทรัพย์ของผู้อื่น",
                        "subsections": null
                    }
                ]
            }
        },
        {
            "id": "มาตรา 223",
            "title": "ทำให้เกิดเพลิงไหม้ หรือระเบิดแก่ทรัพย์ราคาน้อย",
            "content": {
                "paragraphs": [
                    {
                        "id": 1,
                        "content": "ความผิดดังกล่าวในมาตรา ๒๑๗ มาตรา ๒๑๘ มาตรา ๒๒๐ มาตรา ๒๒๑ หรือมาตรา ๒๒๒ นั้น ถ้าทรัพย์ที่เป็นอันตราย หรือที่น่าจะเป็นอันตราย เป็นทรัพย์ที่มีราคาน้อย และการกระทำนั้นไม่น่าจะเป็นอันตรายแก่บุคคลอื่น",
                        "subsections": null
                    }
                ]
            }
        },
        {
            "id": "มาตรา 225",
            "title": "กระทำให้เกิดเพลิงไหม้โดยประมาท",
            "content": {
                "paragraphs": [
                    {
                        "id": 1,
                        "content": "ผู้ใดกระทำให้เกิดเพลิงไหม้โดยประมาท และเป็นเหตุให้ทรัพย์ของผู้อื่นเสียหาย หรือการกระทำโดยประมาทนั้นน่าจะเป็นอันตรายแก่ชีวิตของบุคคลอื่น",
                        "subsections": null
                    }
                ]
            }
        },
        {
            "id": "มาตรา 240",
            "title": "ปลอมเงินตรา",
            "content": {
                "paragraphs": [
                    {
                        "id": 1,
                        "content": "ผู้ใดทำปลอมขึ้นซึ่งเงินตรา ไม่ว่าจะปลอมขึ้นเพื่อให้เป็นเหรียญกษาปณ์ ธนบัตรหรือสิ่งอื่นใดซึ่งรัฐบาลออกใช้หรือให้อำนาจให้ออกใช้ หรือทำปลอมขึ้นซึ่งพันธบัตรรัฐบาลหรือใบสำคัญสำหรับรับดอกเบี้ยพันธบัตรนั้น ๆ ผู้นั้นกระทำความผิดฐานปลอมเงินตรา",
                        "subsections": null
                    }
                ]
            }
        },
        {
            "id": "มาตรา 241",
            "title": "แปลงเงินตรา",
            "content": {
                "paragraphs": [
                    {
                        "id": 1,
                        "content": "ผู้ใดแปลงเงินตรา ไม่ว่าจะเป็นเหรียญกษาปณ์ ธนบัตรหรือสิ่งอื่นใดซึ่งรัฐบาลออกใช้หรือให้อำนาจให้ออกใช้ หรือแปลงพันธบัตรรัฐบาลหรือใบสำคัญสำหรับรับดอกเบี้ยพันธบัตรนั้น ๆ ให้ผิดไปจากเดิม เพื่อให้ผู้อื่นเชื่อว่ามีมูลค่าสูงกว่าจริง ผู้นั้นกระทำความผิดฐานแปลงเงินตรา",
                        "subsections": null
                    }
                ]
            }
        },
        {
            "id": "มาตรา 244",
            "title": "ผู้ใดมีไว้เพื่อนำออกใช้ซึ่งเงินปลอมหรือเงินแปลง",
            "content": {
                "paragraphs": [
                    {
                        "id": 1,
                        "content": "ผู้ใดมีไว้เพื่อนำออกใช้ซึ่งสิ่งใด ๆ อันตนได้มาโดยรู้ว่าเป็นของปลอมตามมาตรา ๒๔๐ หรือของแปลงตามมาตรา ๒๔๑",
                        "subsections": null
                    }
                ]
            }
        },
        {
            "id": "มาตรา 245",
            "title": "ใช้เงินปลอมหรือเงินแปลง",
            "content": {
                "paragraphs": [
                    {
                        "id": 1,
                        "content": "ผู้ใดได้มาซึ่งสิ่งใด ๆ โดยไม่รู้ว่าเป็นของปลอมตามมาตรา ๒๔๐ หรือของแปลงตามมาตรา ๒๔๑ ถ้าต่อมารู้ว่าเป็นของปลอมหรือของแปลงเช่นว่านั้น ยังขืนนำออกใช้",
                        "subsections": null
                    }
                ]
            }
        },
        {
            "id": "มาตรา 246",
            "title": "ทำหรือมีเครื่องมือหรือวัตถุสำหรับปลอมแปลงเงินตรา",
            "content": {
                "paragraphs": [
                    {
                        "id": 1,
                        "content": "ผู้ใดทำเครื่องมือหรือวัตถุสำหรับปลอมหรือแปลงเงินตรา ไม่ว่าจะเป็นเหรียญกษาปณ์ ธนบัตรหรือสิ่งใด ๆ ซึ่งรัฐบาลออกใช้หรือให้อำนาจให้ออกใช้ หรือสำหรับปลอมหรือแปลงพันธบัตรรัฐบาลหรือใบสำคัญสำหรับรับดอกเบี้ยพันธบัตรนั้น ๆ หรือมีเครื่องมือหรือวัตถุเช่นว่านั้นเพื่อใช้ในการปลอมหรือแปลง",
                        "subsections": null
                    }
                ]
            }
        },
        {
            "id": "มาตรา 264",
            "title": "ปลอมเอกสาร",
            "content": {
                "paragraphs": [
                    {
                        "id": 1,
                        "content": "ผู้ใดทำเอกสารปลอมขึ้นทั้งฉบับหรือแต่ส่วนหนึ่งส่วนใด เติมหรือตัดทอนข้อความ หรือแก้ไขด้วยประการใด ๆ ในเอกสารที่แท้จริง หรือประทับตราปลอม หรือลงลายมือชื่อปลอมในเอกสาร โดยประการที่น่าจะเกิดความเสียหายแก่ผู้อื่นหรือประชาชน ถ้าได้กระทำเพื่อให้ผู้หนึ่งผู้ใดหลงเชื่อว่าเป็นเอกสารที่แท้จริง ผู้นั้นกระทำความผิดฐานปลอมเอกสาร",
                        "subsections": null
                    },
                    {
                        "id": 2,
                        "content": "ผู้ใดกรอกข้อความลงในแผ่นกระดาษหรือวัตถุอื่นใดซึ่งมีลายมือชื่อของผู้อื่นโดยไม่ได้รับความยินยอม หรือโดยฝ่าฝืนคำสั่งของผู้อื่นนั้น ถ้าได้กระทำเพื่อนำเอาเอกสารนั้นไปใช้ในกิจการที่อาจเกิดเสียหายแก่ผู้หนึ่งผู้ใดหรือประชาชน ให้ถือว่าผู้นั้นปลอมเอกสาร ต้องระวางโทษเช่นเดียวกัน",
                        "subsections": null
                    }
                ]
            }
        },
        {
            "id": "มาตรา 265",
            "title": "ปลอมเอกสารสิทธิหรือเอกสารราชการ",
            "content": {
                "paragraphs": [
                    {
                        "id": 1,
                        "content": "ผู้ใดปลอมเอกสารสิทธิหรือเอกสารราชการ",
                        "subsections": null
                    }
                ]
            }
        },
        {
            "id": "มาตรา 268",
            "title": "ใช้เอกสารปลอม",
            "content": {
                "paragraphs": [
                    {
                        "id": 1,
                        "content": "ผู้ใดใช้หรืออ้างเอกสารอันเกิดจากการกระทำความผิดตามมาตรา ๒๖๔ มาตรา ๒๖๕ มาตรา ๒๖๖ หรือมาตรา ๒๖๗ ในประการที่น่าจะเกิดความเสียหายแก่ผู้อื่นหรือประชาชน ต้องระวางโทษดังที่บัญญัติไว้ในมาตรานั้น ๆ",
                        "subsections": null
                    },
                    {
                        "id": 2,
                        "content": "ถ้าผู้กระทำความผิดตามวรรคแรกเป็นผู้ปลอมเอกสารนั้น หรือเป็นผู้แจ้งให้เจ้าพนักงานจดข้อความนั้นเองให้ลงโทษตามมาตรานี้แต่กระทงเดียว",
                        "subsections": null
                    }
                ]
            }
        },
        {
            "id": "มาตรา 269/1",
            "title": "ปลอมบัตรอิเล็กทรอนิกส์",
            "content": {
                "paragraphs": [
                    {
                        "id": 1,
                        "content": "ผู้ใดทำบัตรอิเล็กทรอนิกส์ปลอมขึ้นทั้งฉบับหรือแต่ส่วนหนึ่งส่วนใด เติมหรือตัดทอนข้อความ หรือแก้ไขด้วยประการใด ๆ ในบัตรอิเล็กทรอนิกส์ที่แท้จริง โดยประการที่น่าจะเกิดความเสียหายแก่ผู้อื่นหรือประชาชน ถ้าได้กระทำเพื่อให้ผู้หนึ่งผู้ใดหลงเชื่อว่าเป็นบัตรอิเล็กทรอนิกส์ที่แท้จริงหรือเพื่อใช้ประโยชน์อย่างหนึ่งอย่างใด ผู้นั้นกระทำความผิดฐานปลอมบัตรอิเล็กทรอนิกส์",
                        "subsections": null
                    }
                ]
            }
        },
        {
            "id": "มาตรา 276",
            "title": "ข่มขืนกระทำชำเรา",
            "content": {
                "paragraphs": [
                    {
                        "id": 1,
                        "content": "ผู้ใดข่มขืนกระทำชำเราผู้อื่นโดยขู่เข็ญด้วยประการใด ๆ โดยใช้กำลังประทุษร้าย โดยผู้อื่นนั้นอยู่ในภาวะที่ไม่สามารถขัดขืนได้ หรือโดยทำให้ผู้อื่นนั้นเข้าใจผิดว่าตนเป็นบุคคลอื่น",
                        "subsections": null
                    },
                    {
                        "id": 2,
                        "content": "ถ้าการกระทำความผิดตามวรรคหนึ่ง ได้กระทำโดยทำให้ผู้ถูกกระทำเข้าใจว่าผู้กระทำมีอาวุธปืนหรือวัตถุระเบิด",
                        "subsections": null
                    },
                    {
                        "id": 3,
                        "content": "ถ้าการกระทำความผิดตามวรรคหนึ่ง ได้กระทำโดยร่วมกระทำความผิดด้วยกันตั้งแต่สามคนขึ้นไป",
                        "subsections": null
                    },
                    {
                        "id": 4,
                        "content": "ถ้าการกระทำความผิดตามวรรคหนึ่ง ได้กระทำโดยมีอาวุธปืนหรือวัตถุระเบิด หรือโดยใช้อาวุธ หรือโดยร่วมกระทำความผิดด้วยกันอันมีลักษณะเป็นการโทรมหญิงหรือกระทำกับชายในลักษณะเดียวกัน",
                        "subsections": null
                    }
                ]
            }
        },
        {
            "id": "มาตรา 277",
            "title": "กระทำชำเราเด็กอายุยังไม่เกิน 15 ปี หรืออายุยังไม่เกิน 13 ปี",
            "content": {
                "paragraphs": [
                    {
                        "id": 1,
                        "content": "ผู้ใดกระทำชำเราเด็กอายุยังไม่เกินสิบห้าปีซึ่งมิใช่ภริยาหรือสามีของตน โดยเด็กนั้นจะยินยอมหรือไม่ก็ตาม",
                        "subsections": null
                    },
                    {
                        "id": 2,
                        "content": "ถ้าการกระทำความผิดตามวรรคหนึ่ง เป็นการกระทำแก่เด็กอายุยังไม่เกินสิบสามปี",
                        "subsections": null
                    },
                    {
                        "id": 3,
                        "content": "ถ้าการกระทำความผิดตามวรรคหนึ่งหรือวรรคสอง ได้กระทำโดยทำให้ผู้ถูกกระทำเข้าใจว่าผู้กระทำมีอาวุธปืนหรือวัตถุระเบิด",
                        "subsections": null
                    },
                    {
                        "id": 4,
                        "content": "ถ้าการกระทำความผิดตามวรรคหนึ่งหรือวรรคสอง ได้กระทำโดยมีอาวุธปืนหรือวัตถุระเบิด หรือโดยใช้อาวุธ หรือโดยร่วมกระทำความผิดด้วยกันอันมีลักษณะเป็นการโทรมเด็กหญิงหรือกระทำกับเด็กชายในลักษณะเดียวกัน",
                        "subsections": null
                    }
                ]
            }
        },
        {
            "id": "มาตรา 285/1",
            "title": "อ้างความไม่รู้อายุเด็กเพื่อให้พ้นจากความผิดไม่ได้",
            "content": {
                "paragraphs": [
                    {
                        "id": 1,
                        "content": "การกระทำความผิดตามมาตรา ๒๗๗ มาตรา ๒๗๙ มาตรา ๒๘๒ วรรคสาม มาตรา ๒๘๓ วรรคสาม และมาตรา ๒๘๓ ทวิ วรรคสอง หากเป็นการกระทำต่อเด็กอายุไม่เกินสิบสามปี ห้ามอ้างความไม่รู้อายุของเด็กเพื่อให้พ้นจากความผิดนั้น",
                        "subsections": null
                    }
                ]
            }
        }
    ]
}
