{
    "criminal_procedure_code": [
        {
            "id": "มาตรา 1",
            "title": "คำนิยาม 1",
            "content": {
                "paragraphs": [
                    {
                        "id": 1,
                        "content": "ในประมวลกฎหมายนี้",
                        "subsections": [
                        ]
                    }
                ]
            }
        },
        {
            "id": "มาตรา 2",
            "title": "คำนิยาม 2",
            "content": {
                "paragraphs": [
                    {
                        "id": 1,
                        "content": "ในประมวลกฎหมายนี้",
                        "subsections": [
                            {
                                "id": "2",
                                "content": "“ผู้ต้องหา” หมายความถึงบุคคลผู้ถูกหาว่าได้กระทำความผิด แต่ยังมิได้ถูกฟ้องต่อศาล"
                            },
                            {
                                "id": "3",
                                "content": "“จำเลย” หมายความถึงบุคคลผู้ถูกฟ้องต่อศาลว่าได้กระทำความผิด"
                            },
                            {
                                "id": "4",
                                "content": "“ผู้เสียหาย” หมายความถึงบุคคลผู้ได้รับความเสียหายเนื่องจากการกระทำผิดฐานใดฐานหนึ่ง รวมทั้งบุคคลอื่นที่มีอำนาจจัดการแทนได้ ดังบัญญัติไว้ในมาตรา ๔, ๕ และ ๖"
                            },
                            {
                                "id": "7",
                                "content": "“คำร้องทุกข์” หมายความถึงการที่ผู้เสียหายได้กล่าวหาต่อเจ้าหน้าที่ตามบทบัญญัติแห่งประมวลกฎหมายนี้ว่ามีผู้กระทำความผิดขึ้น จะรู้ตัวผู้กระทำความผิดหรือไม่ก็ตาม ซึ่งกระทำให้เกิดความเสียหายแก่ผู้เสียหาย และการกล่าวหาเช่นนั้นได้กล่าวโดยมีเจตนาจะให้ผู้กระทำความผิดได้รับโทษ"
                            },
                            {
                                "id": "9",
                                "content": "“หมายอาญา” หมายความถึงหนังสือบงการที่ออกตามบทบัญญัติแห่งประมวลกฎหมายนี้สั่งให้เจ้าหน้าที่ทำการจับ ขัง จำคุก หรือปล่อยผู้ต้องหา จำเลย หรือนักโทษหรือให้ทำการค้น รวมทั้งสำเนาหมายจับหรือหมายค้นอันได้รับรองว่าถูกต้อง และคำบอกกล่าวทางโทรเลขว่าได้ออกหมายจับหรือหมายค้นแล้ว ตลอดจนสำเนาหมายจับหรือหมายค้นที่ได้ส่งทางโทรสาร สื่ออิเล็กทรอนิกส์ หรือสื่อเทคโนโลยีสารสนเทศประเภทอื่น  ทั้งนี้ ตามที่บัญญัติไว้ในมาตรา ๗๗"
                            },
                            {
                                "id": "16",
                                "content": "“พนักงานฝ่ายปกครองหรือตำรวจ” หมายความถึงเจ้าพนักงานซึ่งกฎหมายให้มีอำนาจและหน้าที่รักษาความสงบเรียบร้อยของประชาชน ให้รวมทั้งพัศดี เจ้าพนักงานกรมสรรพสามิต กรมศุลกากร กรมเจ้าท่า พนักงานตรวจคนเข้าเมือง และเจ้าพนักงานอื่น ๆ ในเมื่อทำการอันเกี่ยวกับการจับกุมปราบปรามผู้กระทำผิดกฎหมายซึ่งตนมีหน้าที่ต้องจับกุมหรือปราบปราม"
                            }
                        ]
                    }
                ]
            }
        },
        {
            "id": "มาตรา 3",
            "title": "อำนาจจัดการแทนผู้เสียหาย",
            "content": {
                "paragraphs": [
                    {
                        "id": 1,
                        "content": "บุคคลดังระบุในมาตรา ๔, ๕ และ ๖ มีอำนาจจัดการต่อไปนี้แทนผู้เสียหายตามเงื่อนไขที่บัญญัติไว้ในมาตรานั้น ๆ",
                        "subsections": [
                            {
                                "id": "2",
                                "content": "เป็นโจทก์ฟ้องคดีแพ่งที่เกี่ยวเนื่องกับคดีอาญา"
                            }
                        ]
                    }
                ]
            }
        },
        {
            "id": "มาตรา 5",
            "title": "บุคคลจัดการแทนผู้เสียหาย",
            "content": {
                "paragraphs": [
                    {
                        "id": 1,
                        "content": "บุคคลเหล่านี้จัดการแทนผู้เสียหายได้",
                        "subsections": [
                            {
                                "id": "1",
                                "content": "ผู้แทนโดยชอบธรรมหรือผู้อนุบาล เฉพาะแต่ในความผิดซึ่งได้กระทำต่อผู้เยาว์ หรือผู้ไร้ความสามารถซึ่งอยู่ในความดูแล"
                            },
                            {
                                "id": "2",
                                "content": "ผู้บุพการี ผู้สืบสันดาน สามีหรือภริยาเฉพาะแต่ในความผิดอาญา ซึ่งผู้เสียหายถูกทำร้ายถึงตายหรือบาดเจ็บจนไม่สามารถจะจัดการเองได้"
                            },
                            {
                                "id": "3",
                                "content": "ผู้จัดการหรือผู้แทนอื่น ๆ ของนิติบุคคล เฉพาะความผิดซึ่งกระทำลงแก่นิติบุคคลนั้น"
                            }
                        ]
                    }
                ]
            }
        },
        {
            "id": "มาตรา 15",
            "title": "ฟ้องซ้อน ให้ใช้ประมวลกฎหมายวิธีพิจารณาความแพ่ง",
            "content": {
                "paragraphs": [
                    {
                        "id": 1,
                        "content": "วิธีพิจารณาข้อใดซึ่งประมวลกฎหมายนี้มิได้บัญญัติไว้โดยเฉพาะ ให้นำบทบัญญัติแห่งประมวลกฎหมายวิธีพิจารณาความแพ่งมาใช้บังคับเท่าที่พอจะใช้บังคับได้",
                        "subsections": null
                    }
                ]
            }
        },
        {
            "id": "มาตรา 18",
            "title": "พื้นที่อำนาจสอบสวน",
            "content": {
                "paragraphs": [
                    {
                        "id": 1,
                        "content": "ในจังหวัดอื่นนอกจากจังหวัดพระนครและจังหวัดธนบุรี พนักงานฝ่ายปกครองหรือตำรวจชั้นผู้ใหญ่ ปลัดอำเภอ และข้าราชการตำรวจซึ่งมียศตั้งแต่นายร้อยตำรวจตรีหรือเทียบเท่านายร้อยตำรวจตรีขึ้นไป มีอำนาจสอบสวนความผิดอาญาซึ่งได้เกิด หรืออ้าง หรือเชื่อว่าได้เกิดภายในเขตอำนาจของตน หรือผู้ต้องหามีที่อยู่ หรือถูกจับภายในเขตอำนาจของตนได้"
                    },
                    {
                        "id": 2,
                        "content": "สำหรับในจังหวัดพระนครและจังหวัดธนบุรี ให้ข้าราชการตำรวจซึ่งมียศตั้งแต่ชั้นนายร้อยตำรวจตรีหรือเทียบเท่านายร้อยตำรวจตรีขึ้นไป มีอำนาจสอบสวนความผิดอาญาซึ่งได้เกิด หรืออ้าง หรือเชื่อว่าได้เกิดภายในเขตอำนาจของตน หรือผู้ต้องหามีที่อยู่ หรือถูกจับภายในเขตอำนาจของตนได้"
                    },
                    {
                        "id": 3,
                        "content": "ภายใต้บังคับแห่งบทบัญญัติในมาตรา ๑๙ มาตรา ๒๐ และมาตรา ๒๑ ความผิดอาญาได้เกิดในเขตอำนาจพนักงานสอบสวนคนใด โดยปกติให้เป็นหน้าที่พนักงานสอบสวนผู้นั้นเป็นผู้รับผิดชอบในการสอบสวนผิดนั้น ๆ เพื่อดำเนินคดี เว้นแต่เมื่อมีเหตุจำเป็นหรือเพื่อความสะดวก จึงให้พนักงานสอบสวนแห่งท้องที่ที่ผู้ต้องหามีที่อยู่ หรือถูกจับเป็นผู้รับผิดชอบดำเนินการสอบสวน"
                    },
                    {
                        "id": 4,
                        "content": "ในเขตท้องที่ใดมีพนักงานสอบสวนหลายคน การดำเนินการสอบสวนให้อยู่ในความรับผิดชอบของพนักงานสอบสวนผู้เป็นหัวหน้าในท้องที่นั้น หรือผู้รักษาการแทน"
                    }
                ]
            }
        },
        {
            "id": "มาตรา 19",
            "title": "อำนาจสอบสวนความผิดที่เกี่ยวพันหลายท้องที่",
            "content": {
                "paragraphs": [
                    {
                        "id": 1,
                        "content": "ในกรณีดังต่อไปนี้ พนักงานสอบสวนในท้องที่หนึ่งท้องที่ใดที่เกี่ยวข้องมีอำนาจสอบสวนได้",
                        "subsections": [
                            {
                                "id": "1",
                                "content": "เป็นการไม่แน่ว่าการกระทำผิดอาญาได้กระทำในท้องที่ใดในระหว่างหลายท้องที่"
                            },
                            {
                                "id": "2",
                                "content": "เมื่อความผิดส่วนหนึ่งกระทำในท้องที่หนึ่ง แต่อีกส่วนหนึ่งในอีกท้องที่หนึ่ง"
                            },
                            {
                                "id": "3",
                                "content": "เมื่อความผิดนั้นเป็นความผิดต่อเนื่องและกระทำต่อเนื่องกันในท้องที่ต่าง ๆ เกินกว่าท้องที่หนึ่งขึ้นไป"
                            },
                            {
                                "id": "4",
                                "content": "เมื่อเป็นความผิดซึ่งมีหลายกรรม กระทำลงในท้องที่ต่าง ๆ กัน"
                            },
                            {
                                "id": "5",
                                "content": "เมื่อความผิดเกิดขึ้นขณะผู้ต้องหากำลังเดินทาง"
                            },
                            {
                                "id": "6",
                                "content": "เมื่อความผิดเกิดขึ้นขณะผู้เสียหายกำลังเดินทาง"
                            }
                        ]
                    },
                    {
                        "id": 2,
                        "content": "ในกรณีข้างต้นพนักงานสอบสวนต่อไปนี้ เป็นผู้รับผิดชอบในการสอบสวน",
                        "subsections": [
                            {
                                "id": "ก",
                                "content": "ถ้าจับผู้ต้องหาได้แล้ว คือพนักงานสอบสวนซึ่งท้องที่ที่จับได้อยู่ในเขตอำนาจ"
                            },
                            {
                                "id": "ข",
                                "content": "ถ้าจับผู้ต้องหายังไม่ได้ คือพนักงานสอบสวนซึ่งท้องที่ที่พบการกระทำผิดก่อนอยู่ในเขตอำนาจ"
                            }
                        ]
                    }
                ]
            }
        },
        {
            "id": "มาตรา 20",
            "title": "พนักงานสอบสวนผู้รับผิดชอบกรณีความผิดนอกราชอาณาจักร",
            "content": {
                "paragraphs": [
                    {
                        "id": 1,
                        "content": "ถ้าความผิดซึ่งมีโทษตามกฎหมายไทยได้กระทำลงนอกราชอาณาจักรไทยให้อัยการสูงสุดหรือผู้รักษาการแทนเป็นพนักงานสอบสวนผู้รับผิดชอบหรือจะมอบหมายหน้าที่นั้นให้พนักงานอัยการหรือพนักงานสอบสวนคนใดเป็นผู้รับผิดชอบทำการสอบสวนแทนก็ได้",
                        "subsections": null
                    },
                    {
                        "id": 2,
                        "content": "ในกรณีที่อัยการสูงสุดหรือผู้รักษาการแทนมอบหมายให้พนักงานสอบสวนคนใดเป็นผู้รับผิดชอบทำการสอบสวน อัยการสูงสุดหรือผู้รักษาการแทนจะมอบหมายให้พนักงานอัยการคนใดทำการสอบสวนร่วมกับพนักงานสอบสวนก็ได้",
                        "subsections": null
                    },
                    {
                        "id": 3,
                        "content": "ให้พนักงานอัยการที่ได้รับมอบหมายให้เป็นพนักงานสอบสวนผู้รับผิดชอบหรือให้ทำการสอบสวนร่วมกับพนักงานสอบสวนมีอำนาจและหน้าที่ในการสอบสวนเช่นเดียวกับพนักงานสอบสวนบรรดาอำนาจและหน้าที่ประการอื่นที่กฎหมายบัญญัติไว้ให้เป็นอำนาจและหน้าที่ของพนักงานอัยการ",
                        "subsections": null
                    },
                    {
                        "id": 4,
                        "content": "ในกรณีที่พนักงานอัยการทำการสอบสวนร่วมกับพนักงานสอบสวน ให้พนักงานสอบสวนปฏิบัติตามคำสั่งและคำแนะนำของพนักงานอัยการในเรื่องที่เกี่ยวกับการรวบรวมพยานหลักฐาน",
                        "subsections": null
                    },
                    {
                        "id": 5,
                        "content": "ในกรณีจำเป็น พนักงานสอบสวนต่อไปนี้มีอำนาจสอบสวนในระหว่างรอคำสั่งจากอัยการสูงสุดหรือผู้รักษาการแทน",
                        "subsections": [
                            {
                                "id": "1",
                                "content": "พนักงานสอบสวนซึ่งผู้ต้องหาถูกจับในเขตอำนาจ"
                            },
                            {
                                "id": "2",
                                "content": "พนักงานสอบสวนซึ่งรัฐบาลประเทศอื่นหรือบุคคลที่ได้รับความเสียหายได้ร้องฟ้องให้ทำโทษผู้ต้องหา"
                            }
                        ]
                    },
                    {
                        "id": 6,
                        "content": "เมื่อพนักงานอัยการหรือพนักงานสอบสวนผู้รับผิดชอบในการสอบสวนแล้วแต่กรณี เห็นว่าการสอบสวนเสร็จแล้ว ให้ทำความเห็นตามมาตรา ๑๔๐ มาตรา ๑๔๑ หรือมาตรา ๑๔๒ ส่งพร้อมสำนวนไปยังอัยการสูงสุดหรือผู้รักษาการแทน",
                        "subsections": null
                    }
                ]
            }
        },
        {
            "id": "มาตรา 28",
            "title": "ผู้มีอำนาจฟ้องคดีอาญาต่อศาล",
            "content": {
                "paragraphs": [
                    {
                        "id": 1,
                        "content": "บุคคลเหล่านี้มีอำนาจฟ้องคดีอาญาต่อศาล",
                        "subsections": [
                            {
                                "id": "1",
                                "content": "พนักงานอัยการ"
                            },
                            {
                                "id": "2",
                                "content": "ผู้เสียหาย"
                            }
                        ]
                    }
                ]
            }
        },
        {
            "id": "มาตรา 30",
            "title": "ผู้เสียหายยื่นคำร้องขอเข้าร่วมเป็นโจทก์ได้",
            "content": {
                "paragraphs": [
                    {
                        "id": 1,
                        "content": "คดีอาญาใดซึ่งพนักงานอัยการยื่นฟ้องต่อศาลแล้ว ผู้เสียหายจะยื่นคำร้องขอเข้าร่วมเป็นโจทก์ในระยะใดระหว่างพิจารณาก่อนศาลชั้นต้นพิพากษาคดีนั้นก็ได้"
                    }
                ]
            }
        },
        {
            "id": "มาตรา 36",
            "title": "คดีซึ่งได้ถอนฟ้องไปแล้ว จะนำมาฟ้องอีกหาได้ไม่",
            "content": {
                "paragraphs": [
                    {
                        "id": 1,
                        "content": "คดีอาญาซึ่งได้ถอนฟ้องไปจากศาลแล้ว จะนำมาฟ้องอีกหาได้ไม่ เว้นแต่จะเข้าอยู่ในข้อยกเว้นต่อไปนี้",
                        "subsections": [
                            {
                                "id": "1",
                                "content": "ถ้าพนักงานอัยการได้ยื่นฟ้องคดีอาญาซึ่งไม่ใช่ความผิดต่อส่วนตัวไว้แล้วได้ถอนฟ้องคดีนั้นไป การถอนนี้ไม่ตัดสิทธิผู้เสียหายที่จะยื่นฟ้องคดีนั้นใหม่"
                            },
                            {
                                "id": "2",
                                "content": "ถ้าพนักงานอัยการถอนคดีซึ่งเป็นความผิดต่อส่วนตัวไป โดยมิได้รับความยินยอมเป็นหนังสือจากผู้เสียหาย การถอนนั้นไม่ตัดสิทธิผู้เสียหายที่จะยื่นฟ้องคดีนั้นใหม่"
                            },
                            {
                                "id": "3",
                                "content": "ถ้าผู้เสียหายได้ยื่นฟ้องคดีอาญาไว้แล้วได้ถอนฟ้องคดีนั้นเสีย การถอนนี้ไม่ตัดสิทธิพนักงานอัยการที่จะยื่นฟ้องคดีนั้นใหม่ เว้นแต่คดีซึ่งเป็นความผิดต่อส่วนตัว"
                            }
                        ]
                    }
                ]
            }
        },
        {
            "id": "มาตรา 39",
            "title": "การระงับสิทธินำคดีอาญามาฟ้อง",
            "content": {
                "paragraphs": [
                    {
                        "id": 1,
                        "content": "สิทธินำคดีอาญามาฟ้องย่อมระงับไปดังต่อไปนี้",
                        "subsections": [
                            {
                                "id": "1",
                                "content": "โดยความตายของผู้กระทำผิด"
                            },
                            {
                                "id": "2",
                                "content": "ในคดีความผิดต่อส่วนตัว เมื่อได้ถอนคำร้องทุกข์ ถอนฟ้องหรือยอมความกันโดยถูกต้องตามกฎหมาย"
                            },
                            {
                                "id": "3",
                                "content": "เมื่อคดีเลิกกันตามมาตรา ๓๗"
                            },
                            {
                                "id": "4",
                                "content": "เมื่อมีคำพิพากษาเสร็จเด็ดขาดในความผิดซึ่งได้ฟ้อง"
                            },
                            {
                                "id": "5",
                                "content": "เมื่อมีกฎหมายออกใช้ภายหลังการกระทำผิดยกเลิกความผิดเช่นนั้น"
                            },
                            {
                                "id": "6",
                                "content": "เมื่อคดีขาดอายุความ"
                            },
                            {
                                "id": "7",
                                "content": "เมื่อมีกฎหมายยกเว้นโทษ"
                            }
                        ]
                    }
                ]
            }
        },
        {
            "id": "มาตรา 57",
            "title": "จะจับ ขัง จำคุก หรือค้นในที่รโหฐาน ต้องมีหมายศาล",
            "content": {
                "paragraphs": [
                    {
                        "id": 1,
                        "content": "ภายใต้บังคับแห่งบทบัญญัติในมาตรา ๗๘ มาตรา ๗๙ มาตรา ๘๐ มาตรา ๙๒ และมาตรา ๙๔ แห่งประมวลกฎหมายนี้ จะจับ ขัง จำคุก หรือค้นในที่รโหฐานหาตัวคนหรือสิ่งของต้องมีคำสั่งหรือหมายของศาลสำหรับการนั้น"
                    },
                    {
                        "id": 2,
                        "content": "บุคคลซึ่งต้องขังหรือจำคุกตามหมายศาล จะปล่อยไปได้ก็เมื่อมีหมายปล่อยของศาล"
                    }
                ]
            }
        },
        {
            "id": "มาตรา 58",
            "title": "ศาลมีอำนาจออกคำสั่งหรือหมายอาญา",
            "content": {
                "paragraphs": [
                    {
                        "id": 1,
                        "content": "ศาลมีอำนาจออกคำสั่งหรือหมายอาญาได้ภายในเขตอำนาจตามหลักเกณฑ์และวิธีการที่กำหนดในข้อบังคับของประธานศาลฎีกา"
                    }
                ]
            }
        },
        {
            "id": "มาตรา 59",
            "title": "ศาลออกหมายจับ หมายค้น หรือหมายขัง",
            "content": {
                "paragraphs": [
                    {
                        "id": 1,
                        "content": "ศาลจะออกคำสั่งหรือหมายจับ หมายค้น หรือหมายขัง ตามที่ศาลเห็นสมควรหรือโดยมีผู้ร้องขอก็ได้"
                    },
                    {
                        "id": 2,
                        "content": "ในกรณีที่ผู้ร้องขอเป็นพนักงานฝ่ายปกครองหรือตำรวจ ต้องเป็นพนักงานฝ่ายปกครองตั้งแต่ระดับสามหรือตำรวจซึ่งมียศตั้งแต่ชั้นร้อยตำรวจตรีหรือเทียบเท่าขึ้นไป"
                    },
                    {
                        "id": 3,
                        "content": "ในกรณีจำเป็นเร่งด่วนซึ่งมีเหตุอันควรโดยผู้ร้องขอไม่อาจไปพบศาลได้ ผู้ร้องขออาจร้องขอต่อศาลทางโทรศัพท์ โทรสาร สื่ออิเล็กทรอนิกส์ หรือสื่อเทคโนโลยีสารสนเทศประเภทอื่นที่เหมาะสมเพื่อขอให้ศาลออกหมายจับหรือหมายค้นก็ได้ ในกรณีเช่นว่านี้เมื่อศาลสอบถามจนปรากฏว่ามีเหตุที่จะออกหมายจับหรือหมายค้นได้ตามมาตรา ๕๙/๑ และมีคำสั่งให้ออกหมายนั้นแล้ว ให้จัดส่งสำเนาหมายเช่นว่านี้ไปยังผู้ร้องขอโดยทางโทรสาร สื่ออิเล็กทรอนิกส์ หรือสื่อเทคโนโลยีสารสนเทศประเภทอื่น ทั้งนี้ ตามหลักเกณฑ์และวิธีการที่กำหนดในข้อบังคับของประธานศาลฎีกา"
                    },
                    {
                        "id": 4,
                        "content": "เมื่อได้มีการออกหมายตามวรรคสามแล้ว ให้ศาลดำเนินการให้ผู้ที่เกี่ยวข้องกับการขอหมายมาพบศาลเพื่อสาบานตัวโดยไม่ชักช้า โดยจดบันทึกถ้อยคำของบุคคลดังกล่าวและลงลายมือชื่อของศาลผู้ออกหมายไว้ หรือจะใช้เครื่องบันทึกเสียงก็ได้โดยจัดให้มีการถอดเสียงเป็นหนังสือและลงลายมือชื่อของศาลผู้ออกหมาย บันทึกที่มีการลงลายมือชื่อรับรองดังกล่าวแล้ว ให้เก็บไว้ในสารบบของศาล หากความปรากฏต่อศาลในภายหลังว่าได้มีการออกหมายไปโดยฝ่าฝืนต่อบทบัญญัติแห่งกฎหมาย ศาลอาจมีคำสั่งให้เพิกถอนหรือแก้ไขเปลี่ยนแปลงหมายเช่นว่านั้นได้  ทั้งนี้ ศาลจะมีคำสั่งให้ผู้ร้องขอจัดการแก้ไขเพื่อเยียวยาความเสียหายที่เกิดขึ้นแก่บุคคลที่เกี่ยวข้องตามที่เห็นสมควรก็ได้"
                    }
                ]
            }
        },
        {
            "id": "มาตรา 66",
            "title": "เหตุออกหมายจับ เมื่อมีหลักฐานว่าน่าจะกระทำความผิดอาญา",
            "content": {
                "paragraphs": [
                    {
                        "id": 1,
                        "content": "เหตุที่จะออกหมายจับได้มีดังต่อไปนี้",
                        "subsections": [
                            {
                                "id": "1",
                                "content": "เมื่อมีหลักฐานตามสมควรว่าบุคคลใดน่าจะได้กระทำความผิดอาญาซึ่งมีอัตราโทษจำคุกอย่างสูงเกินสามปี หรือ"
                            },
                            {
                                "id": "2",
                                "content": "เมื่อมีหลักฐานตามสมควรว่าบุคคลใดน่าจะได้กระทำความผิดอาญาและมีเหตุอันควรเชื่อว่าจะหลบหนี หรือจะไปยุ่งเหยิงกับพยานหลักฐาน หรือก่อเหตุอันตรายประการอื่น"
                            }
                        ]
                    },
                    {
                        "id": 2,
                        "content": "ถ้าบุคคลนั้นไม่มีที่อยู่เป็นหลักแหล่ง หรือไม่มาตามหมายเรียกหรือตามนัดโดยไม่มีข้อแก้ตัวอันควร ให้สันนิษฐานว่าบุคคลนั้นจะหลบหนี"
                    }
                ]
            }
        },
        {
            "id": "มาตรา 68",
            "title": "หมายจับใช้ได้จนกว่าจะหมดอายุความหรือศาลถอนหมาย",
            "content": {
                "paragraphs": [
                    {
                        "id": 1,
                        "content": "หมายจับคงใช้ได้อยู่จนกว่าจะจับได้ เว้นแต่ความผิดอาญาตามหมายนั้นขาดอายุความหรือศาลซึ่งออกหมายนั้นได้ถอนหมายคืน"
                    }
                ]
            }
        },
        {
            "id": "มาตรา 78",
            "title": "จับโดยไม่มีหมายจับหรือคำสั่งของศาลนั้นไม่ได้",
            "content": {
                "paragraphs": [
                    {
                        "id": 1,
                        "content": "พนักงานฝ่ายปกครองหรือตำรวจจะจับผู้ใดโดยไม่มีหมายจับหรือคำสั่งของศาลนั้นไม่ได้ เว้นแต่",
                        "subsections": [
                            {
                                "id": "1",
                                "content": "เมื่อบุคคลนั้นได้กระทำความผิดซึ่งหน้าดังได้บัญญัติไว้ในมาตรา ๘๐"
                            },
                            {
                                "id": "2",
                                "content": "เมื่อพบบุคคลโดยมีพฤติการณ์อันควรสงสัยว่าผู้นั้นน่าจะก่อเหตุร้ายให้เกิดภยันตรายแก่บุคคลหรือทรัพย์สินของผู้อื่นโดยมีเครื่องมือ อาวุธ หรือวัตถุอย่างอื่นอันสามารถอาจใช้ในการกระทำความผิด"
                            },
                            {
                                "id": "3",
                                "content": "เมื่อมีเหตุที่จะออกหมายจับบุคคลนั้นตามมาตรา ๖๖ (๒) แต่มีความจำเป็นเร่งด่วนที่ไม่อาจขอให้ศาลออกหมายจับบุคคลนั้นได้"
                            },
                            {
                                "id": "4",
                                "content": "เป็นการจับผู้ต้องหาหรือจำเลยที่หนีหรือจะหลบหนีในระหว่างถูกปล่อยชั่วคราวตามมาตรา ๑๑๗"
                            }
                        ]
                    }
                ]
            }
        },
        {
            "id": "มาตรา 80",
            "title": "ความผิดซึ่งหน้า ได้แก่",
            "content": {
                "paragraphs": [
                    {
                        "id": 1,
                        "content": "ที่เรียกว่าความผิดซึ่งหน้านั้น ได้แก่ความผิดซึ่งเห็นกำลังกระทำ หรือพบในอาการใดซึ่งแทบจะไม่มีความสงสัยเลยว่าเขาได้กระทำผิดมาแล้วสด ๆ",
                        "subsections": null
                    },
                    {
                        "id": 2,
                        "content": "อย่างไรก็ดี ความผิดอาญาดังระบุไว้ในบัญชีท้ายประมวลกฎหมายนี้ ให้ถือว่าความผิดนั้นเป็นความผิดซึ่งหน้าในกรณีดังนี้",
                        "subsections": [
                            {
                                "id": "1",
                                "content": "เมื่อบุคคลหนึ่งถูกไล่จับดังผู้กระทำโดยมีเสียงร้องเอะอะ"
                            },
                            {
                                "id": "2",
                                "content": "เมื่อพบบุคคลหนึ่งแทบจะทันทีทันใดหลังจากการกระทำผิดในถิ่นแถวใกล้เคียงกับที่เกิดเหตุนั้นและมีสิ่งของที่ได้มาจากการกระทำผิด หรือมีเครื่องมือ อาวุธหรือวัตถุอย่างอื่นอันสันนิษฐานได้ว่าได้ใช้ในการกระทำผิด หรือมีร่องรอยพิรุธเห็นประจักษ์ที่เสื้อผ้าหรือเนื้อตัวของผู้นั้น"
                            }
                        ]
                    }
                ]
            }
        },
        {
            "id": "มาตรา 81",
            "title": "ห้ามจับในที่รโหฐาน เว้นแต่ทำตามบทบัญญัติว่าด้วยการค้นในที่รโหฐาน",
            "content": {
                "paragraphs": [
                    {
                        "id": 1,
                        "content": "ไม่ว่าจะมีหมายจับหรือไม่ก็ตาม ห้ามมิให้จับในที่รโหฐาน เว้นแต่จะได้ทำตามบทบัญญัติในประมวลกฎหมายนี้อันว่าด้วยการค้นในที่รโหฐาน"
                    }
                ]
            }
        },
        {
            "id": "มาตรา 92",
            "title": "ค้นในที่รโหฐาน ต้องมีหมายค้น เว้นแต่กรณีต่อไปนี้",
            "content": {
                "paragraphs": [
                    {
                        "id": 1,
                        "content": "ห้ามมิให้ค้นในที่รโหฐานโดยไม่มีหมายค้นหรือคำสั่งของศาล เว้นแต่พนักงานฝ่ายปกครองหรือตำรวจเป็นผู้ค้น และในกรณีดังต่อไปนี้",
                        "subsections": [
                            {
                                "id": "1",
                                "content": "เมื่อมีเสียงร้องให้ช่วยมาจากข้างในที่รโหฐาน หรือมีเสียงหรือพฤติการณ์อื่นใดอันแสดงได้ว่ามีเหตุร้ายเกิดขึ้นในที่รโหฐานนั้น"
                            },
                            {
                                "id": "2",
                                "content": "เมื่อปรากฏความผิดซึ่งหน้ากำลังกระทำลงในที่รโหฐาน"
                            },
                            {
                                "id": "3",
                                "content": "เมื่อบุคคลที่ได้กระทำความผิดซึ่งหน้า ขณะที่ถูกไล่จับหนีเข้าไปหรือมีเหตุอันแน่นแฟ้นควรสงสัยว่าได้เข้าไปซุกซ่อนตัวอยู่ในที่รโหฐานนั้น"
                            },
                            {
                                "id": "4",
                                "content": "เมื่อมีพยานหลักฐานตามสมควรว่าสิ่งของที่มีไว้เป็นความผิดหรือได้มาโดยการกระทำความผิดหรือได้ใช้หรือมีไว้เพื่อจะใช้ในการกระทำความผิด หรืออาจเป็นพยานหลักฐานพิสูจน์การกระทำความผิดได้ซ่อนหรืออยู่ในนั้น ประกอบทั้งต้องมีเหตุอันควรเชื่อว่าเนื่องจากการเนิ่นช้ากว่าจะเอาหมายค้นมาได้สิ่งของนั้นจะถูกโยกย้ายหรือทำลายเสียก่อน"
                            },
                            {
                                "id": "5",
                                "content": "เมื่อที่รโหฐานนั้นผู้จะต้องถูกจับเป็นเจ้าบ้าน และการจับนั้นมีหมายจับหรือจับตามมาตรา ๗๘"
                            }
                        ]
                    }
                ]
            }
        },
        {
            "id": "มาตรา 120",
            "title": "ห้ามอัยการยื่นฟ้องโดยมิได้สอบสวนก่อน",
            "content": {
                "paragraphs": [
                    {
                        "id": 1,
                        "content": "ห้ามมิให้พนักงานอัยการยื่นฟ้องคดีใดต่อศาล โดยมิได้มีการสอบสวนในความผิดนั้นก่อน"
                    }
                ]
            }
        },
        {
            "id": "มาตรา 121",
            "title": "ห้ามอัยการสอบสวนคดีความผิดต่อส่วนตัว เว้นแต่มีคำร้องทุกข์",
            "content": {
                "paragraphs": [
                    {
                        "id": 1,
                        "content": "พนักงานสอบสวนมีอำนาจสอบสวนคดีอาญาทั้งปวง"
                    },
                    {
                        "id": 2,
                        "content": "แต่ถ้าเป็นคดีความผิดต่อส่วนตัว ห้ามมิให้ทำการสอบสวน เว้นแต่จะมีคำร้องทุกข์ตามระเบียบ",
                        "subsections": null
                    }
                ]
            }
        }
    ]
}
