{
    "criminal_code": [
        {
            "id": "มาตรา 1",
            "title": "คำนิยาม",
            "content": {
                "paragraphs": [
                    {
                        "id": 1,
                        "content": "ในประมวลกฎหมายนี้",
                        "subsections": [
                            {
                                "id": 1,
                                "content": "“โดยทุจริต” หมายความว่า  เพื่อแสวงหาประโยชน์ที่มิควรได้โดยชอบด้วยกฎหมายสำหรับตนเองหรือผู้อื่น"
                            },
                            {
                                "id": 5,
                                "content": "“อาวุธ” หมายความรวมถึงสิ่งซึ่งไม่เป็นอาวุธโดยสภาพ แต่ซึ่งได้ใช้หรือเจตนาจะใช้ประทุษร้ายร่างกายถึงอันตรายสาหัสอย่างอาวุธ"
                            },
                            {
                                "id": 7,
                                "content": "“เอกสาร” หมายความว่า  กระดาษหรือวัตถุอื่นใดซึ่งได้ทำให้ปรากฏความหมายด้วยตัวอักษร ตัวเลข ผังหรือแผนแบบอย่างอื่น จะเป็นโดยวิธีพิมพ์ถ่ายภาพหรือวิธีอื่นอันเป็นหลักฐานแห่งความหมายนั้น"
                            },
                            {
                                "id": 8,
                                "content": "“เอกสารราชการ” หมายความว่า  เอกสารซึ่งเจ้าพนักงานได้ทำขึ้นหรือรับรองในหน้าที่ และให้หมายความรวมถึงสำเนาเอกสารนั้น ๆ ที่เจ้าพนักงานได้รับรองในหน้าที่ด้วย"
                            },
                            {
                                "id": 9,
                                "content": "“เอกสารสิทธิ” หมายความว่า  เอกสารที่เป็นหลักฐานแห่งการก่อ เปลี่ยนแปลง โอน สงวนหรือระงับซึ่งสิทธิ"
                            },
                            {
                                "id": 14,
                                "content": "“บัตรอิเล็กทรอนิกส์” หมายความว่า\n\n\t (ก) เอกสารหรือวัตถุอื่นใดไม่ว่าจะมีรูปลักษณะใดที่ผู้ออกได้ออกให้แก่ผู้มีสิทธิใช้ ซึ่งจะระบุชื่อหรือไม่ก็ตาม โดยบันทึกข้อมูลหรือรหัสไว้ด้วยการประยุกต์ใช้วิธีการทางอิเล็กตรอน ไฟฟ้า คลื่นแม่เหล็กไฟฟ้า หรือวิธีอื่นใดในลักษณะคล้ายกัน ซึ่งรวมถึงการประยุกต์ใช้วิธีการทางแสงหรือวิธีการทางแม่เหล็กให้ปรากฏความหมายด้วยตัวอักษร ตัวเลข รหัส หมายเลขบัตร หรือสัญลักษณ์อื่นใด ทั้งที่สามารถมองเห็นและมองไม่เห็นด้วยตาเปล่า\n\n\t (ข) ข้อมูล รหัส หมายเลขบัญชี หมายเลขชุดทางอิเล็กทรอนิกส์หรือเครื่องมือทางตัวเลขใด ๆ ที่ผู้ออกได้ออกให้แก่ผู้มีสิทธิใช้ โดยมิได้มีการออกเอกสารหรือวัตถุอื่นใดให้ แต่มีวิธีการใช้ในทำนองเดียวกับ (ก) หรือ\n\n\t (ค) สิ่งอื่นใดที่ใช้ประกอบกับข้อมูลอิเล็กทรอนิกส์เพื่อแสดงความสัมพันธ์ระหว่างบุคคลกับข้อมูลอิเล็กทรอนิกส์ โดยมีวัตถุประสงค์เพื่อระบุตัวบุคคลผู้เป็นเจ้าของ"
                            },
                            {
                                "id": 16,
                                "content": "“เจ้าพนักงาน” หมายความว่า บุคคลซึ่งกฎหมายบัญญัติว่าเป็นเจ้าพนักงานหรือได้รับแต่งตั้งตามกฎหมายให้ปฏิบัติหน้าที่ราชการ ไม่ว่าเป็นประจำหรือครั้งคราว และไม่ว่าจะได้รับค่าตอบแทนหรือไม่"
                            },
                            {
                                "id": 18,
                                "content": "“กระทำชำเรา” หมายความว่า กระทำเพื่อสนองความใคร่ของผู้กระทำ โดยการใช้อวัยวะเพศของผู้กระทำล่วงล้ำอวัยวะเพศ ทวารหนัก หรือช่องปากของผู้อื่น "
                            }
                        ]
                    }
                ]
            }
        },
        {
            "id": "มาตรา 136",
            "title": "ดูหมิ่นเจ้าพนักงาน",
            "content": {
                "paragraphs": [
                    {
                        "id": 1,
                        "content": "ผู้ใดดูหมิ่นเจ้าพนักงานซึ่งกระทำการตามหน้าที่ หรือเพราะได้กระทำการตามหน้าที่",
                        "subsections": null
                    }
                ]
            }
        },
        {
            "id": "มาตรา 137",
            "title": "แจ้งความเท็จ",
            "content": {
                "paragraphs": [
                    {
                        "id": 1,
                        "content": "ผู้ใดแจ้งข้อความอันเป็นเท็จแก่เจ้าพนักงาน ซึ่งอาจทำให้ผู้อื่นหรือประชาชนเสียหาย",
                        "subsections": null
                    }
                ]
            }
        },
        {
            "id": "มาตรา 138",
            "title": "ต่อสู้หรือขัดขวางเจ้าพนักงาน",
            "content": {
                "paragraphs": [
                    {
                        "id": 1,
                        "content": "ผู้ใดต่อสู้ หรือขัดขวางเจ้าพนักงานหรือผู้ซึ่งต้องช่วยเจ้าพนักงานตามกฎหมายในการปฏิบัติการตามหน้าที่",
                        "subsections": null
                    },
                    {
                        "id": 2,
                        "content": "ถ้าการต่อสู้หรือขัดขวางนั้น ได้กระทำโดยใช้กำลังประทุษร้ายหรือขู่เข็ญว่าจะใช้กำลังประทุษร้าย",
                        "subsections": null
                    }
                ]
            }
        },
        {
            "id": "มาตรา 143",
            "title": "คนกลางเรียกหรือรับสินบน",
            "content": {
                "paragraphs": [
                    {
                        "id": 1,
                        "content": "ผู้ใดเรียก รับหรือยอมจะรับทรัพย์สินหรือประโยชน์อื่นใดสำหรับตนเองหรือผู้อื่น เป็นการตอบแทนในการที่จะจูงใจหรือได้จูงใจเจ้าพนักงาน สมาชิกสภานิติบัญญัติแห่งรัฐ สมาชิกสภาจังหวัดหรือสมาชิกสภาเทศบาลโดยวิธีอันทุจริตหรือผิดกฎหมายหรือโดยอิทธิพลของตนให้กระทำการ หรือไม่กระทำการในหน้าที่อันเป็นคุณหรือเป็นโทษแก่บุคคลใด",
                        "subsections": null
                    }
                ]
            }
        },
        {
            "id": "มาตรา 144",
            "title": "ให้สินบนเจ้าพนักงาน",
            "content": {
                "paragraphs": [
                    {
                        "id": 1,
                        "content": "ผู้ใดให้ ขอให้หรือรับว่าจะให้ทรัพย์สินหรือประโยชน์อื่นใดแก่เจ้าพนักงาน สมาชิกสภานิติบัญญัติแห่งรัฐ สมาชิกสภาจังหวัดหรือสมาชิกสภาเทศบาล เพื่อจูงใจให้กระทำการ ไม่กระทำการหรือประวิงการกระทำอันมิชอบด้วยหน้าที่",
                        "subsections": null
                    }
                ]
            }
        },
        {
            "id": "มาตรา 147",
            "title": "เจ้าพนักงานยักยอกหรือเบียดบังทรัพย์ของทางราชการ",
            "content": {
                "paragraphs": [
                    {
                        "id": 1,
                        "content": "ผู้ใดเป็นเจ้าพนักงาน มีหน้าที่ซื้อ ทำ จัดการหรือรักษาทรัพย์ใด เบียดบังทรัพย์นั้นเป็นของตน หรือเป็นของผู้อื่นโดยทุจริต หรือโดยทุจริตยอมให้ผู้อื่นเอาทรัพย์นั้นเสีย",
                        "subsections": null
                    }
                ]
            }
        },
        {
            "id": "มาตรา 149",
            "title": "เจ้าพนักงานเรียกหรือรับสินบน",
            "content": {
                "paragraphs": [
                    {
                        "id": 1,
                        "content": "ผู้ใดเป็นเจ้าพนักงานสมาชิกสภานิติบัญญัติแห่งรัฐ สมาชิกสภาจังหวัด หรือสมาชิกสภาเทศบาล เรียก รับ หรือยอมจะรับทรัพย์สิน หรือประโยชน์อื่นใดสำหรับตนเองหรือผู้อื่นโดยมิชอบ เพื่อกระทำการหรือไม่กระทำการอย่างใดในตำแหน่งไม่ว่าการนั้นจะชอบหรือมิชอบด้วยหน้าที่",
                        "subsections": null
                    }
                ]
            }
        },
        {
            "id": "มาตรา 157",
            "title": "ปฏิบัติหน้าที่หรือละเว้นการปฏิบัติหน้าที่โดยมิชอบหรือโดยทุจริต",
            "content": {
                "paragraphs": [
                    {
                        "id": 1,
                        "content": "ผู้ใดเป็นเจ้าพนักงาน ปฏิบัติหรือละเว้นการปฏิบัติหน้าที่โดยมิชอบ เพื่อให้เกิดความเสียหายแก่ผู้หนึ่งผู้ใด หรือปฏิบัติหรือละเว้นการปฏิบัติหน้าที่โดยทุจริต",
                        "subsections": null
                    }
                ]
            }
        },
        {
            "id": "มาตรา 172",
            "title": "แจ้งความเท็จเกี่ยวกับความผิดอาญา",
            "content": {
                "paragraphs": [
                    {
                        "id": 1,
                        "content": "ผู้ใดแจ้งข้อความอันเป็นเท็จเกี่ยวกับความผิดอาญา แก่พนักงานอัยการ ผู้ว่าคดี พนักงานสอบสวน หรือเจ้าพนักงานผู้มีอำนาจสืบสวนคดีอาญา ซึ่งอาจทำให้ผู้อื่นหรือประชาชนเสียหาย",
                        "subsections": null
                    }
                ]
            }
        },
        {
            "id": "มาตรา 173",
            "title": "แจ้งความเท็จว่าได้มีการกระทำความผิด",
            "content": {
                "paragraphs": [
                    {
                        "id": 1,
                        "content": "ผู้ใดรู้ว่ามิได้มีการกระทำความผิดเกิดขึ้นแจ้งข้อความแก่พนักงานสอบสวนหรือเจ้าพนักงานผู้มีอำนาจสืบสวนคดีอาญาว่า ได้มีการกระทำความผิด",
                        "subsections": null
                    }
                ]
            }
        },
        {
            "id": "มาตรา 177",
            "title": "เบิกความเท็จ",
            "content": {
                "paragraphs": [
                    {
                        "id": 1,
                        "content": "ผู้ใดเบิกความอันเป็นเท็จในการพิจารณาคดีต่อศาล ถ้าความเท็จนั้นเป็นข้อสำคัญในคดี",
                        "subsections": null
                    },
                    {
                        "id": 2,
                        "content": "ถ้าความผิดดังกล่าวในวรรคแรก ได้กระทำในการพิจารณาคดีอาญา",
                        "subsections": null
                    }
                ]
            }
        }
    ]
}
