{
    "criminal_code": [
        {
            "id": "มาตรา 1",
            "title": "คำนิยาม",
            "content": {
                "paragraphs": [
                    {
                        "id": 1,
                        "content": "ในประมวลกฎหมายนี้",
                        "subsections": [
                            {
                                "id": 1,
                                "content": "“โดยทุจริต” หมายความว่า  เพื่อแสวงหาประโยชน์ที่มิควรได้โดยชอบด้วยกฎหมายสำหรับตนเองหรือผู้อื่น"
                            },
                            {
                                "id": 5,
                                "content": "“อาวุธ” หมายความรวมถึงสิ่งซึ่งไม่เป็นอาวุธโดยสภาพ แต่ซึ่งได้ใช้หรือเจตนาจะใช้ประทุษร้ายร่างกายถึงอันตรายสาหัสอย่างอาวุธ"
                            },
                            {
                                "id": 7,
                                "content": "“เอกสาร” หมายความว่า  กระดาษหรือวัตถุอื่นใดซึ่งได้ทำให้ปรากฏความหมายด้วยตัวอักษร ตัวเลข ผังหรือแผนแบบอย่างอื่น จะเป็นโดยวิธีพิมพ์ถ่ายภาพหรือวิธีอื่นอันเป็นหลักฐานแห่งความหมายนั้น"
                            },
                            {
                                "id": 8,
                                "content": "“เอกสารราชการ” หมายความว่า  เอกสารซึ่งเจ้าพนักงานได้ทำขึ้นหรือรับรองในหน้าที่ และให้หมายความรวมถึงสำเนาเอกสารนั้น ๆ ที่เจ้าพนักงานได้รับรองในหน้าที่ด้วย"
                            },
                            {
                                "id": 9,
                                "content": "“เอกสารสิทธิ” หมายความว่า  เอกสารที่เป็นหลักฐานแห่งการก่อ เปลี่ยนแปลง โอน สงวนหรือระงับซึ่งสิทธิ"
                            },
                            {
                                "id": 14,
                                "content": "“บัตรอิเล็กทรอนิกส์” หมายความว่า\n\n\t (ก) เอกสารหรือวัตถุอื่นใดไม่ว่าจะมีรูปลักษณะใดที่ผู้ออกได้ออกให้แก่ผู้มีสิทธิใช้ ซึ่งจะระบุชื่อหรือไม่ก็ตาม โดยบันทึกข้อมูลหรือรหัสไว้ด้วยการประยุกต์ใช้วิธีการทางอิเล็กตรอน ไฟฟ้า คลื่นแม่เหล็กไฟฟ้า หรือวิธีอื่นใดในลักษณะคล้ายกัน ซึ่งรวมถึงการประยุกต์ใช้วิธีการทางแสงหรือวิธีการทางแม่เหล็กให้ปรากฏความหมายด้วยตัวอักษร ตัวเลข รหัส หมายเลขบัตร หรือสัญลักษณ์อื่นใด ทั้งที่สามารถมองเห็นและมองไม่เห็นด้วยตาเปล่า\n\n\t (ข) ข้อมูล รหัส หมายเลขบัญชี หมายเลขชุดทางอิเล็กทรอนิกส์หรือเครื่องมือทางตัวเลขใด ๆ ที่ผู้ออกได้ออกให้แก่ผู้มีสิทธิใช้ โดยมิได้มีการออกเอกสารหรือวัตถุอื่นใดให้ แต่มีวิธีการใช้ในทำนองเดียวกับ (ก) หรือ\n\n\t (ค) สิ่งอื่นใดที่ใช้ประกอบกับข้อมูลอิเล็กทรอนิกส์เพื่อแสดงความสัมพันธ์ระหว่างบุคคลกับข้อมูลอิเล็กทรอนิกส์ โดยมีวัตถุประสงค์เพื่อระบุตัวบุคคลผู้เป็นเจ้าของ"
                            },
                            {
                                "id": 16,
                                "content": "“เจ้าพนักงาน” หมายความว่า บุคคลซึ่งกฎหมายบัญญัติว่าเป็นเจ้าพนักงานหรือได้รับแต่งตั้งตามกฎหมายให้ปฏิบัติหน้าที่ราชการ ไม่ว่าเป็นประจำหรือครั้งคราว และไม่ว่าจะได้รับค่าตอบแทนหรือไม่"
                            },
                            {
                                "id": 18,
                                "content": "“กระทำชำเรา” หมายความว่า กระทำเพื่อสนองความใคร่ของผู้กระทำ โดยการใช้อวัยวะเพศของผู้กระทำล่วงล้ำอวัยวะเพศ ทวารหนัก หรือช่องปากของผู้อื่น "
                            }
                        ]
                    }
                ]
            }
        },
        {
            "id": "มาตรา 2",
            "title": "ความผิดต่อความสงบสุขของประชาชน",
            "content": {
                "paragraphs": [
                    {
                        "id": 1,
                        "content": "ผู้ใดแสดงให้ประชาชนเห็นหรือได้ยินหรือได้อ่านซึ่งเอกสารหรือภาพอันเป็นเท็จ อันอาจทำให้ประชาชนตกใจหรือตกอกตกใจ",
                        "subsections": null
                    }
                ]
            }
        }
    ]
}
