
{
    "establishment_of_administrative_courts_and_administrative_court_procedure_act": [
      {
            "id": "มาตรา 3",
            "title": "ความหมาย ในพระราชบัญญัติ",
            "content": {
                "paragraphs": [
                    {
                        "id": 1,
                        "content": "“หน่วยงานทางปกครอง” หมายความว่า กระทรวง ทบวง กรม ส่วนราชการที่เรียกชื่ออย่างอื่นและมีฐานะเป็นกรม ราชการส่วนภูมิภาค ราชการส่วนท้องถิ่น รัฐวิสาหกิจที่ตั้งขึ้นโดยพระราชบัญญัติหรือพระราชกฤษฎีกา หรือหน่วยงานอื่นของรัฐ และให้หมายความรวมถึงหน่วยงานที่ได้รับมอบหมายให้ใช้อํานาจทางปกครองหรือให้ดําเนินกิจการทางปกครอง"
                    },
                    {
                        "id": 2,
                        "content": "“เจ้าหน้าที่ของรัฐ” หมายความว่า",
                        "subsections": [
                            {
                                "id": "1",
                                "content": "ข้าราชการ พนักงาน ลูกจ้าง คณะบุคคลหรือผู้ที่ปฏิบัติงานในหน่วยงานทางปกครอง"
                            },
                            {
                                "id": "2",
                                "content": "คณะกรรมการวินิจฉัยข้อพิพาท คณะกรรมการหรือบุคคลซึ่งมีกฎหมายให้อำนาจในการออกกฎ คำสั่ง หรือมติใด ๆ ที่มีผลกระทบต่อบุคคล และ"
                            },
                            {
                                "id": "3",
                                "content": "บุคคลที่อยู่ในบังคับบัญชาหรือในกำกับดูแลของหน่วยงานทางปกครองหรือเจ้าหน้าที่ของรัฐตาม (1) หรือ(2)"
                            }
                        ]
                    },
                    {
                        "id": 3,
                        "content": "“ตุลาการศาลปกครอง” หมายความว่า ตุลาการในศาลปกครองสูงสุดและตุลาการในศาลปกครองชั้นต้น"
                    },
                    {
                        "id": 4,
                        "content": "“ก.ศป.” หมายความว่า คณะกรรมการตุลาการศาลปกครอง"
                    },
                    {
                        "id": 5,
                        "content": "“คู่กรณี” หมายความว่า ผู้ฟ้องคดีผู้ถูกฟ้องคดีและให้หมายความรวมถึงบุคคลหน่วยงานทางปกครอง หรือเจ้าหน้าที่ของรัฐที่เข้ามาเป็นคู่กรณีด้วยการร้องสอดไม่ว่า จะโดยความสมัครใจเอง หรือโดยถูกคำสั่งศาลปกครองเรียกเข้ามาในคดีทั้งนี้เนื่องจากเป็นผู้มีส่วนได้เสีย หรืออาจถูกกระทบจากผลแห่งคดีนั้น และเพื่อประโยชน์แห่งการดำ เนินกระบวนพิจารณา ให้รวมถึงผู้มีสิทธิกระทำการแทนด้วย"
                    },
                    {
                        "id": 6,
                        "content": "“คำฟ้อง” หมายความว่า การเสนอข้อหาต่อศาลไม่ว่าจะได้เสนอต่อศาลปกครองชั้นต้นหรือศาลปกครองสูงสุด ไม่ว่าจะได้เสนอในขณะที่เริ่มคดีโดยคำฟ้องหรือคำร้องขอ หรือเสนอในภายหลังโดยคำฟ้องเพิ่มเติมหรือแก้ไข หรือฟ้องแย้ง หรือโดยสอดเข้าในคดีไม่ว่าด้วยความสมัครใจ หรือถูกบังคับ หรือโดยมีคำขอให้พิจารณาใหม่"
                    },
                    {
                        "id": 7,
                        "content": "“กฎ” หมายความว่า พระราชกฤษฎีกา กฎกระทรวง ประกาศกระทรวงข้อบัญญัติท้องถิ่น ระเบียบ ข้อบังคับ หรือบทบัญญัติอื่นที่มีผลบังคับเป็นการทั่วไป โดยไม่มุ่งหมายให้ใช้บังคับแก่กรณีใดหรือบุคคลใดเป็นการเฉพาะ"
                    },
                    {
                        "id": 8,
                        "content": "“สัญญาทางปกครอง” หมายความรวมถึง สัญญาที่คู่สัญญาอย่างน้อยฝ่ายใดฝ่ายหนึ่งเป็นหน่วยงานทางปกครองหรือเป็นบุคคลซึ่งกระทำการแทนรัฐและมีลักษณะเป็นสัญญาสัมปทาน สัญญาที่ให้จัดทำบริการสาธารณะ หรือจัดให้มีสิ่งสาธารณูปโภคหรือแสวงประโยชน์จากทรัพยากรธรรมชาติ"
                    }
                ]
            }
        },
        {
            "id": "มาตรา 5",
            "title": "ขอบเขตแห่งอำนาจศาลปกครอง",
            "content": {
                "paragraphs": [
                    {
                        "id": 1,
                        "content": "ศาลปกครองมีอำนาจพิจารณาพิพากษาหรือมีคำสั่งในเรื่องดังต่อไปนี้",
                        "subsections": [
                            {
                                "id": "1",
                                "content": "คดีพิพาทเกี่ยวกับการที่หน่วยงานทางปกครองหรือเจ้าหน้าที่ของรัฐกระทำการโดยไม่ชอบด้วยกฎหมายไม่ว่าจะเป็นการออกกฎ คำสั่งหรือการกระทำอื่นใดเนื่องจากกระทำโดยไม่มีอำนาจหรือนอกเหนืออำนาจหน้าที่หรือไม่ถูกต้องตามกฎหมาย หรือโดยไม่ถูกต้องตามรูปแบบขั้นตอน หรือวิธีการอันเป็นสาระสำคัญที่กำหนดไว้สำหรับการกระทำนั้น หรือโดยไม่สุจริตหรือมีลักษณะเป็นการเลือกปฏิบัติที่ไม่เป็นธรรม หรือมีลักษณะเป็นการสร้างขั้นตอนโดยไม่จำเป็น หรือสร้างภาระให้เกิดกับประชาชนเกินสมควร หรือเป็นการใช้อำนาจดุลพินิจโดยมิชอบ"
                            },
                            {
                                "id": "2",
                                "content": "คดีพิพาทเกี่ยวกับการที่หน่วยงานทางปกครองหรือเจ้าหน้าที่ของรัฐละเลยต่อหน้าที่ตามที่กฎหมายกำหนดให้ต้องปฏิบัติหรือปฏิบัติหน้าที่ดังกล่าวล่าช้าเกินสมควร"
                            },
                            {
                                "id": "3",
                                "content": "คดีพิพาทเกี่ยวกับการกระทำละเมิดหรือความรับผิดอื่นของหน่วยงานทางปกครอง"
                            },
                            {
                                "id": "4",
                                "content": "คดีพิพาทเกี่ยวกับสัญญาทางปกครอง"
                            }
                        ]
                    }
                ]
            }
        },
        {
            "id": "มาตรา 42",
            "title": "เงื่อนไขการฟ้องคดีปกครอง",
            "content": {
                "paragraphs": [
                    {
                        "id": 1,
                        "content": "ผู้ใดได้รับความเดือดร้อนหรือเสียหาย หรืออาจจะเดือดร้อนหรือเสียหายโดยมิอาจหลีกเลียงได้ อันเนื่องจากการกระทำหรือการงดเว้นการกระทำของหน่วยงานทางปกครองหรือเจ้าหน้าที่ของรัฐ หรือมีข้อโต้แย้งเกี่ยวกับสัญญาทางปกครองหรือกรณีอื่นใดที่อยู่ในเขตอำนาจศาลปกครองตามมาตรา 9 และการแก้ไขหรือบรรเทาความเดือนร้อนหรือความเสียหายหรือยุติข้อโต้แย้งนั้น ต้องมีคำบังคับตามที่กำหนดในมาตรา 72 ผู้นั้นมีสิทธิฟ้องคดีต่อศาลปกครอง",
                        "subsections": null
                    },
                    {
                        "id": 2,
                        "content": "ในกรณีทีมีกฎหมายกำหนดขั้นตอนหรือวิธีการสำหรับการแก้ไขความเดือดร้อนหรือเสียหายในเรื่องใดไว้โดยเฉพาะการฟ้องคดีปกครองในเรื่องนั้น จะกระทำได้ต่อเมื่อมีการดำเนินการตามขั้นตอนและวิธีการดังกล่าวและได้มีการสั่งการตามกฎหมายนั้น หรือมิได้มีการสั่งการภายในเวลาอนุสมควร หรือภายในเวลาที่กฎหมายนั้นกำหนด",
                        "subsections": null
                    }
                ]
            }
        }
    ]
}
