
{
    "public_debt_management_act": [
      {
            "id": "มาตรา 4",
            "title": "ความหมาย ในพระราชบัญญัติ",
            "content": {
                "paragraphs": [
                    {
                        "id": 1,
                        "content": "“หนี้สาธารณะ” หมายความว่า หนี้ที่กระทรวงการคลัง หน่วยงานของรัฐ หรือรัฐวิสาหกิจกู้ หรือหนี้ที่กระทรวงการคลังค้ำประกัน แต่ไม่รวมถึงหนี้ของรัฐวิสาหกิจที่ทําธุรกิจให้กู้ยืมเงิน ธุรกิจบริหารสินทรัพย์ หรือธุรกิจประกันสินเชื่อ โดยกระทรวงการคลังไม่ได้ค้ำประกัน และหนี้ของธนาคารแห่งประเทศไทย"
                    },
                    {
                        "id": 2,
                        "content": "“การบริหารหนี้สาธารณะ” หมายความว่า การก่อหนี้โดยการกู้หรือการค้ำประกัน การชําระหนี้ การปรับโครงสร้างหนี้ และการดําเนินการอื่นที่เกี่ยวข้องกับหนี้สาธารณะ",
                        "subsections": null
                    }
                ]
            }
        },
        {
            "id": "มาตรา 14",
            "title": "วิธีการปรับโครงสร้างหนี้สาธารณะ",
            "content": {
                "paragraphs": [
                    {
                        "id": 1,
                        "content": "ให้กระทรวงการคลังมีอํานาจปรับโครงสร้างหนี้สาธารณะโดยดําเนินการกู้เงินรายใหม่เพื่อชําระหนี้เดิม แปลงหนี้ชําระหนี้ก่อนถึงกําหนดชําระ ขยายหรือย่นระยะเวลาชําระหนี้ต่ออายุซื้อคืน หรือไถ่ถอนตราสารหนี้ของรัฐบาล หรือทําธุรกรรมทางการเงินอื่นที่เป็นประโยชน์ต่อการปรับโครงสร้างหนี้สาธารณะตามที่กําหนดในกฎกระทรวง",
                        "subsections": null
                    }
                ]
            }
        },
        {
            "id": "มาตรา 15",
            "title": "การชําระหนี้แทนรัฐวิสาหกิจหรือสถาบันการเงินภาครัฐ",
            "content": {
                "paragraphs": [
                    {
                        "id": 1,
                        "content": "เพื่อประโยชน์ในการปรับโครงสร้างหนี้สาธารณะ กระทรวงการคลังอาจชําระหนี้แทนรัฐวิสาหกิจ หรือสถาบันการเงินภาครัฐได้ และเมื่อกระทรวงการคลังได้ชําระหนี้แล้ว ให้หน่วยงานดังกล่าวเป็นหนี้กระทรวงการคลังตามจํานวนเงินที่กระทรวงการคลังได้ชําระ รวมทั้งค่าใช้จ่ายอื่นใดที่เกิดขึ้นจากการดําเนินการดังกล่าว",
                        "subsections": null
                    }
                ]
            }
        },
        {
            "id": "มาตรา 19",
            "title": "การกู้เงินขององค์กรปกครองส่วนท้องถิ่นหรือหน่วยงานในกำกับดูแลของรัฐ",
            "content": {
                "paragraphs": [
                    {
                        "id": 1,
                        "content": "ในกรณีที่องค์กรปกครองส่วนท้องถิ่นใดกู้เงินโดยอาศัยอํานาจตามกฎหมายที่จัดตั้งองค์กรปกครองส่วนท้องถิ่นนั้นหรือกฎหมายอื่นใด โดยมิใช่เป็นการกู้เงินจากกระทรวงการคลัง ห้ามมิให้กระทรวงการคลังหรือหน่วยงานอื่นใดของรัฐเข้ารับผิดชอบหรือค้ําประกันหนี้นั้นหรือตั้งงบประมาณรายจ่ายเพื่อชําระเงินต้นหรือดอกเบี้ยเงินกู้ดังกล่าว",
                        "subsections": null
                    },
                    {
                        "id": 2,
                        "content": "ความในวรรคหนึ่งให้ใช้บังคับกับการกู้เงินของหน่วยงานในกํากับดูแลของรัฐด้วยโดยอนุโลม",
                        "subsections": null
                    }
                ]
            }
        },
        {
            "id": "มาตรา 20",
            "title": "การกู้เงินของรัฐวิสาหกิจหรือสถาบันการเงินภาครัฐ",
            "content": {
                "paragraphs": [
                    {
                        "id": 1,
                        "content": "ให้กระทรวงการคลังกู้เงินได้เฉพาะเพื่อวัตถุประสงค์อย่างหนึ่งอย่างใดดังต่อไปนี้",
                        "subsections": [
                            {
                                "id": 1,
                                "content": "ชดเชยการขาดดุลงบประมาณหรือเมื่อมีรายจ่ายสูงกว่ารายได้"
                            },
                            {
                                "id": 2,
                                "content": "พัฒนาเศรษฐกิจและสังคม"
                            },
                            {
                                "id": 3,
                                "content": "ปรับโครงสร้างหนี้สาธารณะ"
                            },
                            {
                                "id": 4,
                                "content": "ให้หน่วยงานอื่นกู้ต่อ"
                            },
                            {
                                "id": 5,
                                "content": "พัฒนาตลาดตราสารหนี้ในประเทศ"
                            }
                        ]
                    }
                ]
            }
        }
    ]
}
