
{
    "public_debt_management_act": [
      {
            "id": "มาตรา 4",
            "title": "ความหมาย ในพระราชบัญญัติ",
            "content": {
                "paragraphs": [
                    {
                        "id": 1,
                        "content": "“หนี้สาธารณะ” หมายความว่า หนี้ที่กระทรวงการคลัง หน่วยงานของรัฐ หรือรัฐวิสาหกิจกู้หรือหนี้ที่กระทรวงการคลังค้ำประกัน แต่ไม่รวมถึงหนี้ของรัฐวิสาหกิจที่ทําธุรกิจให้กู้ยืมเงืนธุรกิจบริหารสินทรัพย์หรือธุรกิจประกันสินเชื่อ โดยกระทรวงการคลังไม่ได้ค้ำประกัน และหนี้ของธนาคารแห่งประเทศไทย"
                    },
                    {
                        "id": 2,
                        "content": "“เจ้าหน้าที่ของรัฐ” หมายความว่า",
                        "subsections": [
                            {
                                "id": "1",
                                "content": "ข้าราชการ พนักงาน ลูกจ้าง คณะบุคคลหรือผู้ที่ปฏิบัติงานในหน่วยงานทางปกครอง"
                            },
                            {
                                "id": "2",
                                "content": "คณะกรรมการวินิจฉัยข้อพิพาท คณะกรรมการหรือบุคคลซึ่งมีกฎหมายให้อำนาจในการออกกฎ คำสั่ง หรือมติใด ๆ ที่มีผลกระทบต่อบุคคล และ"
                            },
                            {
                                "id": "3",
                                "content": "บุคคลที่อยู่ในบังคับบัญชาหรือในกำกับดูแลของหน่วยงานทางปกครองหรือเจ้าหน้าที่ของรัฐตาม (1) หรือ(2)"
                            }
                        ]
                    }
                ]
            }
        },
        {
            "id": "มาตรา 9",
            "title": "ขอบเขตแห่งอำนาจศาลปกครอง",
            "content": {
                "paragraphs": [
                    {
                        "id": 1,
                        "content": "ศาลปกครองมีอำนาจพิจารณาพิพากษาหรือมีคำสั่งในเรื่องดังต่อไปนี้",
                        "subsections": [
                            {
                                "id": "1",
                                "content": "คดีพิพาทเกี่ยวกับการที่หน่วยงานทางปกครองหรือเจ้าหน้าที่ของรัฐกระทำการโดยไม่ชอบด้วยกฎหมายไม่ว่าจะเป็นการออกกฎ คำสั่งหรือการกระทำอื่นใดเนื่องจากกระทำโดยไม่มีอำนาจหรือนอกเหนืออำนาจหน้าที่หรือไม่ถูกต้องตามกฎหมาย หรือโดยไม่ถูกต้องตามรูปแบบขั้นตอน หรือวิธีการอันเป็นสาระสำคัญที่กำหนดไว้สำหรับการกระทำนั้น หรือโดยไม่สุจริตหรือมีลักษณะเป็นการเลือกปฏิบัติที่ไม่เป็นธรรม หรือมีลักษณะเป็นการสร้างขั้นตอนโดยไม่จำเป็น หรือสร้างภาระให้เกิดกับประชาชนเกินสมควร หรือเป็นการใช้อำนาจดุลพินิจโดยมิชอบ"
                            },
                            {
                                "id": "2",
                                "content": "คดีพิพาทเกี่ยวกับการที่หน่วยงานทางปกครองหรือเจ้าหน้าที่ของรัฐละเลยต่อหน้าที่ตามที่กฎหมายกำหนดให้ต้องปฏิบัติหรือปฏิบัติหน้าที่ดังกล่าวล่าช้าเกินสมควร"
                            },
                            {
                                "id": "3",
                                "content": "คดีพิพาทเกี่ยวกับการกระทำละเมิดหรือความรับผิดอื่นของหน่วยงานทางปกครอง"
                            },
                            {
                                "id": "4",
                                "content": "คดีพิพาทเกี่ยวกับสัญญาทางปกครอง"
                            }
                        ]
                    }
                ]
            }
        },
        {
            "id": "มาตรา 42",
            "title": "เงื่อนไขการฟ้องคดีปกครอง",
            "content": {
                "paragraphs": [
                    {
                        "id": 1,
                        "content": "ผู้ใดได้รับความเดือดร้อนหรือเสียหาย หรืออาจจะเดือดร้อนหรือเสียหายโดยมิอาจหลีกเลี่ยงได้ อันเนื่องจากการกระทำหรือการงดเว้นการกระทำของหน่วยงานทางปกครองหรือเจ้าหน้าที่ของรัฐ หรือมีข้อโต้แย้งเกี่ยวกับสัญญาทางปกครองหรือกรณีอื่นใดที่อยู่ในเขตอำนาจศาลปกครองตามมาตรา 9 และการแก้ไขหรือบรรเทาความเดือนร้อนหรือความเสียหายหรือยุติข้อโต้แย้งนั้น ต้องมีคำบังคับตามที่กำหนดในมาตรา 72 ผู้นั้นมีสิทธิฟ้องคดีต่อศาลปกครอง",
                        "subsections": null
                    },
                    {
                        "id": 2,
                        "content": "ในกรณีทีมีกฎหมายกำหนดขั้นตอนหรือวิธีการสำหรับการแก้ไขความเดือดร้อนหรือเสียหายในเรื่องใดไว้โดยเฉพาะการฟ้องคดีปกครองในเรื่องนั้น จะกระทำได้ต่อเมื่อมีการดำเนินการตามขั้นตอนและวิธีการดังกล่าวและได้มีการสั่งการตามกฎหมายนั้น หรือมิได้มีการสั่งการภายในเวลาอนุสมควร หรือภายในเวลาที่กฎหมายนั้นกำหนด",
                        "subsections": null
                    }
                ]
            }
        },
        {
            "id": "มาตรา 49",
            "title": "ระยะเวลาในการฟ้องคดีปกครอง",
            "content": {
                "paragraphs": [
                    {
                        "id": 1,
                        "content": "การฟ้องคดีปกครองจะต้องยื่นฟ้องภายในเก้าสิบวัน นับแต่วันที่รู้หรือควรรู้ถึงเหตุแห่งการฟ้องคดีหรือนับแต่วันที่พ้นกำหนดเก้าสิบวันนับแต่วันที่ผู้ฟ้องคดีได้มีหนังสือร้องขอต่อหน่วยงานทางปกครองหรือเจ้าหน้าที่ของรัฐเพื่อให้ปฏิบัติหน้าที่ตามที่กฎหมายกำหนดและไม่ได้รับหนังสือชี้แจงจากหน่วยงานทางปกครอง หรือเจ้าหน้าที่ของรัฐหรือได้รับแต่เป็นคำชี้แจงที่ผู้ฟ้องคดีเห็นว่า ไม่มีเหตุผลแล้วแต่กรณี",
                        "subsections": null
                    }
                ]
            }
        },
        {
            "id": "มาตรา 51",
            "title": "การฟ้องคดีตามมาตรา 9วรรคหนึง (3) หรือ(4) ให้ยื่น ฟ้องภายในหนึงปี",
            "content": {
                "paragraphs": [
                    {
                        "id": 1,
                        "content": "การฟ้องคดีตามมาตรา 9วรรคหนึง (3) หรือ(4) ให้ยนื ฟ้องภายในหนึงปีนับแต่วันที่รู้หรือควรรู้ถึงเหตุแห่งการฟ้องคดีแต่ไม่เกินสิบปีนับแต่วันที่มีเหตุแห่งการฟ้องคด",
                        "subsections": null
                    }
                ]
            }
        },
        {
            "id": "มาตรา 52",
            "title": "ข้อยกเว้นระยะเวลาในการฟ้องคดีปกครอง",
            "content": {
                "paragraphs": [
                    {
                        "id": 1,
                        "content": "การฟ้องคดีปกครองทีเกียวกับการคุ้มครองประโยชน์สาธารณะหรือสถานะของบุคคลจะยื่นฟ้องเมื่อใดก็ได้"
                    },
                    {
                        "id": 2,
                        "content": "การฟ้องคดีปกครองที่ยื่นเมื่อพ้นกำหนดเวลาการฟ้องคดีแล้ว ถ้าศาลปกครองเห็นว่าคดีที่ยื่นฟ้องนั้นจะเป็นประโยชน์แก่ส่วนรวมหรือมีเหตุจำเป็นอื่นโดยศาลเห็นเองหรือคู่กรณีมีคำขอ ศาลปกครองจะรับไว้พิจารณาก็ได้"
                    }
                ]
            }
        },
        {
            "id": "มาตรา 72",
            "title": "คำบังคับในการฟ้องคดีปกครอง",
            "content": {
                "paragraphs": [
                    {
                        "id": 1,
                        "content": "ในการพิพากษาคดีศาลปกครองมีอาํนาจกำหนดคำบังคับอย่างหนึ่งอย่างใด ดังต่อไปนี้",
                        "subsections": [
                            {
                                "id": "1",
                                "content": "สั่งให้เพิกถอนกฎหรือคำสั่งหรือสั่งห้ามการกระทำทั้งหมดหรือบางส่วนในกรณีที่มีการฟ้องว่าหน่วยงานทางปกครองหรือเจ้าหน้าที่ของรัฐกระทำการโดยไม่ชอบด้วยกฎหมายตามมาตรา 9 วรรคหนึ่ง (1)"
                            },
                            {
                                "id": "2",
                                "content": "สั่งให้หัวหน้าหน่วยงานทางปกครองหรือเจ้าหน้าที่ของรัฐที่เกี่ยวข้องปฏิบัติตามหน้าที่ภายในเวลาที่ศาลปกครองกำหนด ในกรณีที่มีการฟ้องว่าหน่วยงานทางปกครองหรือเจ้าหน้าที่ของรัฐละเลยต่อหน้าที่หรือปฏิบัติหน้าที่ล่าช้าเกินสมควร"
                            },
                            {
                                "id": "3",
                                "content": "สั่งให้ใชเงินหรือให้ส่งมอบทรัพย์สินหรือให้กระทำการหรืองดเว้นกระทำการโดยจะกำหนดระยะเวลาและเงื่อนไขอื่น ๆ ไว้ด้วยก็ได้ในกรณีที่มีการฟ้องเกี่ยวกับการกระทำละเมิดหรือความรับผิดของหน่วยงานทางปกครองหรือเจ้าหน้าที่ของรัฐหรือการฟ้องเกี่ยวกับสัญญาทางปกครอง"
                            },
                            {
                                "id": "4",
                                "content": "สั่งให้ถือปฏิบัติต่อสิทธิหรือหน้าที่ของบุคคลที่เกี่ยวข้อง ในกรณีที่มีการฟ้องให้ศาลมีคำพิพากษาแสดงความเป็นอยู่ของสิทธิหรือหน้าที่นั้น"
                            }
                        ]
                    }
                ]
            }
        }
    ]
}
