{
    "standart_qualifications_of_state_enterprise_directors_and_officials_act": [
        {
            "id": "มาตรา 4",
            "title": "ความหมายของรัฐวิสาหกิจ",
            "content": {
                "paragraphs": [
                    {
                        "id": 1,
                        "content": "ในพระราชบัญญัตินี้ “รัฐวิสาหกิจ” หมายความว่า",
                        "subsections": [
                            {
                                "id": "1",
                                "content": "องค์การของรัฐบาลตามกฎหมายว่าด้วยการจัดตั้งองค์การของรัฐบาล หรือกิจการของรัฐตามกฎหมายที่จัดตั้งกิจการนั้น และหมายความรวมถึงหน่วยงานธุรกิจที่รัฐเป็นเจ้าของ แต่ไม่รวมถึงองค์การหรือกิจการ ที่มีวัตถุประสงค์เฉพาะเพื่อสงเคราะห์หรือส่งเสริมการใด ๆ ที่มิใช่ธุรกิจ"
                            },
                            {
                                "id": "2",
                                "content": "บริษัทจํากัดหรือห้างหุ้นส่วนนิติบุคคลที่กระทรวง ทบวง กรม หรือทบวงการเมืองที่มีฐานะเทียบเท่า และหรือรัฐวิสาหกิจตาม (๑) มีทุนรวมอยู่ด้วยเกินร้อยละห้าสิบ หรือ"
                            },
                            {
                                "id": "3",
                                "content": "บริษัทจํากัดหรือห้างหุ้นส่วนนิติบุคคลที่กระทรวง ทบวง กรม หรือทบวงการเมืองที่มีฐานะเทียบเท่า และหรือรัฐวิสาหกิจตาม (๑) และหรือ (๒) มีทุนรวมอยู่ด้วยถึงสองในสาม"
                            }
                        ]
                    }
                ]
            }
        },
        {
            "id": "มาตรา 5",
            "title": "คุณสมบัติและลักษณะต้องห้ามของกรรมการรัฐวิสาหกิจ",
            "content": {
                "paragraphs": [
                    {
                        "id": 1,
                        "content": "กรรมการของรัฐวิสาหกิจนอกจากต้องมีคุณสมบัติและไม่มีลักษณะต้องห้ามตามที่กําหนดไว้สําหรับรัฐวิสาหกิจนั้น ๆ แล้ว ยังต้องมีคุณสมบัติและไม่มีลักษณะต้องห้ามดังต่อไปนี้ด้วย",
                        "subsections": [
                            {
                                "id": "1",
                                "content": "มีสัญชาติไทย"
                            },
                            {
                                "id": "2",
                                "content": "มีอายุไม่เกินหกสิบห้าปีบริบูรณ์"
                            },
                            {
                                "id": "3",
                                "content": "มีคุณวุฒิและประสบการณ์เหมาะสมกับกิจการของรัฐวิสาหกิจนั้น ๆ"
                            },
                            {
                                "id": "4",
                                "content": "ไม่เป็นบุคคลล้มละลาย หรือไม่เคยเป็นบุคคลล้มละลายทุจริต"
                            },
                            {
                                "id": "5",
                                "content": "ไม่เคยได้รับโทษจําคุกโดยคําพิพากษาถึงที่สุดให้จําคุก เว้นแต่เป็นโทษสําหรับความผิดที่ได้กระทําโดยประมาทหรือความผิดลหุโทษ"
                            },
                            {
                                "id": "6",
                                "content": "ไม่เคยถูกลงโทษทางปกครองให้ออก ปลด หรือลาออกจากราชการ เนื่องจากทุจริต หรือประพฤติชั่ว"
                            },
                            {
                                "id": "7",
                                "content": "ไม่เป็นผู้ดํารงตําแหน่งใดในพรรคการเมือง หรือเจ้าหน้าที่ของพรรคการเมือง"
                            },
                            {
                                "id": "7/1",
                                "content": "ไม่เคยถูกไล่ออก ปลดออก หรือให้ออกจากงาน เพราะทุจริตต่อหน้าที่"
                            },
                            {
                                "id": "8",
                                "content": "ไม่เป็นผู้ถือหุ้นของรัฐวิสาหกิจนั้นหรือผู้ถือหุ้นของนิติบุคคลที่รัฐวิสาหกิจนั้นถือหุ้นอยู่"
                            },
                            {
                                "id": "9",
                                "content": "ไม่เป็นผู้ดํารงตําแหน่งใดในนิติบุคคลที่รัฐวิสาหกิจนั้นเป็นผู้ถือหุ้น เว้นแต่คณะกรรมการของรัฐวิสาหกิจนั้นมอบหมายให้ดํารงตําแหน่งกรรมการหรือดํารงตําแหน่งอื่นในนิติบุคคลที่รัฐวิสาหกิจนั้นเป็นผู้ถือหุ้น"
                            },
                            {
                                "id": "10",
                                "content": "ไม่เป็นกรรมการ หรือผู้บริหาร หรือผู้มีอํานาจในการจัดการ หรือมีส่วนได้เสียในนิติบุคคลซึ่งเป็นผู้รับสัมปทาน ผู้ร่วมทุน หรือมีประโยชน์ได้เสียเกี่ยวข้องกับกิจการของรัฐวิสาหกิจนั้น เว้นแต่เป็นประธานกรรมการ กรรมการ หรือผู้บริหารโดยการมอบหมายของรัฐวิสาหกิจนั้น"
                            }
                        ]
                    },
                    {
                        "id": 2,
                        "content": "ความใน (๑) มิให้ใช้บังคับแก่กรรมการชาวต่างประเทศที่รัฐวิสาหกิจจําเป็นต้องแต่งตั้งตามข้อผูกพัน หรือตามลักษณะของกิจการ"
                    },
                    {
                        "id": 3,
                        "content": "ความใน (๘) มิให้ใช้บังคับแก่กรรมการที่ไม่เป็นข้าราชการ พนักงาน หรือลูกจ้างที่มีตําแหน่งหรือเงินเดือนประจําตําแหน่งของราชการส่วนกลาง ราชการส่วนภูมิภาค ราชการส่วนท้องถิ่นหรือหน่วยงานอื่นของรัฐ และกรรมการนั้นถือหุ้นไม่เกินร้อยละศูนย์จุดห้าของทุนชําระแล้วของรัฐวิสาหกิจซึ่งตนเป็นกรรมการหรือนิติบุคคลที่รัฐวิสาหกิจซึ่งตนเป็นกรรมการถือหุ้นอยู่"
                    }
                ]
            }
        },
        {
            "id": "มาตรา 9",
            "title": "คุณสมบัติและลักษณะต้องห้ามของพนักงานรัฐวิสาหกิจ",
            "content": {
                "paragraphs": [
                    {
                        "id": 1,
                        "content": "พนักงานของรัฐวิสาหกิจ นอกจากต้องมีคุณสมบัติและไม่มีลักษณะต้องห้ามตามที่กําหนดไว้สําหรับรัฐวิสาหกิจนั้น ๆ แล้ว ยังต้องมีคุณสมบัติและไม่มีลักษณะต้องห้ามดังต่อไปนี้ด้วย",
                        "subsections": [
                            {
                                "id": "1",
                                "content": "มีสัญชาติไทย"
                            },
                            {
                                "id": "2",
                                "content": "มีอายุไม่เกินหกสิบปีบริบูรณ"
                            },
                            {
                                "id": "3",
                                "content": "สามารถทํางานให้แก่รัฐวิสาหกิจนั้นได้เต็มเวลา"
                            },
                            {
                                "id": "4",
                                "content": "ไม่เป็นบุคคลล้มละลาย หรือไม่เคยเป็นบุคคลล้มละลายทุจริต"
                            },
                            {
                                "id": "5",
                                "content": "ไม่เคยต้องคําพิพากษาถึงที่สุดให้จําคุก ไม่ว่าจะได้รับโทษจําคุกจริงหรือไม่ เว้นแต่เป็นโทษสําหรับความผิดที่ได้กระทําโดยประมาทหรือความผิดลหุโทษ หรือพ้นโทษหรือพ้นระยะเวลาการรอการลงโทษหรือรอการกําหนดโทษ แล้วแต่กรณีเกินห้าปี"
                            },
                            {
                                "id": "5/1",
                                "content": "ไม่เป็นบุคคลวิกลจริตหรือจิตฟั่นเฟือนไม่สมประกอบ"
                            },
                            {
                                "id": "5/2",
                                "content": "ไม่เคยต้องคําพิพากษาหรือคําสั่งของศาลให้ทรัพย์สินตกเป็นของแผ่นดินเพราะร่ํารวยผิดปกติหรือมีทรัพย์สินเพิ่มขึ้นผิดปกติ"
                            },
                            {
                                "id": "6",
                                "content": "ไม่เป็นข้าราชการซึ่งมีตําแหน่งหรือเงินเดือนประจํา รวมทั้งข้าราชการการเมือง ลูกจ้างของกระทรวง ทบวง กรม หรือทบวงการเมืองซึ่งมีฐานะเทียบเท่า พนักงานส่วนท้องถิ่น และสมาชิกสภาท้องถิ่นหรือสภากรุงเทพมหานครและผู้บริหารท้องถิ่น"
                            },
                            {
                                "id": "7",
                                "content": "ไม่เป็นผู้ดํารงตําแหน่งใดในพรรคการเมือง หรือเจ้าหน้าที่ของพรรคการเมือง"
                            },
                            {
                                "id": "7/1",
                                "content": "ไม่เคยถูกไล่ออก ปลดออก หรือให้ออกจากงาน เพราะทุจริตต่อหน้าที่"
                            }
                        ]
                    },
                    {
                        "id": 2,
                        "content": "ความใน (๑) มิให้ใช้บังคับแก่พนักงานชาวต่างประเทศซึ่งรัฐวิสาหกิจมีความจําเป็นต้องจ้างตามลักษณะงานของรัฐวิสาหกิจนั้น"
                    },
                    {
                        "id": 3,
                        "content": "ความใน (๓) มิให้ใช้บังคับแก่พนักงานที่เป็นที่ปรึกษาคณะกรรมการ ที่ปรึกษารัฐวิสาหกิจ เลขานุการ และผู้ช่วยเลขานุการของคณะกรรมการ"
                    }
                ]
            }
        }
    ]
}
