{
    "treasury_reserves_act": [
        {
            "id": "มาตรา 4",
            "title": "เงินที่พึงชำระให้แก่รัฐบาล",
            "content": {
                "paragraphs": [
                    {
                        "id": 1,
                        "content": "ภายใต้บังคับแห่งมาตรา ๑๓ บรรดาเงินทั้งปวงที่พึงชำระให้แก่รัฐบาลไม่ว่าเป็นภาษีอากร ค่าธรรมเนียม ค่าปรับ เงินกู้หรือเงินอื่นใด หัวหน้าส่วนราชการที่ได้เก็บหรือรับเงินนั้นมีหน้าที่ควบคุมให้ส่งเข้าบัญชีเงินคงคลังบัญชีที่ ๑ หรือส่งคลังจังหวัดหรือคลังอำเภอตามกำหนดเวลาและข้อบังคับที่รัฐมนตรีกำหนด โดยไม่หักเงินไว้เพื่อการใด ๆ เลย",
                        "subsections": null
                    },
                    {
                        "id": 2,
                        "content": "รัฐมนตรีมีอำนาจกำหนดข้อบังคับอนุญาตให้หัวหน้าส่วนราชการใด ๆ หักรายจ่ายจากเงินที่จะต้องส่งเข้าบัญชีเงินคงคลังบัญชีที่ ๑ หรือส่งคลังจังหวัดหรือคลังอำเภอได้ ในกรณีดั่งนี้",
                        "subsections": [
                            {
                                "id": 1,
                                "content": "รายจ่ายที่หักนั้นเป็นรายจ่ายที่มีกฎหมายอนุญาตให้จ่ายได้",
                                "subsections": null
                            },
                            {
                                "id": 2,
                                "content": "รายจ่ายที่จำเป็นต้องจ่ายตามระเบียบที่ได้รับความตกลงจากกระทรวงการคลังเพื่อเป็นค่าสินบนรางวัล หรือค่าใช้จ่ายในการจัดให้ได้มาซึ่งเงินอันพึงต้องชำระให้แก่รัฐบาล",
                                "subsections": null
                            },
                            {
                                "id": 3,
                                "content": "รายจ่ายที่ต้องจ่ายคืนให้แก่บุคคลใด ๆ เพราะเป็นเงินอันไม่พึงต้องชำระให้แก่รัฐบาล",
                                "subsections": null
                            }
                        ]
                    }
                ]
            }
        },
        {
            "id": "มาตรา 5",
            "title": "การใช้เงินจากบัญชีเงินคงคลังบัญชีที่ ๑",
            "content": {
                "paragraphs": [
                    {
                        "id": 1,
                        "content": "การสั่งจ่ายเงินจากบัญชีเงินคงคลังบัญชีที่ ๑ ให้กระทำได้แต่เพื่อโอนเงินไปเข้าบัญชีเงินคงคลังบัญชีที่ ๒ เท่านั้น",
                        "subsections": null
                    }
                ]
            }
        },
        {
            "id": "มาตรา 6",
            "title": "การสั่งจ่ายเงินจากบัญชีเงินคงคลังบัญชีที่ ๒",
            "content": {
                "paragraphs": [
                    {
                        "id": 1,
                        "content": "ภายใต้บังคับแห่งมาตรา ๗ มาตรา ๘ และมาตรา ๑๒ การสั่งจ่ายเงินจากบัญชีเงินคงคลังบัญชีที่ ๒ หรือคลังจังหวัดหรือคลังอำเภอ ให้กระทำได้แต่เฉพาะตามที่บัญญัติไว้ในพระราชบัญญัติงบประมาณประจำปี พระราชบัญญัติงบประมาณเพิ่มเติม พระราชบัญญัติโอนเงินในงบประมาณ มติให้จ่ายเงินไปก่อน หรือพระราชกำหนดที่ออกตามความในบทบัญญัติแห่งรัฐธรรมนูญ",
                        "subsections": null
                    },
                    {
                        "id": 2,
                        "content": "ในกรณีที่จ่ายเงินตามมติให้จ่ายเงินไปก่อนหรือตามพระราชกำหนด ให้ตั้งเงินรายจ่ายเพื่อชดใช้ในพระราชบัญญัติงบประมาณประจำปี หรือพระราชบัญญัติงบประมาณเพิ่มเติม"
                    }
                ]
            }
        },
        {
            "id": "มาตรา 7",
            "title": "การสั่งจ่ายเงินล่วงหน้า",
            "content": {
                "paragraphs": [
                    {
                        "id": 1,
                        "content": "ในกรณีต่อไปนี้ ให้สั่งจ่ายเงินจากบัญชีเงินคงคลังบัญชีที่ ๒ หรือคลังจังหวัด หรือคลังอำเภอได้ก่อนที่มีกฎหมายอนุญาตให้จ่าย คือ",
                        "subsections": [
                            {
                                "id": 1,
                                "content": "รายการจ่ายที่มีการอนุญาตให้จ่ายเงินได้แล้วตามกฎหมายว่าด้วยงบประมาณรายจ่ายประจำปีงบประมาณ แต่เงินที่ตั้งไว้มีจำนวนไม่พอจ่ายและพฤติการณ์เกิดขึ้นให้มีความจำเป็นต้องจ่ายโดยเร็ว",
                                "subsections": null
                            },
                            {
                                "id": 2,
                                "content": "มีกฎหมายใด ๆ ที่กระทำให้ต้องจ่ายเงินเพื่อปฏิบัติตามกฎหมายนั้น ๆ และมีความจำเป็นต้องจ่ายโดยเร็ว",
                                "subsections": null
                            },
                            {
                                "id": 3,
                                "content": "มีข้อผูกพันกับรัฐบาลต่างประเทศหรือสถาบันการเงินระหว่างประเทศที่กระทำให้ต้องจ่ายเงิน และมีความจำเป็นต้องจ่ายโดยเร็ว",
                                "subsections": null
                            },
                            {
                                "id": 4,
                                "content": "เพื่อซื้อคืนหรือไถ่ถอนพันธบัตรของรัฐบาลหรือตราสารเงินกู้ของกระทรวงการคลัง หรือชำระหนี้ตามสัญญากู้ที่กระทรวงการคลังเป็นผู้กู้ ทั้งนี้ ตามจำนวนที่รัฐมนตรีเห็นสมควร",
                                "subsections": null
                            },
                            {
                                "id": 5,
                                "content": "เพื่อซื้อเงินตราต่างประเทศ พันธบัตรของรัฐบาลต่างประเทศ หรือหลักทรัพย์ที่มั่นคงในต่างประเทศที่ไม่ใช่หุ้นในสกุลเงินตราที่จะต้องชำระหนี้ที่กระทรวงการคลังเป็นผู้กู้ และในวงเงินไม่เกินจำนวนหนี้ที่ถึงกำหนดชำระในช่วงระยะเวลาไม่เกิน ๕ ปี เพื่อนำไปใช้ประโยชน์ในการชำระหนี้เมื่อถึงกำหนด ทั้งนี้ให้รัฐมนตรีโดยความเห็นชอบของคณะรัฐมนตรีมีอำนาจกำหนดข้อบังคับเกี่ยวกับการซื้อเงินตราต่างประเทศพันธบัตรของรัฐบาลต่างประเทศ และหลักทรัพย์ที่มั่นคงในต่างประเทศที่ไม่ใช่หุ้น การนำเงินตราต่างประเทศฝากธนาคาร รวมทั้งวิธีปฏิบัติอื่นใดที่เกี่ยวข้อง",
                                "subsections": null
                            }
                        ]
                    },
                    {
                        "id": 2,
                        "content": "การจ่ายเงินในห้ากรณีข้างต้นนี้ เมื่อได้จ่ายแล้วให้ตั้งเงินรายจ่ายเพื่อชดใช้ในกฎหมายว่าด้วยงบประมาณรายจ่ายเพิ่มเติมประจำปีงบประมาณ หรือในกฎหมายว่าด้วยโอนงบประมาณรายจ่าย หรือในกฎหมายว่าด้วยงบประมาณรายจ่ายประจำปีงบประมาณปีต่อไป"
                    }
                ]
            }
        }
    ]
}
